var store = [{
        "title": "Αρχέτυπα",
        "excerpt":"Banzi, M. (2009). Getting Started with arduino. O’Reilly Media, Inc.   Card, S. K., English, W. K., &amp; Burr, B. J. (1978). Evaluation of mouse, rate-controlled isometric joystick, step keys, and text keys for text selection on a CRT. Ergonomics, 21(8), 601-613.   Cassell, J. (Ed.). (2000). Embodied conversational agents. MIT press.   Ken Hinckley, Koji Yatani, Michel Pahud, Nicole Coddington, Jenny Rodenhouse, Andy Wilson, Hrvoje Benko, and Bill Buxton. 2010. Pen + touch = new tools. In Proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST ‘10). ACM, New York, NY, USA, 27-36.   Igoe, T. (2007). Making things talk: practical methods for connecting physical objects. O’reilly.   McEwen, A, Cassimally, H. (2013). Designing the Internet of Things. Wiley.   Reeves, B., &amp; Nass, C. (1996). How people treat computers, television, and new media like real people and places. CSLI Publications and Cambridge university press.   Shneiderman, B., &amp; Maes, P. (1997). Direct manipulation vs. interface agents. interactions, 4(6), 42-61.   O’Sullivan, D., &amp; Igoe, T. (2004). Physical computing: sensing and controlling the Physical world with computers. Cengage Learning.  ","categories": [],
        "tags": [],
        "url": "https://mibook.github.io/gr/bibliography/archetypes/",
        "teaser":null},{
        "title": "Ορισμός",
        "excerpt":"Beaudouin-Lafon, M. (2004, May). Designing interaction, not interfaces. In Proceedings of the working conference on Advanced visual interfaces (pp. 15-22). ACM.   Bolter, J.D., Grusin, R. (2000). Remediation: Understanding New Media. The MIT Press.   Deterding, S., Dixon, D., Khaled, R., &amp; Nacke, L. (2011, September). From game design elements to gamefulness: defining gamification. In Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments (pp. 9-15). ACM.   Graham, P. (2004). Hackers and Painters: Big Ideas from the Computer Age. O’Reilly Media   Johnson, J., Roberts, T. L., Verplank, W., Smith, D. C., Irby, C. H., Beard, M., &amp; Mackey, K. (1989). The xerox star: A retrospective. Computer, 22(9), 11-26.   Lanier, J. (2014). Who owns the future?. Simon and Schuster.   Malone, T. W. (1982, March). Heuristics for designing enjoyable user interfaces: Lessons from computer games. In Proceedings of the 1982 conference on Human factors in computing systems (pp. 63-68). ACM.   Noble, J. (2012). Programming Interactivity. O’Reilly.   Reas, C., &amp; Fry, B. (2007). Processing: a programming handbook for visual designers and artists (Vol. 6812). Mit Press.   Samuelson, P., Davis, R., Kapor, M. D., &amp; Reichman, J. H. (1994). A manifesto concerning the legal protection of computer programs. Columbia Law Review, 2308-2431.   Scott Rosenberg (2008). Dreaming in Code: Two Dozen Programmers, Three Years, 4,732 Bugs, and One Quest for Transcendent Software. Three Rivers Press   Thimbleby, H. (2008). Press On:Principles of Interaction Programming. MIT Press   Victor, B. (2012). Learnable Programming  ","categories": [],
        "tags": [],
        "url": "https://mibook.github.io/gr/bibliography/definition/",
        "teaser":null},{
        "title": "Εισαγωγή",
        "excerpt":"Christensen, C.M. (1997). The Innovator’s Dilemma: When New Technologies Cause Great Firms to Fail. Harvard Business Press   Hackathon   Mitra, S., &amp; Dangwal, R. (2010). Limits to self‐organising systems of learning—the Kalikuppam experiment. British Journal of Educational Technology, 41(5), 672-688.   Noble, J. (2012). Programming Interactivity. O’Reilly.   Olsen, D. R. (2009) Building Interactive Systems: Principles for Human-Computer Interaction. Cengage Learning.   Sharp, H. (2003). Interaction design. Wiley.   Thimbleby, H. (2007). Press On:Principles of Interaction Programming. MIT Press   Von Hippel, E. (1995). Democratizing Innovation. Oxford University Press   Ακουμιανάκης, Δ. (2006). Διεπαφή χρήστη - υπολογιστή: Μια σύγχρονη προσέγγιση, Κλειδάριθμος   Παναγιώτης Κουτσαμπάσης (2011). Αλληλεπίδραση ανθρώπου - υπολογιστή: Αρχές, μέθοδοι και παραδείγματα, Κλειδάριθμος   Διομήδης Σπινέλλης (2005). Ανάγνωση κώδικα: Η προοπτική του ανοικτού λογισμικού, Κλειδάριθμος  ","categories": [],
        "tags": [],
        "url": "https://mibook.github.io/gr/bibliography/intro/",
        "teaser":null},{
        "title": "Μέθοδος",
        "excerpt":"Buchenau, M., &amp; Suri, J. F. (2000, August). Experience prototyping. In Proceedings of the 3rd conference on Designing interactive systems: processes, practices, methods, and techniques (pp. 424-433). ACM.   Buxton, B. (2010). Sketching User Experiences: Getting the Design Right and the Right Design. Morgan Kaufmann.   Carroll, J. M. (2000). Making use: scenario-based design of human-computer interactions. MIT press.   Gaver, B., Dunne, T., &amp; Pacenti, E. (1999). Design: cultural probes. interactions, 6(1), 21-29.   Malone, T. W. (1983). How do people organize their desks?: Implications for the design of office information systems. ACM Transactions on Information Systems (TOIS), 1(1), 99-112.   Moggridge, B. (2007). Designing interactions. Cambridge: MIT press.   Norman, D. A. (2002). The design of everyday things. Basic books.   Papanek, V., &amp; Fuller, R. B. (1972). Design for the real world. London: Thames and Hudson.   Pering, C. (2002). Interaction design prototyping of communicator devices: Towards meeting the hardware-software challenge. interactions, 9(6), 36-46.   Pruitt, J., &amp; Grudin, J. (2003, June). Personas: practice and theory. In Proceedings of the 2003 conference on Designing for user experiences (pp. 1-15). ACM.   Thackara, J. (2006). In the bubble: designing in a complex world. MIT press.   Winograd, T. (1996). Bringing Design to Software. ACM, New York, NY, USA.   Κουτσαμπάσης, Π. (2011). Αλληλεπίδραση ανθρώπου - υπολογιστή: Αρχές, μέθοδοι και παραδείγματα, Κλειδάριθμος  ","categories": [],
        "tags": [],
        "url": "https://mibook.github.io/gr/bibliography/method/",
        "teaser":null},{
        "title": "Μοντέλα",
        "excerpt":"Beaudouin-Lafon, M. (2004, May). Designing interaction, not interfaces. In Proceedings of the working conference on Advanced visual interfaces (pp. 15-22). ACM.   Bickmore, T. W., &amp; Picard, R. W. (2005). Establishing and maintaining long-term human-computer relationships. ACM Transactions on Computer-Human Interaction (TOCHI), 12(2), 293-327.   Bly, S. A., Harrison, S. R., &amp; Irwin, S. (1993). Media spaces: bringing people together in a video, audio, and computing environment. Communications of the ACM, 36(1), 28-46.   Card, S. K., Moran, T. P., &amp; Newell, A. (1983). The psychology of human-computer interaction. Lawrence Erlbaum Associates.   Denning, P., &amp; Metcalfe, J. M. (1997). Beyond Calculation: The Next 50 Years of Computing. Copernicus   Findlater, L., &amp; McGrenere, J. (2004, April). A comparison of static, adaptive, and adaptable menus. In Proceedings of the SIGCHI conference on Human factors in computing systems (pp. 89-96). ACM.   Fincher, D. (Director). (2010). The Social Network [Film]. United States: Columbia Pictures.   Fogg, B. J. (2002). Persuasive Technology: Using Computers to Change What We Think and Do. Morgan Kauffman.   Krueger, M. W., Gionfriddo, T., &amp; Hinrichsen, K. (1985, April). VIDEOPLACE—an artificial reality. In ACM SIGCHI Bulletin (Vol. 16, No. 4, pp. 35-40). ACM.   Laurel, B. (2013). Computers as theatre. Addison-Wesley.   McCullough, M. (1998). Abstracting craft: The practiced digital hand. MIT press.   Norman, D. A. (2004). Emotional design: Why we love (or hate) everyday things. Basic books.   Papert, S. (1980). Mindstorms: Children, computers, and powerful ideas. Basic Books, Inc..   Reeves, B., &amp; Nass, C. (1996). How people treat computers, television, and new media like real people and places. CSLI Publications and Cambridge university press.   Rheingold, H. (1985). Tools for thought: The history and future of mind-expanding technology. MIT Press.   Tractinsky, N., Katz, A. S., &amp; Ikar, D. (2000). What is beautiful is usable. Interacting with computers, 13(2), 127-145.  ","categories": [],
        "tags": [],
        "url": "https://mibook.github.io/gr/bibliography/models/",
        "teaser":null},{
        "title": "Σύνθεση και Κλίμακα",
        "excerpt":"Baecker, R. M. (Ed.). (1993). Readings in groupware and computer-supported cooperative work: Assisting human-human collaboration. Morgan Kaufmann.   Bush, V. (1945). As we may think. The atlantic monthly, 176(1), 101-108.   Berners-Lee, T. (1996). WWW: Past, present, and future. Computer, 29(10), 69-77.   Bernstein, M. S., Little, G., Miller, R. C., Hartmann, B., Ackerman, M. S., Karger, D. R., … &amp; Panovich, K. (2010, October). Soylent: a word processor with a crowd inside. In Proceedings of the 23nd annual ACM symposium on User interface software and technology (pp. 313-322). ACM.   Garrett, J. J. (2010). Elements of user experience, the: user-centered design for the web and beyond. Pearson Education.   Herbsleb, J. D. (2007, May). Global software engineering: The future of socio-technical coordination. In 2007 Future of Software Engineering (pp. 188-198). IEEE Computer Society.   Jaimes, A., &amp; Sebe, N. (2007). Multimodal human–computer interaction: A survey. Computer vision and image understanding, 108(1), 116-134.   Licklider, J. C. R. (1960). Man-computer symbiosis. Human Factors in Electronics, IRE Transactions on, (1), 4-11.   Malone, T. W., &amp; Crowston, K. (1994). The interdisciplinary study of coordination. ACM Computing Surveys (CSUR), 26(1), 87-119.   Nelson, T. H. (1987). Computer lib: Dream machines. Tempus Books of Microsoft Press.   Norman, D. A. (1993). Things that make us smart: Defending human attributes in the age of the machine. Basic Books.   Packer, R., &amp; Jordan, K. (2002). Multimedia: from Wagner to virtual reality. WW Norton &amp; Company.   Sellen, A. J., &amp; Harper, R. H. (2002). The myth of the paperless office. MIT press.   Shiffman, Daniel. Learning Processing: A Beginner’s Guide to Programming Images, Animation, and Interaction. Morgan Kaufmann, 2009.   Νικόλαος Αβούρης, Χαράλαμπος Καραγιαννίδης, Βασίλης Ι. Κόμης (επιμέλεια), Συνεργατική τεχνολογία: Συστήματα και μοντέλα συνεργασίας για εργασία, μάθηση, κοινότητες πρακτικής και δημιουργία γνώσης, Κλειδάριθμος, 2009  ","categories": [],
        "tags": [],
        "url": "https://mibook.github.io/gr/bibliography/synthesis/",
        "teaser":null},{
        "title": "Εργαλεία και Τεχνικές",
        "excerpt":"Graham, P. (2004). Hackers and Painters: Big Ideas from the Computer Age. O’Reilly Media   Grudin, J. (1990, March). The computer reaches out: the historical continuity of interface design. In Proceedings of the SIGCHI conference on Human factors in computing systems (pp. 261-268). ACM.   Hunt, A. A. (2000). The pragmatic programmer: from journeyman to master. Addison-Wesley Professional.   McConnell, S. (2004). Code complete. O’Reilly Media, Inc.   Myers, B., Hudson, S. E., &amp; Pausch, R. (2000). Past, present, and future of user interface software tools. ACM Transactions on Computer-Human Interaction (TOCHI), 7(1), 3-28.   Noble, J. (2012). Programming Interactivity. O’Reilly.   Olsen, D. R. (2009) Building Interactive Systems: Principles for Human-Computer Interaction. Cengage Learning.   Raymond, E. (1999). The cathedral and the bazaar. Knowledge, Technology &amp; Policy, 12(3), 23-49.   Reas, C., &amp; Fry, B. (2007). Processing: a programming handbook for visual designers and artists (Vol. 6812). Mit Press.   Thimbleby, H. (2007). Press On:Principles of Interaction Programming. MIT Press   Victor, Β. (2012). Learnable Programming: Designing a Programming System for Understanding Programs  ","categories": [],
        "tags": [],
        "url": "https://mibook.github.io/gr/bibliography/tools/",
        "teaser":null},{
        "title": "Alan Kay",
        "excerpt":"Σύντομη βιογραφία του Alan Kay   Από πολύ μικρή ηλικία ο Alan Kay έχει παρουσιάσει σημαντικά ταλέντα, όπως ανάγνωση πριν πάει στο δημοτικό, με αποτέλεσμα να βαριέται στην τάξη, αφού ήδη γνώριζε την ύλη. Οι βασικές του σπουδές ήταν σε μαθηματικά και βιολογία, ενώ ο ίδιος για μεγάλο διάστημα αυτοπροσδιορίζεται περισσότερο ως μουσικός παρά ως επιστήμονας των υπολογιστών, που ήταν τελικά η επαγγελματική κατεύθυνση που τον έκανε γνωστό. Μάλιστα, λέγεται ότι αποφεύγει τα ταξίδια και τις μετακινήσεις μακρυά από το σπίτι του γιατί θέλει να μπορεί να συντηρεί και να παίζει στο μεγάλο εκλησιαστικό μουσικό όργανο που έχει σπίτι του.   Η πρώτη σημαντική συνεισφορά του ήταν το όραμα και ο σχεδιασμός του Dynabook το 1968, το οποίο μορφολογικά και λειτουργικά μοιάζει πολύ με ένα σύγχρονο (2010) τάμπλετ. Αυτός ο αρχικός σχεδιασμός όμως ήταν τόσο φιλόδοξος που ακόμη και ο ίδιος θεωρεί πως οι σύγχρονοι υπολογιστές δεν εφαρμόζουν ακόμη όλες εκείνες τις οδηγίες τουλάχιστον από την ποιοτική πλευρά. Για να φτάσει στο όραμα του Dynabook ο Alan Kay εστίασε την προσοχή του στο λογισμικό, το οποίο αρχικά ήταν το περιβάλλον Smalltalk που έτρεχε σε έναν από τους πρώτους πειραματικούς επιτραπέζιους υπολογιστές, τον Xerox Alto.   Μετά την εργασία του στο Xerox Parc συνέχισε να δουλεύει στην Apple και μετά στο Viewpoints Institute, αλλά σε κάθε περίπτωση συνέχισε να εργάζεται πάνω στο αρχικό όραμα του Dynabook με ιδιαίτερη έμφαση στον τρόπο που μαθαίνουν τα παιδιά. Δουλεύοντας επίμονα πάνω στο ίδιο αντικείμενο έκανε πολλές επαναλήψεις όπως το Interim Dynabook (Xerox Alto), τα οποία μπορούσαν να εκτελέσουν προγράμματα Smalltalk. Το περιβάλλον Smalltalk  αποτέλεσε την βάση για την δημιουργία της Squeak (eToys), η οποία με την σειρά της επηρέασε τα σύγχρονα εργαλεία εκμάθησης προγραμματισμού όπως το Scratch Blocks.   Δεν είναι τυχαίο ότι ο Alan Kay επηρεάστηκε ιδιαίτερα από το έργο του Ivan Sutherland (δημιουργός του Sketchpad το 1963), ενώ o ίδιος ο Alan Kay αποτέλεσε σημαντική επιροή του Bret Victor. Παρατηρούμε ότι η δουλειά όλων βασίζεται στον προγραμματισμό της διάδρασης με αντικείμενα στην οθόνη του υπολογιστή με στόχο την διευκόλυνση της επεξεργασίας της πληροφορίας και κυρίως της προσωπικής έκφρασης. Η πιο σημαντική όμως συνεισφορά του Alan Kay δεν είναι τόσο το ίδιο το υλικό και λογισμικό των υπολογιστών που οραματίστηκε και έφτιαξε, αλλά η προσπάθεια να ενδυναμώσει την ανθρώπινη σκέψη και αντίληψη μέσα από τον προγραμματισμό της διάδρασης.                                                                                                                                                                                         Εικόνες για την βιογραφία του Αλαν Κεη       ","categories": ["biography","definition"],
        "tags": ["Alan Kay","Ivan Sutherland","Bret Victor","Dynabook","Smalltalk","Xerox Alto"],
        "url": "https://mibook.github.io/gr/biography/alan-kay/",
        "teaser":null},{
        "title": "Bill Buxton",
        "excerpt":"Σύντομη βιογραφία του Bill Buxton   Ο B Buxton είναι ένας αμείλικτος υποστηρικτής για την καινοτομία, το σχεδιασμό και - ειδικά - την κατάλληλη εξέταση των ανθρώπινων αξιών, της ικανότητας και του πολιτισμού στη σύλληψη, την υλοποίηση και τη χρήση νέων προϊόντων και τεχνολογιών. Αυτό αντανακλάται στην έρευνά του, τη διδασκαλία, τις συνομιλίες και τη γραφή - συμπεριλαμβανομένης της στήλης του για το σχεδιασμό και την καινοτομία για το BusinessWeek.com και του βιβλίου του 2007, Sketching User Experiences.   Είναι επίσημος συνεργάτης ερευνητής της Microsoft Research, όπου εργάζεται από το Δεκέμβριο του 2005. Πριν από αυτό, ήταν κύριος της δικής του μπουτίκ σχεδιαστικής και συμβουλευτικής εταιρείας, Buxton Design , με έδρα το Τορόντο .   Ο Buxton ξεκίνησε την καριέρα του ως συνθέτης και ερμηνευτής, έχοντας κάνει πτυχίο Bachelor of Music στο Πανεπιστήμιο της Βασίλισσας. Στη συνέχεια σπούδασε και δίδαξε για δύο χρόνια στο Ινστιτούτο Sonology της Ουτρέχτης των Κάτω Χωρών.   Το 1975 ο Bill άρχισε να σχεδιάζει τα δικά του ψηφιακά μουσικά όργανα. Αυτό τον οδήγησε στο Πανεπιστήμιο του Τορόντο, αρχικά ως καλλιτέχνης στην κατοικία. Αυτό οδήγησε στην απόκτηση του MSc στην Πληροφορική, μετά από το οποίο εντάχθηκε στην σχολή του Τμήματος Επιστήμης Υπολογιστών, όπου εξακολουθεί να είναι βοηθός καθηγητής. Είναι αυτός ο δρόμος που τον οδήγησε στο πεδίο της αλληλεπίδρασης ανθρώπου-υπολογιστή, στον τεχνικό τομέα της ειδικότητας.   Από το 1987-89, ο Buxton βρισκόταν στο Cambridge της Αγγλίας, βοηθώντας στη δημιουργία ενός νέου δορυφόρου του ερευνητικού κέντρου Palo Alto της Xerox (EuroPARC). Από το 1989 έως το 1994, έσπασε το χρόνο του μεταξύ του Τορόντο, όπου ήταν Επιστημονικός Διευθυντής του Project Telepresence του Οντάριο και του Palo Alto της Καλιφόρνια, όπου διετέλεσε ερευνητικός ερευνητής στο Xerox PARC.   Από το 1994 μέχρι το Δεκέμβριο του 2002, ήταν επικεφαλής επιστήμονας του Alias - Wavefront, (τώρα μέρος της Autodesk) και από το 1995, η μητρική της εταιρεία SGI Inc. Το φθινόπωρο του 2004, έγινε καθηγητής μερικής απασχόλησης στο Τμήμα Βιομηχανικού Σχεδιασμού του Κολλεγίου Τέχνης και Σχεδιασμού του Οντάριο. Το 2004/05 ως καθηγητής προσωρινός στο Ινστιτούτο Σχεδιασμού Media Knowledge (KMDI) στο Πανεπιστήμιο του Τορόντο. Αυτή τη στιγμή χωρίζει το χρόνο του μεταξύ του Redmond και του Τορόντο.   Το 1995, ο Buxton έγινε ο τρίτος αποδέκτης του Καναδικού Βραβείου Εταιρείας Επικοινωνιών Ανθρωπίνου Υπολογιστή για συνεισφορές στην έρευνα στον τομέα των γραφικών υπολογιστών και της αλληλεπίδρασης ανθρώπου-υπολογιστή. Το 2000 του δόθηκε το βραβείο New Media Visionary of the Year στα βραβεία καναδικών νέων μέσων. Το 2001, ο ρεπόρτερ του Χόλιγουντ τον ονόμασε έναν από τους 10 πιο σημαντικούς πρωτοπόρους στο Χόλιγουντ. Το 2002, το Time Magazine τον ονόμασε έναν από τους 5 κορυφαίους σχεδιαστές του Καναδά. Επίσης, το 2002, εξελέγη στην Ακαδημία CHI.  Τον Οκτώβριο του 2005, ο Gord Kurtenbach έλαβε το βραβείο “Lasting Impact Award”, από το ACM UIST 2005, το οποίο απονεμήθηκε για το τεύχος του 1991, Issues in Combining Marking and Direct Manipulation Techniques. Το 2008 έγινε ο δέκατος αποδέκτης του Βραβείου ACM SIGCHI Lifetime Achievement, “για θεμελιώδεις συνεισφορές στον τομέα της Ανθρώπινης Αλληλεπίδρασης Η / Υ”. Το 2009 εξελέγη μέλος του Συνδέσμου Υπολογιστικών Μηχανημάτων (ACM) για τις συνεισφορές του στον τομέα της αλληλεπίδρασης ανθρώπου-ηλεκτρονικού υπολογιστή και το 2011 έγινε η πρώτη συνταγή του ετήσιου Μεγάλο βραβείο Pioneer για τα ψηφιακά μέσα του Καναδά.   Το Buxton έχει βραβευθεί με τέσσερις διδακτορικές διατριβές Honoris Causa: Doctor of Design από το Κολλέγιο Τέχνης και Σχεδιασμού του Οντάριο, Τορόντο, Οντάριο (Ιούνιος 2007), Doctor of Laws από το alma mater του Πανεπιστημίου Queen’s University, Kingston Ontario (Απρίλιος 2010), όπου επίσης διορίστηκε Διακεκριμένος Καθηγητής (Οκτώβριος 2010) και Διδάκτορας της Επιστήμης από το alma mater του Πανεπιστημίου του Τορόντο (Ιούνιος 2013), από το Τεχνικό Πανεπιστήμιο του Αϊντχόβεν.   Από το 1998 έως το 2004, ο Buxton βρισκόταν στο διοικητικό συμβούλιο του Καναδικού Κέντρου Κινηματογράφου και το 1998-99 προήδρευσε μια ομάδα που συμβουλεύει τον πρωθυπουργό του Οντάριο για την ανάπτυξη μακροπρόθεσμης πολιτικής για την προώθηση της καινοτομίας μέσω του Ontario Jobs and Investment Board . Είναι μέλος του συμβουλευτικού συμβουλίου του Τμήματος Βιομηχανικής Σχεδίασης του Πολυτεχνείου του Αϊντχόβεν της Ολλανδίας, του Συμβουλευτικού Συμβουλίου του Προεδρικού Συμβουλίου του Κολλεγίου Τέχνης και Σχεδιασμού του Οντάριο , του Συμβουλευτικού Συμβουλίου των Βιβλίων των Λεηλατών του Ορειβάτη και του Lore και το 2018 προσχώρησε στο Εθνικό Συμβούλιο του Καναδικού Μουσείου Κανό , όπου είναι επίσης μέλος της Επιτροπής Συλλογών. Η Buxton είναι μέλος της Ένωσης Υπολογιστικών Μηχανημάτων και της Εταιρείας Βιομηχανικών Σχεδιαστών της Αμερικής .   Έξω από την δουλειά, ο Buxton αγαπάει το ύπαιθρο. Είναι ιδιαίτερα παθιασμένος με τα βουνά, συμπεριλαμβανομένου του σκι, της αναρρίχησης και του τουρισμού. Το ενδιαφέρον αυτό επεκτείνεται στη γραπτή λέξη. Έχει συμμετάσχει στη λογοτεχνία για την ιστορία και την εξερεύνηση των βουνών, είναι ένας άπληστος βιβλιοφάγος και βρισκόταν στην κριτική επιτροπή του 2005 Φεστιβάλ Βιβλίου Βουνών του Banff . Είναι καταξιωμένος ιππικός , και το 1996 απονεμήθηκε το βραβείο Βετεράνος αναβάτης της χρονιάς από την ένωση δοκιμών Horse Ontario , και το 2000 ονομάστηκε στο Talent Squad της Εθνικής Ολυμπιακής ομάδας. Επιπλέον, είναι ένας άπληστος ποδηλάτης και ενεργός paddlerr - καγιάκ και κανό. Τέλος, έχει μια διαχρονική γοητεία τόσο με την τέχνη όσο και με τη σύζυγό του, την καλλιτέχνιδα Elizabeth Russ, ιδιοκτήτη και χειριστή του στούντιο 888 που εδρεύει στο Τορόντο, μια γκαλερί η αποστολή της οποίας είναι η προώθηση των αναδυόμενων τοπικών καλλιτεχνών.                                                                                                                                Εικόνες για την βιογραφία του Bill Buxton       ","categories": ["biography","definition"],
        "tags": ["Bill Buxton","Business Week","Sonology","Toronto University"],
        "url": "https://mibook.github.io/gr/biography/bill-buxton/",
        "teaser":null},{
        "title": "Mark D. Weiser",
        "excerpt":"Σύντομη βιογραφία του Mark D. Weiser.   Ο Mark D. Weiser γεννήθηκε στο Σικάγο και μεγάλωσε στην Νέα Υόρκη, όπου ο πατέρας του ήταν καθηγητής χημείας στο κρατικό πανεπιστήμιο της πόλης. Η αγάπη του για τους υπολογιστές ξεκίνησε στο γυμνάσιο επειδή το κορίτσι που του άρεσε ξεκίνησε μαθήματα προγραμματισμού.  Ξεκίνησε σπουδές φιλοσοφίας στο New College της Φλόριντα τις οποίες αναγκάστηκε να εγκαταλείψει ένα χρόνο αργότερα λόγω έλλειψης χρημάτων. Έπιασε δουλειά σαν προγραμματιστής και παράλληλα ξεκίνησε μαθήματα επιστήμης υπολογιστών στα οποία διέπρεψε σε τέτοιο βαθμό που έγινε  απευθείας δεκτός σ’ ένα πρόγραμμα master του πανεπιστήμιου του Michigan. Πήρε το πτυχίο του master το 1976 και το διδακτορικό του το 1979.   Το 1987 έγινε μέλος της ερευνητικής ομάδας της Xerox Parc και τον επόμενο χρόνο έγινε διευθυντής του εργαστηρίου επιστήμης των υπολογιστών του κέντρου. Το 1988 επινόησε τον όρο ‘διάχυτος υπολογισμός’ σε αντιπαράθεση με τους mainframe και τους προσωπικούς επιτραπέζιους  υπολογιστές που είχαν κυριαρχήσει στις δύο πρώτες γενιές της εποχής των υπολογιστών. Το όραμα του ήταν μια γρήγορη αναχώρηση από τον  προσωπικό υπολογιστή που εκείνη την εποχή βρισκόταν στο απόγειό του. Οι υπολογιστές, κατά την άποψή του, έπρεπε να εξαφανιστούν σε  καθημερινά αντικείμενα που περιτριγυρίζουν τους ανθρώπους τόσο στο σπίτι όσο και στο γραφείο.   Η προσέγγισή του ήταν ένα μείγμα τεχνολογίας, τέχνης και φιλοσοφίας. Η θεώρηση του γερμανού φιλόσοφου Martin Heidegger που έβλεπε το μπαστούνι ως αόρατη προέκταση του χεριού του τυφλού, επηρέασε τις απόψεις του Weiser, εμπνέοντάς τον να δει τους υπολογιστές σαν εργαλεία που πρέπει να εξαφανιστούν. Στην σημερινή εποχή η δουλειά του στη Xerox Parc έχει βρει εφαρμογές καθώς έξυπνες συσκευές όπως καφετιέρες, εκτυπωτές, τηλεοράσεις περιβάλλουν πολλές δραστηριότητες των ανθρώπων. Στην περίπτωση του διάχυτου υπολογισμού έχει υπάρξει μια έκρηξη δραστηριότητας. Για παράδειγμα αναφέρεται, το νέο πρωτόκολλο Internet που σχεδιάστηκε για να υποστηρίζει δισεκατομμύρια διασυνδεδεμένων έξυπνων συσκευών. Ακόμα, η έρευνα επάνω στο αντικείμενο έχει εντατικοποιηθεί σε πανεπίστημια όλου του κόσμου.   Επίσης ο Weiser προκάλεσε τη βιομηχανία υπολογιστών να δει τα θέματα απόδοσης με νέους τρόπους πολύ πρίν ο διάχυτος υπολογισμός να γίνει γνωστός. Σε αντίθεση με την παραδοσιακή μέτρηση της απόδοσης των υπολογιστών σε εκατομμύρια οδηγίες το δευτερόλεπτο (MIPS) ο Weiser  επέμεινε στη μέτρηση της απόδοσης με τον αριθμό των οδηγιών ανά Joule ενέργειας, πιέζοντας προς την κατεύθυνση του κινητού υπολογισμού χαμηλής ενέργειας.                                                                                                                                                                                         Εικόνες για την βιογραφία του Mark Weiser       ","categories": ["biography"],
        "tags": ["Mark Weiser","Ubiquous Computing","Xerox Alto"],
        "url": "https://mibook.github.io/gr/biography/mark-weiser/",
        "teaser":null},{
        "title": "Beyond usability",
        "excerpt":"Η περίπτωση της αισθητικής και της ευχρηστίας   Η αρχική θεωρητική θεμελίωση της περιοχής της διάδρασης ανθρώπου-υπολογιστή βασίστηκε στην τρέχουσα για την εποχή αντίληψη της διάδρασης, που με τη σειρά της βασιζόταν στον επιτραπέζιο υπολογιστή, στη γραφική επιφάνεια εργασίας, και στο πλαίσιο των εφαρμογών γραφείου και παραγωγικότητας. Αντίστοιχα, η αρχική θεώρηση της διάδρασης έδωσε έμφαση στην επεξεργασία της πληροφορίας από τον άνθρωπο, καθώς και στον έλεγχο και στην απεικόνιση της πληροφορίας στο τερματικό του χρήστη. Οι θεμελιωτές της αρχικής θεωρίας προσπάθησαν να δημιουργήσουν ένα αναλυτικό πλαίσιο και τα αντίστοιχα μοντέλα, που να εκφράζουν τον τρόπο που ο άνθρωπος αντιλαμβάνεται, επεξεργάζεται και ελέγχει την πληροφορία. Σε ορισμένες περιπτώσεις, όπως στην πρόβλεψη της απόδοσης της συσκευής εισόδου ‘ποντίκι’, η αναλυτική αυτή προσέγγιση είχε άριστα και διαχρονικά αποτελέσματα.   Από την άλλη πλευρά όμως, καθώς περάσαμε στον κινητό και διάχυτο υπολογιστή, και καθώς οι υπολογιστές έγιναν μέρος δραστηριοτήτων με αξίες πέρα από την παραγωγικότητα, η ποιότητα της διάδρασης άρχισε να αποκτά και άλλες διαστάσεις πέρα από εκείνη της βασικής ευχρηστίας. Στα τέλη της δεκαετίας του 1990, μια σειρά από πειράματα διάδρασης με διεπαφές που είχαν μεταξύ τους διαφορές μόνο στην αισθητική (και όχι στην ευχρηστία τους) οδήγησε στο συμπέρασμα ότι η ευχρηστία δεν είναι ο μόνος παράγοντας που καθορίζει την αποδοχή μιας διεπαφής. Τα πειράματα έγιναν με πολλές διαφορετικές διεπαφές, με τραπεζικά ATM, μουσικές συσκευές, συστήματα προσομοίωσης βιομηχανικών διαδικασιών και με ηλεκτρονικά καταστήματα, έτσι ώστε να εξεταστεί η έκταση του φαινομένου. Διαπιστώθηκε, μάλιστα, ότι οι χρήστες θεωρούσαν περισσότερο εύχρηστες τις διεπαφές που είχαν καλύτερη αισθητική.   Για να μελετήσουν την επίδραση της αισθητικής μιας διεπαφής στην αντίληψη του χρήστη για την ευχρηστία ενός συστήματος, οι ερευνητές προχώρησαν στην εκτέλεση ενός πειράματος. Ο σχεδιασμός του πειράματος περιλάμβανε ότι διαφορετικές ομάδες χρηστών θα αξιολογούσαν θα αξιολογούσαν αναφορικά τόσο με την εμφάνιση και την ευχρηστία αλλά και τη συμπεριφορά, διαφορετικά επίπεδα αισθητικής και ευχρηστίας μιας βασικής διεπαφής μηχανήματος από Αυτόματη Ταμειακή Μηχανή (ΑΤΜ) τράπεζας.   Για τον σκοπό αυτό οι ερευνητές κατασκεύασαν μια προσομοίωση του ΑΤΜ για διαφορετικές εκδοχές διαρρύθμισης των κουμπιών, και ζήτησαν από τους χρήστες να τα βαθμολογήσουν αναφορικά με την αισθητική και την ευχρηστία τους. Αμέσως μετά τους ζήτησαν να εκτελέσουν μια σειρά από τυπικές διεργασίες (π.χ., ανάληψη χρημάτων, ερώτηση υπολοίπου λογαριασμού) με τα οποία βαθμολόγησαν τις εναλλακτικές διεπαφές. Με αυτόν τον τρόπο, η ανάλυση των αποτελεσμάτων έδωσε τη συσχέτιση ανάμεσα στην αισθητική και την ευχρηστία που υπήρχε στα ΑΤΜ. Εκτός από την παραπάνω μεθοδολογία του πειράματος, ιδιαίτερο ενδιαφέρον παρουσιάζει επίσης η χρήση του λογισμικού διάδρασης το οποίο προσομοίωνε τα ΑΤΜ, αφού αντίστοιχο λογισμικό χρησιμοποιήθηκε προηγούμενα και για την κατασκευή εναλλακτικών συσκευών εισόδου ‘ποντίκι’.   Τα αποτελέσματα σε αυτό το επιστημονικό άρθρο ήρθαν να συμπληρώσουν τα κομμάτια που έλειπαν σε ένα παζλ από ευρήματα προηγούμενων εργασιών. Από τις αρχές της δεκαετίας του 1990 είχε αρχίσει να γίνεται φανερό ότι σε πολλές περιπτώσεις διάδρασης διαφέρει η αντικειμενική απόδοση του χρήστη από την υποκειμενική αντίληψη που έχει ο ίδιος ο χρήστης για την απόδοσή του. Για παράδειγμα, υπάρχουν περιπτώσεις όπου ο χρήστης θα κάνει περισσότερο χρόνο να ολοκληρώσει μια διεργασία που απαιτεί διάδραση με τον υπολογιστή και παρ’ όλα αυτά θα τη θεωρεί πιο εύχρηστη από κάποια άλλη που απαιτεί λιγότερο χρόνο. Αυτές οι περιπτώσεις έρχονται σε αντίθεση με τον αρχικό ορισμό της ευχρηστίας, η οποία έχει ως βασική διάσταση την απόδοση ή αλλιώς την ταχύτητα με την οποία ο χρήστης ολοκληρώνει μια διεργασία. Βλέπουμε, λοιπόν, για μια ακόμη φορά την ιδιαιτερότητα που έχει η περιοχή του προγραμματισμού της διάδρασης, όπου η αντικειμενική απόδοση ενός συστήματος ανθρώπου-υπολογιστή μπορεί να μην είναι αρκετή για να χαρακτηρίσει την ποιότητά του. Απαιτείται και η σύμφωνη γνώμη του χρήστη, η οποία όμως είναι εξ΄ ορισμού υποκειμενική και μέσα σε ένα πλήθος ερευνητικών δεδομένων, η γνώμη των διαφόρων χρηστών μπορεί να έχει μεγάλη διακύμανση.                                                                       Εναλλακτικοί ορισμοί της ποιότητας της διάδρασης       ","categories": ["case-study","models"],
        "tags": ["affective usability"],
        "url": "https://mibook.github.io/gr/case-study/affective/",
        "teaser":null},{
        "title": "Arduino",
        "excerpt":"Η περίπτωση του Arduino   Το Arduino είναι ένας πολύ δημοφιλής μικροελεγκτής που φτιάχτηκε με αρχικό σκοπό τον προγραμματισμό και την εκπαίδευση των φοιτητών της διάδρασης ανθρώπου-υπολογιστή με συστήματα εισόδου-εξόδου, πέρα από τα κλασικά πληκτρολόγιο-ποντίκι-οθόνη που έχουμε στους επιτραπέζιους ΗΥ. Πριν το Arduino, οι φοιτητές και οι ερευνητές που ήθελαν να δημιουργήσουν και να πειραματιστούν με νέα συστήματα εισόδου και εξόδου έπρεπε πρώτα να συνδέσουν στον επιτραπέζιο υπολογιστή κάποιους αισθητήρες και ελεγκτές μέσω ενός εξωτερικού μικροεπεξεργαστή που μεταφράζει τα αναλογικά σήματα σε ψηφιακά και αντίστροφα. Μεγάλο μέρος αυτής της διαδικασίας είναι όμοιο ανεξάρτητα από το είδος του αισθητήρα που συνδέουμε, επομένως, ένα σημαντικό μέρος της προ-εργασίας που γινόταν ήταν απλά εμπόδιο και καθυστέρηση για τον βασικό στόχο, ενώ ταυτόχρονα απαιτούσε και ειδικές δεξιότητες στην ηλεκτρονική και στους μικροεπεξεργαστές, που πολλοί δημιουργικοί κατασκευαστές της διάδρασης δεν είχαν. Αυτήν την ανάγκη ήρθε να καλύψει το Arduino που δημιουργήθηκε από τους καθηγητές της μεταπτυχιακής σχολής διάδρασης ανθρώπου-υπολογιστή στο Ινστιτούτο Ιβρέα της Ιταλίας.   Το βασικό μοντέλο Arduino (π.χ., Uno) έρχεται με μια θύρα USB η οποία αποτελεί το κύριο κανάλι δικτυακής επικοινωνίας με έναν επιτραπέζιο ΗΥ. Η θύρα USB είναι πολύ χρήσιμη για να φορτώσουμε μια νέα έκδοση της εφαρμογής μας, καθώς και για να δοκιμάσουμε μια εφαρμογή που θα πρέπει να έχει πρόσβαση σε δεδομένα του ευρύτερου δικτύου του επιτραπέζιου ΗΥ. Αν και αυτές οι δυνατότητες δικτυακής επικοινωνίας είναι συνήθως αρκετές για τα περισσότερα εκπαιδευτικά και οικιακά έργα που γίνονται με Arduino, είναι πολύ περιορισμένες για κάτι εμπορικό ή για κάτι που είναι ανεξάρτητο από τον παραδοσιακό επιτραπέζιο ΗΥ. Για αυτόν τον σκοπό οι σχεδιαστές του Arduino έχουν προβλέψει την τοποθέτηση επεκτάσεων με έναν τυποποιημένο τρόπο που λέγεται shield.   Το Arduino έχει πολλές εισόδους -τόσο ψηφιακές όσο και αναλογικές- που μπορούν να συνδεθούν με μια μεγάλη ποικιλία απλών αισθητήρων, αλλά και με πιο πολύπλοκες κατασκευές. Ο ευκολότερος τρόπος για να δώσουμε είσοδο στο Arduino είναι η απευθείας σύνδεση ενός αισθητήρα με τις ψηφιακές/αναλογικές εισόδους του. Σε πιο πολύπλοκα συστήματα εισόδου ο σχεδιαστής μπορεί να φτιάξει ένα ηλεκτρικό κύκλωμα στο συνοδευτικό breadboard. Εκτός από τη δυνατότητα για είσοδο από εναλλακτικά συστήματα, πέρα από το πληκτρολόγιο/ποντίκι, το Arduino σχεδιάστηκε για να δίνει και έξοδο σε εναλλακτικά συστήματα, πέρα από την παραδοσιακή οθόνη και τον εκτυπωτή. Φυσικά, όπως και στην περίπτωση των εισόδων, οι χρήστες του Arduino έχουν βρει πολλές ακόμη εφαρμογές, οι περισσότερες από τις οποίες εμπνέονται από τα συστήματα ελέγχου (π.χ., βιομηχανία, ασφάλεια, κτλ.).   Το Arduino δεν ήταν η πρώτη προσπάθεια κατασκευής ενός μικροελεγκτή που διασυνδέεται εύκολα με επιπλέον αισθητήρες, αφού στο παρελθόν είχαν γίνει αντίστοιχες προσπάθειες τόσο από μεγάλα ερευνητικά έργα και πανεπιστήμια όσο και από εταιρείες, αλλά κανένα δεν είχε την αποδοχή του Arduino σε τόσο μικρό χρονικό διάστημα. Αν και δεν είναι εύκολο να εντοπίσουμε όλες τις παραμέτρους που συνέβαλαν στην επιτυχία του, σίγουρα μια από αυτές ήταν το γεγονός ότι το έργο βασιζόταν σε τεχνολογία με ευέλικτη άδεια χρήσης, η οποία επέτρεψε σε άλλους κατασκευαστές να φτιάξουν τις δικές του εκδοχές. Επιπλέον, η φύση του ανοικτού κώδικα έδωσε την αυτοπεποίθηση σε πολλούς σχεδιαστές να το επιλέξουν, αφού έτσι θα είχαν μεγαλύτερη ασφάλεια από πιθανές αλλαγές που θα αποφάσιζε μονομερώς μια εταιρεία. Στα λίγα χρόνια της κυκλοφορίας του, η αποδοχή και η ευελιξία του Arduino αποδείχτηκαν τόσο μεγάλες, που δημιουργήθηκε μια αντίστοιχα μεγάλη και ενεργή κοινότητα χρηστών που ασχολούνται με εφαρμογές πολύ πέρα από τους αρχικούς στόχους του σχεδιασμού του.   Συνολικά, το Arduino δίνει την ελευθερία στον σχεδιαστή της διάδρασης ανθρώπου-υπολογιστή να σκεφτεί και να κατασκευάσει σχετικά εύκολα και οικονομικά εναλλακτικούς τρόπους διάδρασης, πέρα από τον επιτραπέζιο ΗΥ. Όπως ακριβώς το Linux και το Processing, το Arduino βασίζεται περισσότερο σε μια κοινότητα χρηστών παρά σε μια ιεραρχικά οργανωμένη εταιρεία για την παροχή μιας σειράς υπηρεσιών όπως η πώληση, η τεκμηρίωση και η υποστήριξη. Οι ομοιότητες μεταξύ του Processing και του Arduino δε σταματούν στα κίνητρα και στην ανοικτή κοινότητα ανάπτυξης, αλλά συνεχίζονται και στην υιοθέτηση του περιβάλλοντος ανάπτυξης του Processing από το Arduino. Βλέπουμε, λοιπόν, ότι ένα απλό περιβάλλον ανάπτυξης που βασίζεται στις συνεχείς αλλαγές του κώδικα και στον γρήγορο έλεγχο του αποτελέσματος είναι βασική προϋπόθεση για τον προγραμματισμό της διάδρασης ανεξάρτητα από το τεχνολογικό πλαίσιο (π.χ., πολυμέσα, επιτραπέζιος, διάχυτος υπολογισμός).                                                                                                                                                                                                                                                ","categories": ["case-study","tools"],
        "tags": ["arduino","success"],
        "url": "https://mibook.github.io/gr/case-study/arduino/",
        "teaser":null},{
        "title": "Facebook",
        "excerpt":"Η περίπτωση του Facebook   Η ιστορία του κοινωνικού δικτύου Facebook έχει πολλές ενδιαφέρουσες πλευρές, κάποιες από αυτές αξίζει να ανακτήσει κανείς συνοπτικά και ευχάριστα στη σχετική ταινία “The Social Network” (Fincher, 2010). Σε αυτήν την ενότητα θα εστιάσουμε στα στοιχεία του κοινωνικού δικτύου που άπτονται του προγραμματισμού της διάδρασης. Δεν υπάρχει καλύτερο σημείο για να ξεκινήσουμε αυτήν την περιγραφή από τη διαδικασία και τα στάδια ανάπτυξης του κοινωνικού δικτύου Facebook. Τόσο οι λειτουργίες όσο και η εμφάνιση του συστήματος δεν προέκυψαν από ένα λεπτομερές συμβόλαιο ή ένα ξεκάθαρο όραμα, αλλά ήταν κυρίως το αποτέλεσμα συνεχούς επανάληψης και δοκιμών. Μάλιστα, δεν ήταν λίγες οι φορές στην ιστορία του Facebook που πολλοί χρήστες ενοχλήθηκαν ή αντέδρασαν, ακόμα και κλείνοντας τον λογαριασμό τους, όταν έγιναν αλλαγές που δεν τους άρεσαν. Ανεξάρτητα από τη μελλοντική αποδοχή του φαινομένου του Facebook, σίγουρα η επίδρασή του στον τρόπο που αναπτύσσονται και λειτουργούν οι διαδραστικές εφαρμογές θα είναι διαχρονική, καθώς μια σειρά από εφαρμογές σε διαφορετικά πεδία (π.χ., Tweeter, LinkedIn, ResearchGate, GitHub, Uber, AirBnB, κτλ.) στηρίζονται στις βασικές λειτουργίες του κοινωνικού δικτύου.   Στα πρώιμα στάδια του Facebook, η “ομάδα ανάπτυξης” ήταν δύο συγκάτοικοι στη φοιτητική εστία του πανεπιστήμιου που ξεκίνησαν να φτιάξουν μια σελίδα με τις φωτογραφίες των φοιτητών από όλες τις επιμέρους εστίες του πανεπιστήμιου. Οι φωτογραφίες και τα βασικά προφίλ ήταν διαθέσιμα στις επιμέρους εστίες, αλλά το πανεπιστήμιο δεν πρόσφερε ένα ολοκληρωμένο σύστημα παρουσίασής τους. Η ομάδα ανάπτυξης ανέκτησε τις φωτογραφίες από τις επιμέρους εστίες και τις πρόβαλε συγκριτικά, με έναν πολύ δημοφιλή τρόπο, που όμως θεωρήθηκε παράνομος από τις πανεπιστημιακές αρχές. Αν και η αρχική προσπάθεια έπαψε να λειτουργεί μέσα σε λίγες μέρες, υπήρξε τόσο δημοφιλής που η επόμενη έκδοση -που βασίστηκε στην εθελοντική συμμετοχή- ετοιμάστηκε και συγκέντρωσε χρήστες από όλο το πανεπιστήμιο πολύ γρήγορα. Η έκδοση εκείνη δεν πρόσφερε τίποτα διαφορετικό, μάλλον είχε λιγότερα στοιχεία, από τα αντίστοιχα κοινωνικά δίκτυα της εποχής (π.χ., το Friendster). Είχε, όμως, ένα βασικό πλεονέκτημα που θα έπαιζε σπουδαίο ρόλο στη συνέχεια: η υπηρεσία του Facebook είχε μεγάλη συμμετοχή από μια συμπαγή και ομοιόμορφη ομάδα χρηστών, της οποίας η ομάδα ανάπτυξης παρακολουθούσε κάθε διάδραση, και έτσι μπόρεσε να προσφέρει νέες λειτουργίες που να καλύπτουν τις ανάγκες των χρηστών της.   Βλέπουμε, λοιπόν, ότι η εμπορική επιτυχία του κοινωνικού δικτύου μπορεί να εξηγηθεί περισσότερο από την ανθρωποκεντρική του διάσταση -κυρίως λόγω της συμμετοχής των τελικών χρηστών στην παραγωγή του περιεχομένου- παρά από την προσφορά νέων καινοτόμων λειτουργιών που δεν έχουν οι ανταγωνιστές. Το κοινωνικό δίκτυο Facebook πολύ γρήγορα πέρασε από το πανεπιστημιακό ίδρυμα των δημιουργών του σε όλα τα πανεπιστημιακά ιδρύματα των ΗΠΑ, και από εκεί έγινε διαθέσιμο στον υπόλοιπο κόσμο με την προσθήκη λειτουργιών και αλλαγές αντίστοιχων της κάθε περιόδου λειτουργίας του. Η σταδιακή αυτή βελτίωση επέτρεψε στους κατασκευαστές να παράσχουν στους χρήστες τα στοιχεία της διάδρασης που είχαν ανάγκη κάθε φορά, και όχι κάτι που είχαν από μόνοι τους προαποφασίσει στο σχεδιαστικό τραπέζι. Για παράδειγμα, η γρήγορη και μεγάλη αποδοχή του συστήματος οδήγησε στη βελτιστοποίηση της απόκρισης των σελίδων, ενώ η μετάβαση των χρηστών στα κινητά μέσα επέβαλε την εξαγορά εταιρειών με σχετική εξειδίκευση (π.χ., Ιnstagram) και την κατασκευή της κινητής εφαρμογής του Facebook, ώστε να έχουν πρόσβαση σε αυτό όσο γίνεται περισσότεροι χρήστες και από όσο γίνεται περισσότερες συσκευές.   Από την πλευρά της σχεδίασης της διάδρασης, το κοινωνικό δίκτυο Facebook καθιέρωσε μια σειρά από νέα μοτίβα, τα οποία έχουν ανάλογη αποδοχή με τα μοτίβα της γραφικής επιφάνειας εργασίας. Ανεξάρτητα από το αν μια εφαρμογή είναι κοινωνικό δίκτυο ή όχι, πολλές φορές δίνει τη δυνατότητα στους χρήστες της να μοιραστούν απευθείας το περιεχόμενό τους (share) ή τη δραστηριότητά τους στα κοινωνικά δίκτυα. Επίσης, δίνει τη δυνατότητα να σχολιάσουν (comment) και να δηλώσουν την αποδοχή τους (like) για το περιεχόμενο που εμφανίζεται. Επιπλέον, η μαζική χρήση του κοινωνικού δικτύου (Τον Αύγουστο του 2015 το Facebook αριθμεί 1,5 δις μέλη) και για πολλές διαφορετικές δραστηριότητες, έχει επιτρέψει και την εκτέλεση μαζικών πειραμάτων στο πεδίο ακόμα και ερήμην των χρηστών του, στα οποία μελετήθηκε αν η εμφάνιση διαφορετικού περιεχομένου (π.χ., θετικό, αρνητικό περιεχόμενο), μπορεί να επηρεάσει αντίστοιχα τη συμπεριφορά των χρηστών.   Από την πλευρά της κατασκευής και της επιλογής των τεχνολογικών εργαλείων της διάδρασης, το Facebook έχει υλοποιηθεί αρχικά και κατά ένα μεγάλο μέρος του στην PHP, παρότι υπάρχουν πολλές άλλες επιλογές που θεωρούνται περισσότερο κατάλληλες. Στην πράξη, οι κατασκευαστές του Facebook διάλεξαν ένα οικείο εργαλείο και όταν βρέθηκαν μπροστά σε θέματα απόδοσης, αντί να ξαναγράψουν το σύστημα, επέλεξαν να φτιάξουν έναν μεταφραστή (compiler) που μετατρέπει την PHP σε C++, η οποία μπορεί να εκτελεστεί γρηγορότερα. Τέλος, εκτός από την επίδραση που είχε το Facebook στον τρόπο που αναπτύσσονται όλες οι διαδραστικές εφαρμογές, είχε επιπλέον σημαντική επίδραση στον τρόπο που ορίζουμε το διαδίκτυο, καθώς μειώθηκε η σημασία του WWW.                                                                                                                              ","categories": ["case-study","models"],
        "tags": ["facebok","success"],
        "url": "https://mibook.github.io/gr/case-study/facebook/",
        "teaser":null},{
        "title": "Google Search",
        "excerpt":"Η αποτελεσματικότητα της μηχανής αναζήτησης Google και η απλότητα στην διεπαφή της   H μηχανή αναζήτησης της Google είναι μια από τις δημοφιλέστερες και κατέχει βάση στατιστικών ερευνών μια από τις πρώτες θέσεις με την υψηλότερη επισκεψιμότητα μεταξύ άλλων δημοφιλών μηχανών αναζήτησης, όπως για  παράδειγμα το Yahoo και το MSN.   Η ιδέα της, με την αρχική ονομασία BackRub, ξεκίνησε το 1996 ως ερευνητικό πρόγραμμα από τον Λάρρυ Πέιτζ  και τον Σεργκέι Μπριν οι οποίοι έκαναν το διδακτορικό τους στο Πανεπιστήμιο Στάνφορντ της Καλιφόρνια. Ενώ αρχικά, οι συμβατικές μηχανές αναζήτησης κατέτασσαν τα αποτελέσματά τους μετρώντας πόσες φορές οι όροι αναζήτησης εμφανίζονταν  στην σελίδα, κατάφεραν να δημιουργήσουν ένα καλύτερο σύστημα που ανέλυε τις σχέσεις μεταξύ των ιστοσελίδων. Ονόμασαν τη νέα αυτή τεχνολογία PageRank, η οποία καθόριζε τη συνάφεια μιας ιστοσελίδας από τον αριθμό και τη σημαντικότητα των σελίδων που οδηγούν πίσω σε αυτήν. Επίσης, σχεδιάστηκε κατάλληλα ώστε να κλιμακώνεται αναφορικά καλά με τη ραγδαία ανάπτυξη του  διαδικτύου και να μας παρέχει μια γρήγορη και αποτελεσματική πρόσβαση σε πληροφορίες του Παγκόσμιου Ιστού.   Άλλωστε, η ονομασία της μηχανής αναζήτησης Google δεν είναι τυχαία, αλλά αντίθετα προήλθε από τον αναγραμματισμό της λέξης «Γκούγκολ», τον μαθηματικό όρο που εισήγαγε ο Μίλτον Σιρότα για τον τεράστιο αριθμό «1 ακολουθούμενο από 100 μηδενικά». Με τον όρο αυτόν η Google επιθυμεί να υποδηλώσει την αποστολή της εταιρίας να οργανώσει το τεράστιο πλήθος πληροφοριών του διαδικτύου αλλά και  να τις κάνει παγκόσμια διαθέσιμες. Έτσι, σήμερα η φράση «γκουγκλάρω» έχει γίνει συνώνυμη με το «ψάχνω για πληροφορίες στο Διαδίκτυο». και αντίστοιχα, στην αγγλική γλώσσα το ρήμα «to google» έχει αποκτήσει πλέον ταυτόσημη έννοια με το ρήμα «αναζητώ».   Ωστόσο, όμως η επιτυχία της δεν σχετίζεται μόνο με την αποτελεσματικότητα της λειτουργίας της. Ούτε υπολογίζεται από το πόσο πολύ ο χρήστης είναι απασχολημένος με τη διεπαφή, αλλά αντίθετα από το πόσο γρήγορα μπορεί να πάρει αυτό που χρειάζεται, μέσω της απλότητας του σχεδιασμού της. Ενώ στο παρελθόν η φιλοσοφία των μηχανών αναζήτησης ήταν να κρατήσουμε το χρήστη στη σελίδα όσο το δυνατόν πιο  πολύ, η Google πήγε στην άλλη κατεύθυνση. Δηλαδή, αυτό ακριβώς που οι χρήστες επιθυμούσαν. Η απλότητα του σχεδιασμού διεπαφής που αποκρύπτει την  πολυπλοκότητα της λειτουργίας της. Η φιλοσοφία αυτού του είδους αλληλεπίδρασης με το χρήστη βρίσκεται στο DNA των ανθρώπων και αποτελεί μια από τις βασικότερες προυποθέσεις της διάδρασης μεταξύ ανθρώπου-υπολογιστή. Χαρακτηριστικό παράδειγμα εφαρμογής που ακολούθησε αυτή τη φιλοσοφία με μεγάλη επιτυχία είναι το Uber.                                                                                                                                                                                                                                                ","categories": ["case-study","models"],
        "tags": ["google search","success"],
        "url": "https://mibook.github.io/gr/case-study/google_search/",
        "teaser":null},{
        "title": "Apple iPod",
        "excerpt":"Η περίπτωση του iPod και iTunes   Η περίπτωση της συσκευής αναπαραγωγής μουσικής iPod σήμανε την αρχή της γρήγορης μετατόπισης της διάδρασης από τον επιτραπέζιο προς τον κινητό και διάχυτο υπολογισμό. Η μετάβαση του υπολογισμού από τον επιτραπέζιο στον κινητό συνοδεύτηκε από μια ριζική αναθεώρηση τόσο των συστημάτων εισόδου όσο και των μοντέλων διάδρασης.   Η πρώτη έκδοση του iPod περιέχει έναν μικρό σκληρό δίσκο και λειτουργεί ως συσκευή αποθήκευσης αρχείων, όπως πολλές αντίστοιχες εμπορικές συσκευές εκείνης της εποχής, με τη διαφορά ότι ο περιστρεφόμενος τροχός επιτρέπει τη γρήγορη πλοήγηση σε μεγάλες λίστες μουσικών αρχείων. Οι άλλες συσκευές της κατηγορίας του αντί για τον τροχό έχουν πλήκτρα βήματος, τα οποία είναι πιο δύσχρηστα, ειδικά στην περίπτωση που ο σκληρός δίσκος είναι γεμάτος με μουσικά αρχεία. Οι περισσότερες ανταγωνιστικές συσκευές εισόδου βασίζονται σε μια απευθείας απεικόνιση (direct mapping) της λίστας πολυμεσικών αρχείων με τα κουμπιά εισόδου, τα οποία είναι οργανωμένα κατακόρυφα. Αν και ο τροχός κύλισης του iPod παραβαίνει τον κανόνα της απευθείας απεικόνισης αποδικνύεται περισσότερο εύχρηστος, γιατί πολύ γρήγορα οι χρήστες καταλαβαίνουν ότι με την περιστροφή του τροχού μπορούν να κινηθούν πάνω-κάτω, και ακόμη γρηγορότερα μπορούν να επιλέξουν ένα αρχείο από την λίστα, γιατί ο τροχός προσφέρει εκτός από τον έλεγχο της κατεύθυνσης και τον έλεγχο της επιτάγχυνσης.   Βλέπουμε, λοιπόν, ότι η επιτυχία (κατά ένα μέρος) οφείλεται στη δημιουργία μιας νέας συσκευής εισόδου που δίνει έμφαση στην πιο συχνή διεργασία του χρήστη. Όπως ακριβώς το ποντίκι ήρθε να διευκολύνει την επιλογή κειμένου στην οθόνη και το έκανε αποδεδειγμένα πολύ καλύτερα από όλες τις εναλλακτικές (όπως είδαμε στην ερευνητική μελέτη περίπτωσης), έτσι και ο τροχός του πρώτου iPod είναι ο πιο αποτελεσματικός τρόπος για την επιλογή μέσα σε λίστες με πολλές καταχωρήσεις. Κάποιος θα μπορούσε να προσθέσει ότι πέρα από λειτουργικός, ο τροχός του iPod είναι και διασκεδαστικός, αφού θυμίζει την κίνηση που κάνουν οι DJs, όταν διαλέγουν μουσική.   Ένα ακόμη στοιχείο που συνέβαλε στην επιτυχία του iPod ήταν η ολοκλήρωσή του με ένα σύστημα διανομής μουσικής που περιλάμβανε μια εφαρμογή επιτραπέζιου υπολογιστή, καθώς και ένα ηλεκτρονικό κατάστημα. Στα τέλη της δεκαετίας του 1990, η επικράτηση των αρχείων μουσικής τύπου MP3 και η εύκολη διανομή τους μέσω του δικτύου, επέτρεψε στους χρήστες να συγκεντρώσουν πολύ μεγάλες συλλογές μουσικών αρχείων, που ήταν δύσκολο να οργανώσουν και να ακούσουν. Η εφαρμογή iTunes και το αντίστοιχο ηλεκτρονικό κατάστημα επεδίωξε να λύσει αυτό το πρόβλημα και το έκανε με μεγάλη επιτυχία, ενώ ταυτόχρονα το iTunes έγινε η πύλη για την εισαγωγή νέων πολυμεσικών αρχείων πέρα από τη μουσική, όπως βίντεο και φωτογραφίες, και αργότερα εφαρμογές για την κατηγορία των έξυπνων κινητών (iPod Touch, iPhone).   Η εφαρμογή iTunes, εκτός από το να οργανώνει και να διανέμει τα πολυμεσικά πλέον αρχεία του χρήστη, μετατρέπεται σταδιακά στον Δούρειο Ίππο που θα φέρει τις κινητές εφαρμογές στη συσκευή του χρήστη. Οι πρώτες εκδόσεις του iTunes είναι επιτραπέζιες εφαρμογές εκτέλεσης μουσικών αρχείων και συγχρονισμού με το iPod, ενώ οι τελευταίες εκδόσεις συνδέονται και ενημερώνουν το λογισμικό για όλες τις κινητές συσκευές του χρήστη (π.χ., smart phone, tablet, smart watch, κτλ.). Ταυτόχρονα, συνδέονται και με τα οικιακά συστήματα ψυχαγωγίας, όπως ηχεία και τηλεόραση, ώστε να επιτρέψουν την εκτέλεση των πολυμεσικών αρχείων σε συσκευές εξόδου υψηλότερης πιστότητας σε σχέση με εκείνες του επιτραπέζιου υπολογιστή.   Ένα σημαντικό μάθημα που μας δίνει η ιστορία του iPod είναι πως τα σύγχρονα διαδραστικά συστήματα δε στέκονται από μόνα τους, αλλά λειτουργούν σε ένα οικοσύστημα συσκευών και εφαρμογών. Ένα ακόμη μάθημα είναι πως η εισαγωγή της καινοτομίας πρέπει να γίνει τόσο σταδιακά που η μετάβαση να είναι διαφανής για τον τελικό χρήστη. Όταν οι πρώτοι χρήστες του iPod έβαζαν το iTunes ήθελαν απλώς να οργανώσουν καλύτερα τη μουσική τους, ένα πρόβλημα που ήδη αντιμετώπιζαν στον επιτραπέζιο υπολογιστή. Καθώς απέκτησαν οικειότητα με το iTunes, το είδαν να μεταμορφώνεται σε ένα πολυεργαλείο για όλες τις κινητές συσκευές τους.                                                                                                                                                                                       ","categories": ["case-study","archetypes"],
        "tags": ["apple","ipod"],
        "url": "https://mibook.github.io/gr/case-study/ipod/",
        "teaser":null},{
        "title": "Minecraft",
        "excerpt":"Η περίπτωση του Minecraft   Πριν ο προγραμματισμός της διάδρασης αποκτήσει πρωταγωνιστικό ρόλο στην έρευνα και στη βιομηχανία, η επιτυχία ενός προϊόντος μπορούσε να μετρηθεί από τις πωλήσεις που έκανε ή από τις καλές κριτικές που έπαιρνε. Η άνοδος του προγραμματισμού της διάδρασης προσθέτει νέες μετρικές, όπως τη συμμετοχή των χρηστών στην επέκταση του αρχικού προϊόντος. Στον χώρο της ψυχαγωγίας μέσω υπολογιστή, μία από τις πιο επιτυχημένες περιπτώσεις είναι αυτή του Minecraft, στο οποίο οι χρήστες-παίκτες είναι εκείνοι που κατασκευάζουν από κοινού το περιβάλλον του παιχνιδιού.   Η έμφαση στην κατασκευή του εικονικού κόσμου του παιχνιδιού από τους τελικούς χρήστες βασίζεται σε μια συμμετοχική φιλοσοφία που είναι εντελώς διαφορετική από την παροχή μιας προκατασκευασμένης εμπειρίας, όπως είναι το σύνηθες στα περισσότερα βιντεο-παιχνίδια. Οι δημιουργοί του Minecraft ανάγνωσαν έγκαιρα την ανάγκη των χρηστών για μεγαλύτερη δυνατότητα προσωπικής έκφρασης μέσα από τις ψηφιακές δραστηριότητές τους. Εκτός από τη συμμετοχή των χρηστών στην κατασκευή του εικονικού κόσμου του παιχνιδιού, οι κατασκευαστές του Minecraft έχουν προχωρήσει ένα βήμα παρακάτω, στη διευκόλυνση της ανάπτυξης επεκτάσεων (Modifications ή Mods) που αλλάζουν τη συμπεριφορά του παιχνιδιού ή προσθέτουν λειτουργίες. Μία από τις πιο ενδιαφέρουσες λειτουργίες προσθέτει τη δυνατότητα της εκμάθησης προγραμματισμού για τον υπολογιστή. Με δεδομένη την εμβύθιση (immersion) των χρηστών στο σύστημα διάδρασης του Minecraft, η ελπίδα είναι ότι η εκμάθηση του προγραμματισμού υπολογιστών μπορεί να κινητοποιηθεί από το ίδιο το μέσο, με σκοπό την κατασκευή νέων συμπεριφορών για τον κόσμο του Minecraft.   Η ενεργή συμμετοχή των χρηστών στην κατασκευή παιχνιδιών δεν είναι κάτι νέο, ούτε ήταν το Minecraft η πρώτη ανάλογη περίπτωση. Στις αρχές της δεκαετίας του 1990 η δημοφιλής σειρά βιντεο-παιχνιδιών Doom έδινε τη δυνατότητα στους χρήστες να κατασκευάσουν τις δικές τους πίστες, πράγμα που διατηρούσε το ενδιαφέρον τους για περισσότερο καιρό. Στη δυνατότητα mods του Minecraft, και ειδικά στην ευελιξία που δίνει για να εξυπηρετήσει διαφορετικούς σκοπούς, βλέπουμε τη διαφορετική φιλοσοφία απέναντι στην ιδιοκτησία που έχουν οι εταιρείες του διαδικτύου σε σχέση με τις παλιότερες εταιρείες κατασκευής παιχνιδιών, οι οποίες ήθελαν να έχουν όσο γίνεται μεγαλύτερο έλεγχο τόσο στους χαρακτήρες όσο και στο εικονικό περιβάλλον του παιχνιδιού, ενώ πολλές φορές είχαν κάνει την πρόσβαση στα βιντεο-παιχνίδια τους δύσκολη σε μια προσπάθεια να αποτρέψουν την παράνομη αντιγραφή.   Η ίδια η ιστορία της ανάπτυξης του Minecraft έχει ιδιαίτερο ενδιαφέρον και πέρα από τη φύση της διάδρασης, η οποία όπως είδαμε παραπάνω βασίζεται στη συμμετοχή των χρηστών τόσο στο περιεχόμενο του παιχνιδιού όσο και στην επέκταση της ίδιας της συμπεριφοράς του με τροποποιήσεις (modifications ή mods). Η αρχική ανάπτυξη του παιχνιδιού έγινε από έναν μόνο έμπειρο κατασκευαστή, ο οποίος άφησε τη θέση υπαλλήλου που είχε σε εταιρεία ανάπτυξης βιντεο-παιχνιδιών για να υλοποιήσει τις δικές του ιδέες. Η έμπνευση ήρθε από την ενασχόλησή του με βιντεο-παιχνίδια από μικρούς ανεξάρτητους παραγωγούς, οπότε δημιουργήθηκε η πρώτη έκδοση ενός παιχνιδιού όπου ο χρήστης μπορούσε να τοποθετήσει αντικείμενα σε χώρο τριών διαστάσεων. Στη συνέχεια πρόσθεσε τη δυνατότητα κατασκευής από πολλούς χρήστες καθώς και από ‘εχθρούς’ τους. Από εκεί και πέρα, η δημοσιότητα ήρθε από μόνη της, όταν οι χρήστες του παιχνιδιού άρχισαν να δημιουργούν όμορφες κατασκευές. Βλέπουμε, λοιπόν, ότι η προσωπική έκφραση μέσω του υπολογιστή στην περίπτωση του Minecraft δεν είναι μόνο ένα προνόμιο του δημιουργού του αλλά και όλων των τελικών χρηστών, που έτσι νιώθουν το παιχνίδι δικό τους.                                                                                                                              ","categories": ["case-study","definition"],
        "tags": ["moding","making","minecraft"],
        "url": "https://mibook.github.io/gr/case-study/minecraft/",
        "teaser":null},{
        "title": "Mouse",
        "excerpt":"Η περίπτωση της συσκευής εισόδου ποντίκι   Αν και σήμερα η χρήση της συσκευής εισόδου ‘ποντίκι’ σε συνδυασμό με τη γραφική επιφάνεια εργασίας και τις αντίστοιχες εφαρμογές γραφείου και παραγωγικότητας φαίνεται προφανής επιλογή χωρίς εναλλακτικές, αυτό δεν ήταν αυτονόητο μερικές δεκαετίες πριν. Στις αρχές της δεκαετίας του 1970, οι ερευνητές είχαν στη διάθεσή τους πολλές διαφορετικές συσκευές εισόδου για τον ίδιο σκοπό, δηλαδή την εργασία με εφαρμογές επεξεργασίας κειμένου σε έναν επιτραπέζιο υπολογιστή. Αν και η γραφική επιφάνεια εργασίας δεν ήταν ακόμη διαθέσιμη με την πλήρη μορφή της, η λειτουργικότητα των εφαρμογών επέτρεπε πολλές από τις διεργασίες που υποστηρίζει ένας σύγχρονος επιτραπέζιος υπολογιστής, όπως είναι η επιλογή μιας λέξης ή πρότασης και η αλλαγή ή η μετακίνησή της.   Το πρώτο πράγμα που πρέπει να οριστεί με μεγάλη ακρίβεια σε ένα πείραμα συγκριτικής αξιολόγησης εναλλακτικών συσκευών εισόδου, είναι ο στόχος και οι αντίστοιχες μετρικές και διεργασίες χρήστη που θα μπορούσαν να επιβεβαιώσουν τον βαθμό επιτυχίας του στόχου. Στην περίπτωση των συσκευών εισόδου, για τη διευκόλυνση της επεξεργασίας κειμένου, βλέπουμε ότι ανάμεσα στις πολλές λειτουργίες που εκτελεί ένας χρήστης υπάρχουν κάποιες που ξεχωρίζουν, γιατί είναι πολύ συχνές και πολύ απλές, και αυτές είναι η επιλογή αντικειμένων (target acquisition) στην οθόνη καθώς και η μετακίνησή τους σε μια άλλη θέση (object docking). Με δεδομένο ότι η εφαρμογή επεξεργασίας κειμένου εκτελείται σε ένα περιβάλλον γραφείου με σκοπό την αύξηση της παραγωγικότητας, μπορούμε να ορίσουμε ως αντιπροσωπευτικές μετρικές τον χρόνο που χρειάζεται ο χρήστης για να πραγματοποιήσει τις παραπάνω βασικές διεργασίες, καθώς και τα λάθη που κάνει. Στη συνέχεια, οι ερευνητές δοκιμάζουν τις εναλλακτικές λύσεις με τους χρήστες, συλλέγουν τα δεδομένα μέσω παρατήρησης, και κυρίως μέσω των αρχείων διάδρασης του λογισμικού προσομοίωσης, και δημιουργούν γραφήματα για να τα συγκρίνουν.   Από την πλευρά της πειραματικής μεθοδολογίας, αυτό που κάνει τη μελέτη των συσκευών εισόδου ιδιαίτερα ενδιαφέρουσα είναι η επιλογή των χρηστών και ειδικά ο αριθμός τους. Οι ερευνητές διάλεξαν ως χρήστες τις γραμματείς που εργάζονταν στο εργαστήριό τους και δικαιολόγησαν την επιλογή τους με δεδομένο ότι οι διεργασίες που τους έδωσαν, όπως η επεξεργασία κειμένου, είχαν να κάνουν με δουλειά γραφείου, επομένως ήταν εντός του πλαισίου εργασίας τους. Η εύκολη πρόσβαση στους χρήστες είναι σίγουρα μια σημαντική παράμετρος, ειδικά όταν έχουμε να κατασκευάσουμε επαναληπτικά μια νέα διάδραση, αλλά αυτό που έχει τη μεγαλύτερη σημασία είναι ο καθορισμός του πλήθους των χρηστών. Για αυτήν την παράμετρο, οι ερευνητές της συσκευής εισόδου ‘ποντίκι’ διάλεξαν μόνο πέντε χρήστες. Αν και σε πρώτη ανάγνωση ο αριθμός φαίνεται μικρός για οποιαδήποτε στατιστική ανάλυση, με μια προσεκτικότερη ματιά διαπιστώνουμε ότι το αντικείμενο ανάλυσης δεν ήταν οι πέντε χρήστες, αλλά οι διεργασίες που έκαναν με τις εναλλακτικές συσκευές εισόδου. Οι διεργασίες που έπρεπε να εκτελεστούν από τους πέντε χρήστες του πειράματος ήταν εκατοντάδες και πάνω σε αυτά τα δεδομένα οι ερευνητές αιτιολόγησαν τα συμπεράσματά τους.   Τα αποτελέσματα της συγκριτικής μελέτης των εναλλακτικών συσκευών εισόδου (έμμεσης διάδρασης) για τη μετακίνηση του δείκτη στην οθόνη έδειξαν πολλά περισσότερα από το γεγονός ότι το ποντίκι ήταν η πιο γρήγορη, ακριβής και εργονομική συσκευή για πολύωρη χρήση. Ανάλογα με τον κάθε χρήστη, οι ερευνητές διαπίστωσαν ότι από τη στιγμή που μπορεί να θεωρηθεί έμπειρος -πράγμα που πετύχαιναν με τις πολλές επαναλήψεις των τυπικών διεργασιών- η απόδοση της συσκευής εισόδου ‘ποντίκι’ σχετιζόταν με τις δυνατότητες του χρήστη να συντονίζει το χέρι με την όρασή του. Αυτή η διαπίστωση είναι πολύ σημαντική, καθώς καθορίζει ότι υπάρχει ένα άνω φράγμα στις επιδόσεις που μπορούμε να πετύχουμε με τη συσκευή εισόδου ‘ποντίκι’, το οποίο δεν εξαρτάται τόσο από τις επιμέρους ιδιότητες της συσκευής εισόδου, αλλά από τις ιδιότητες του ανθρώπινου καναλιού επικοινωνίας που συνδέει το χέρι με τον εγκέφαλο και τα μάτια. Η πληροφορία αυτή είναι πολύ σημαντική, επειδή όταν γνωρίζουμε τα ανθρώπινα όρια και τις ιδιότητες μιας νέας συσκευής εισόδου μπορούμε να αξιολογήσουμε νέες συσκευές εισόδου με στρατηγικό τρόπο. Στην πράξη βέβαια, οι παραπάνω γνώσεις έχουν φανεί περισσότερο χρήσιμες όταν έχουμε ήδη έτοιμες κάποιες συσκευές εισόδου, παρά όταν προσπαθούμε να σχεδιάσουμε κάποια εντελώς νέα, όπως στην περίπτωση του iPod click wheel.                                                                                                                                                                                       ","categories": ["case-study","definition"],
        "tags": ["mouse","douglas engelbart"],
        "url": "https://mibook.github.io/gr/case-study/mouse/",
        "teaser":null},{
        "title": "Η σχεδίαση των καθημερινών πραγμάτων",
        "excerpt":"H περίπτωση των καθημερινών πραγμάτων   Ο προγραμματισμός της διάδρασης έχει παραμείνει μια φευγαλέα περιοχή, επειδή σε κάθε χρονική περίοδο έχουμε διαφορετικές τεχνολογικές μορφές υπολογιστών (π.χ., επιτραπέζιος, κινητός, φορετός, διάχυτος) και διεπαφών με τους χρήστες (π.χ., γραμμή εντολών, γραφικό περιβάλλον, χειρονομίες, φυσική γλώσσα). Για παράδειγμα, ένας χρήστης υπολογιστών που έλαβε τη βασική, δευτεροβάθμια, και τριτοβάθμια εκπαίδευση τη δεκαετία του 1970, ή το πολύ μέχρι τα μισά της δεκαετίας του 1980, είναι πολύ πιθανό να έχει μεγάλη εξοικείωση με τη γραμμή εντολών και τους επιτραπέζιους υπολογιστές, αφού αυτή ήταν η βασική μορφή στα χρόνια της εκπαίδευσής του. Αντίστοιχα, ένας χρήστης που έλαβε την εκπαίδευσή του μετά το 2000 και κατά τη δεκαετία του 2010, είναι πολύ πιθανό να μην έχει καθόλου προσωπικό επιτραπέζιο υπολογιστή, αφού οι βασικές διεργασίες του χρήστη αυτήν τη χρονική περίοδο (π.χ., αναζήτηση στον παγκόσμιο ιστό, κοινωνική δικτύωση, ψηφιακό περιεχόμενο, κτλ.) μπορούν να γίνουν εξίσου καλά, αν όχι καλύτερα, με έναν κινητό υπολογιστή. Βλέπουμε, λοιπόν, ότι στην πράξη, ο ψηφιακός αλφαβητισμός είναι μια έννοια περισσότερο σχετική με τη δημογραφία και την ημερομηνία γέννησης, παρά μια διαχρονική αξία.   Η κατανόηση και η χρήση μιας συσκευής διέπεται από μερικές βασικές και διαχρονικές αξίες που είναι οι ίδιες ανεξάρτητα από το είδος και την πολυπλοκότητα που μπορεί να έχει η διάδραση ανθρώπου υπολογιστή. Στο κλασικό βιβλίο του “Η Σχεδίαση των Καθημερινών Πραγμάτων” ο Ντον Νόρμαν παραθέτει ένα μικρό σύνολο από βασικές αξίες και δίνει παραδείγματα καλής και κακής εφαρμογής σε καθημερινά απλά αντικείμενα, όπως πόρτες και υδραυλικά. Οι βασικές αξίες που πρέπει να έχει μια συσκευή, ώστε να είναι κατανοητή και εύχρηστη κατά τη διάδραση με τον άνθρωπο, είναι: affordance, constraint, mapping, feedback. Το affordance αναφέρεται στις περισσότερο ή λιγότερο προφανείς χρήσεις που επιτρέπει η ίδια η εμφάνιση και λειτουργία ενός αντικειμένου. Το constraint αναφέρεται στους περιορισμούς που σκόπιμα εισάγει ο σχεδιασμός, ώστε να εμποδίσει κάποιες χρήσεις ή να αποτρέψει το λάθος κατά την σωστή χρήση. Το mapping αναφέρεται στη φυσική σύνδεση ανάμεσα στις καταστάσεις λειτουργίας και στον έλεγχο από την πλευρά του χρήστη. Τέλος, το feedback αναφέρεται στην συνεχή ανάδραση του συστήματος, ώστε να είναι πάντα γνωστή η κατάστασή του στον χρήστη.   Η διαπίστωση που επιβεβαιώνεται διαχρονικά στη σχεδίαση των καθημερινών πραγμάτων είναι ότι οι κατασκευαστές επαναλαμβάνουν τα ίδια λάθη με την παράλειψη των βασικών αξιών και ότι οι αξίες αυτές έχουν μείνει αναλλοίωτες. Οι κατασκευαστές κάνουν τα ίδια λάθη, γιατί κάθε φορά που έχουμε μια νέα τεχνολογική επανάσταση, η κατασκευή της διάδρασης γίνεται συνήθως από τους κατασκευαστές που έχουν οικειότητα με τη νέα τεχνολογία και οι οποίοι συνήθως είναι είτε νέοι είτε επικεντρωμένοι μόνο στην τεχνολογία. Οι βασικές αξίες έχουν μείνει οι ίδιες, γιατί ο άνθρωπος αλλάζει πολύ πιο αργά από όσο η τεχνολογία. Τελικά, ο στόχος της ανθρωποκεντρικής κατασκευής συστημάτων είναι να βρούμε μια ισορροπία ανάμεσα σε όλες τις δυνάμεις που επηρεάζουν τη σχεδίαση, την κατασκευή, τη διανομή, και τη χρήση των συσκευών διάδρασης.                                                                                                                              ","categories": ["case-study","method"],
        "tags": ["donald norman","success"],
        "url": "https://mibook.github.io/gr/case-study/poet/",
        "teaser":null},{
        "title": "Reactable",
        "excerpt":"Η περίπτωση του Reactable   Το Reactable είναι ένα ψηφιακό μουσικό σύστημα που βασίζεται στη διάδραση με την αφή και με απτά αντικείμενα. Εκτός από την εκθεσιακή του εγκατάσταση και την πειραματική του χρήση, έχει χρησιμοποιηθεί σε συναυλίες από γνωστά συγκροτήματα και μουσικούς, όπως οι Coldplay και η Bjork. Το σύστημα -που είναι πλέον εμπορικό- ξεκίνησε από ένα ερευνητικό έργο σε πανεπιστήμιο και οι δημιουργοί του έκαναν διαθέσιμο μεγάλο μέρος από το λογισμικό και τις οδηγίες για την κατασκευή του υλικού, έτσι ώστε να μπορούν περισσότεροι χρήστες να το φτιάξουν και να το τροποποιήσουν.   Το υλικό του Reactable βασίζεται σε έναν βίντεο-προβολέα και μία κάμερα, που λειτουργούν ως συσκευές άμεσης εισόδου και εξόδου πάνω σε μια οριζόντια επιφάνεια, η οποία έχει τη μορφή ενός στρογγυλού τραπεζιού. Η επιφάνεια διάδρασης μπορεί και αναγνωρίζει την αφή σε πολλαπλά σημεία και την τοποθέτηση αντικειμένων τα οποία έχουν ένα είδος γραμμοκώδικα (fiducials). Το μεγάλο μέγεθος της οθόνης σε συνδυασμό με τη δυνατότητα αναγνώρισης πολλαπλών σημείων αφής και πολλών αντικειμένων επιτρέπει την ταυτόχρονη και συνεργατική διάδραση πολλών χρηστών, καθώς και την κατασκευή σύνθετων αναπαραστάσεων που στην περίπτωση του Reactable είναι φίλτρα ηλεκτρονικής μουσικής. Φυσικά, τίποτα δεν εμποδίζει έναν κατασκευαστή να χρησιμοποιήσει τα αρχέτυπα διάδρασης του Reactable (πολυαπτικό, απτά αντικείμενα) για να αναπτύξει εφαρμογές σε άλλα πεδία, όπως π.χ. στην εκπαίδευση.   Από τη σκοπιά των εργαλείων και της διαδικασίας ανάπτυξης, το πιο ενδιαφέρον τμήμα του λογισμικού ReacTIVision που χρησιμοποιείται στο σύστημα Reactable είναι το υποσύστημα της προσομοίωσης. Η δοκιμή για νέες χειρονομίες, για συνεργατικές εφαρμογές σε πολυαπτική οθόνη, μπορεί να ξεκινήσει από τον προσομοιωτή που εκτελείται πάνω στον επιτραπέζιο υπολογιστή και επιτρέπει στον κατασκευαστή να εξερευνήσει σχετικά άμεσα, μέσα από γρήγορη δοκιμή και επανάληψη, πιθανές εναλλακτικές. Στη συνέχεια, βέβαια, θα πρέπει να έχει στη διάθεσή του και την αντίστοιχη πραγματική πολυαπτική επιφάνεια, αφού είναι διαφορετικό για τους χρήστες να χειρίζονται απτά αντικείμενα και τα δάκτυλά τους, από το να προσομοιώνουν όλες αυτές τις κινήσεις μέσω του ποντικιού.   Συνοπτικά, βλέπουμε ότι η περίπτωση του προγραμματισμού της διάδρασης για το Reactable, που αντιπροσωπεύει ένα νέο σύστημα διάδρασης, απαιτεί πολλές δεξιότητες πέρα από τη γλώσσα προγραμματισμού. Αρχικά, οι κατασκευαστές του Reactable είχαν ως στόχο να ικανοποιήσουν τις ανάγκες μιας πολύ συγκεκριμένης ομάδας χρηστών, των μουσικών που παίζουν ζωντανά ηλεκτρονική μουσική. Με αφετηρία τις ειδικές ανάγκες αυτής της ομάδας σχεδίασαν και κατασκεύασαν τόσο το υλικό όσο και το λογισμικό για τη νέα συσκευή διάδρασης. Σε αυτήν την προσπάθεια δε χρειάστηκε να επανεφεύρουν τον τροχό. Αντιθέτως, ενσωμάτωσαν όσα περισσότερα έτοιμα στοιχεία μπορούσαν από σχετικά έργα (π.χ., πολυαπτική οθόνη προβολής, αναγνώριση εικόνας, πρωτόκολλο μετάδοσης δεδομένων). Σε αναλογία με την περίπτωση της γραφικής επιφάνειας εργασίας του επιτραπέζιου υπολογιστή, η οποία στόχευε να διευκολύνει την εργασία στο γραφείο, οι κατασκευαστές του Reactable οδηγήθηκαν σε μια νέα συσκευή διάδρασης που εξυπηρετεί τις ανάγκες της ζωντανής ηλεκτρονικής μουσικής με έναν νέο τρόπο, ο οποίος όμως βασίζεται σε στοιχεία από προηγούμενη έρευνα και ταυτόχρονα έχει την ευελιξία να εξυπηρετεί και σχετικές ομάδες χρηστών.                                                                                                                                                                                       ","categories": ["case-study","tools"],
        "tags": ["reactable","success"],
        "url": "https://mibook.github.io/gr/case-study/reactable/",
        "teaser":null},{
        "title": "Xerox Star",
        "excerpt":"Η περίπτωση του Xerox Star   Η γραφική επιφάνεια εργασίας όπως είναι διαθέσιμη σε πολλούς εμπορικούς επιτραπέζιους υπολογιστές λίγο διαφέρει από εκείνη που είχε ο υπολογιστής Xerox Star που δημιουργήθηκε στο ερευνητικό κέντρο PARC. Η γραφική επιφάνεια εργασίας σε συνδυασμό με το ποντίκι και το πληκτρολόγιο αποτελεί έναν ιδιαίτερα αποδοτικό τρόπο εργασίας με επεξεργαστές κειμένου, φύλλα εργασίας, και προγράμματα επεξεργασίας εικόνας και γραφικών. Δεν είναι τυχαίο ότι η δημιουργία της γραφικής επιφάνειας εργασίας έγινε από το ερευνητικό κέντρο PARC της εταιρείας XEROX κατά τη διάρκεια μελέτης και αυτοματοποίησης της εργασίας σε εκδοτικούς οργανισμούς. Αξίζει να δούμε λίγο πιο προσεκτικά τα χαρακτηριστικά του Star γιατί θα καταλάβουμε καλύτερα τους λόγους που η γραφική επιφάνεια εργασίας πήρε αυτήν τη μορφή και όχι κάποια άλλη η οποία θα ήταν αποδεκτή, αν το πλαίσιο ανάπτυξης και οι ανάγκες των χρηστών ήταν διαφορετικές.   Τα βασικά συστατικά της γραφικής επιφάνειας εργασίας υπήρχαν από προηγούμενες ερευνητικές και εμπορικές προσπάθειες (π.χ., ποντίκι, ηλεκτρονική επεξεργασία κειμένου σε οθόνη), αλλά ήταν το Xerox Star ο πρώτος υπολογιστής που ολοκλήρωνε τις κατακερματισμένες προσπάθειες σε μια χρήσιμη και εύχρηστη συσκευή. Η κινητήριος δύναμη αυτής της δημιουργικής και ολοκληρωμένης σύνθεσης ήταν η ανθρωποκεντρική σχεδίαση και ανάπτυξη του συστήματος Star με έμφαση στις ανάγκες ενός πελάτη, ενός εκδοτικού οίκου που έκανε επεξεργασία κειμένου και σελιδοποίηση εγγράφων και βιβλίων. Για τον σκοπό αυτό, οι ερευνητές έκαναν παρατήρηση (observation) του τρόπου εργασίας σε ένα γραφείο της εποχής που διαχειριζόταν έγγραφα. Με αυτόν τον τρόπο διαπίστωσαν ότι υπήρχε ανάγκη για εύκολη επεξεργασία και αποθήκευση ενός εγγράφου που περιείχε πολυμεσικά στοιχεία, καθώς και για τον διαμοιρασμό του. Οι παραπάνω προδιαγραφές που προέκυψαν από τις ανάγκες των χρηστών σε συνδυασμό με το πλαίσιο χρήσης (γραφείο εκδοτικού οργανισμού) οδήγησαν στη δημιουργία της γραφικής επιφάνειας εργασίας.   Η γραφική επιφάνεια εργασίας είναι μια συμπαγής και συνεπής σύνθεση από επιμέρους στοιχεία διάδρασης. Συνήθως αναφέρεται και ως μοντέλο ‘Windows Icons Menus Pointer’ (WIMP), καθώς τα βασικά της στοιχεία είναι τα παράθυρα, τα εικονίδια, τα μενού και ο δείκτης. Τα παράθυρα αντιπροσωπεύουν έγγραφα της ίδιας ή άλλων εφαρμογών, τα εικονίδια αντιπροσωπεύουν εφαρμογές, φακέλους και αρχεία, ενώ τα μενού επιτρέπουν ενέργειες πάνω σε αντικείμενα ή αλλαγή της κατάστασης μιας εφαρμογής. Ο δείκτης επιτρέπει την πλοήγηση (navigation) ανάμεσα σε παράθυρα, εικονίδια και μενού, καθώς και την επιλογή αντικειμένων. Ο δείκτης συνήθως ελέγχεται από ένα ποντίκι, αλλά αυτό δεν είναι η μόνη πιθανή συσκευή εισόδου, αφού ένας δείκτης μπορεί επίσης να ελέγχεται από διαφορετικές συσκευές εισόδου όπως είναι η πένα ή ακόμη και απευθείας με την αφή. Σε κάθε περίπτωση αυτό που είναι σημαντικό στη γραφική επιφάνεια εργασίας είναι να έχουμε απευθείας χειρισμό των στοιχείων της από τον δείκτη. Τα παραπάνω χαρακτηριστικά τα συναντάμε με διαφορετική αισθητική και μικρές παραλλαγές σε εναλλακτικά λειτουργικά συστήματα με γραφική επιφάνεια εργασίας.   Συνοπτικά, αυτό που ονομάζουμε γραφική επιφάνεια εργασίας είναι το αποτέλεσμα της δημιουργικής ολοκλήρωσης ενός συνόλου από προηγούμενες τεχνολογίες, για την εξυπηρέτηση των αναγκών μιας δεδομένης ομάδας χρηστών. Έχοντας αναλύσει παραπάνω τη γραφική επιφάνεια εργασίας από την πλευρά των χρηστών, οι οποίοι ήταν εργαζόμενοι γραφείου (κυρίως εκδοτικών οίκων ή συναφών οργανισμών), θα αναλύσουμε επίσης την πλευρά της τεχνολογίας, η οποία είχε βασιστεί σε προηγούμενα έργα. Ανάμεσα στις πολλές επιρροές του Xerox Star, η σημαντικότερη ήταν η υιοθέτηση της συσκευής εισόδου ποντίκι, και κυρίως ο τρόπος με τον οποίο ο δείκτης του ποντικιού επέτρεπε τη διάδραση με μια αφαιρετική αναπαράσταση της πληροφορίας σε μια οθόνη. Η σημασία αυτής της τεχνολογικής καινοτομίας μπορεί να γίνει κατανοητή αν αναλογιστούμε ότι μέχρι τότε η χρήση του υπολογιστή βασιζόταν στη στενή σύνδεση της εισόδου με την έξοδο για τον χρήστη, αφού για παράδειγμα είχαμε κείμενο σε οθόνη κειμένου, τα οποία διαχειριζόμασταν μόνο με το πληκτρολόγιο, χωρίς να υπάρχουν ενδιάμεσα επίπεδα αφαιρετικότητας του είδους της πληροφορίας. Τελικά, η συνεισφορά του υπολογιστή Star ήταν πολύ μεγαλύτερη από την αλλαγή του τρόπου που κάνουμε αυτό που λέμε “δουλειά γραφείου”, αφού η ιστορία ανάπτυξής του δείχνει τη μέθοδο, τα εργαλεία και τους κανόνες, για να σχεδιάσουμε και να κατασκευάσουμε νέους τρόπους διάδρασης με τον υπολογιστή.                                                                                                                                                                                       ","categories": ["case-study","definition"],
        "tags": ["xerox star","success"],
        "url": "https://mibook.github.io/gr/case-study/star/",
        "teaser":null},{
        "title": "Wikipedia",
        "excerpt":"Η περίπτωση της Wikipedia   Η συμμετοχική ανάπτυξη και η ευέλικτη διανομή και αλλαγή ενός προϊόντος για υπολογιστές ξεκίνησε με την περίπτωση του λογισμικού ανοικτού κώδικα. Όμως, η διαδικασία αυτή έγινε δημοφιλής και γνωστή με την περίπτωση της δικτυακής εγκυκλοπαίδειας Wikipedia. Προσπάθειες παρόμοιες με της Wikipedia, όπως εκείνη της nupedia -η οποία είχε ένα πιο ιεραρχικό και δομημένο μοντέλο δημοσίευσης και ενημέρωσης άρθρων, παρόμοιο με αυτό μια έντυπης εγκυκλοπαίδειας- δεν πέτυχαν στην πράξη. Βλέπουμε, λοιπόν, ότι ο πετυχημένος προγραμματισμός της διάδρασης είναι κάτι περισσότερο από τη μετατροπή μιας υπάρχουσας διαδικασίας σε ψηφιακή, αφού τουλάχιστον σε κάποιες -πετυχημένες- περιπτώσεις, όπως της Wikipedia, απαιτεί και την υιοθέτηση ενός νέου παραγωγικού μοντέλου, το οποίο έχει και αντίστοιχα διαφορετικές προδιαγραφές λειτουργίας και χρήσης. Η αποτελεσματικότητα της Wikipedia ήταν τόσο μεγάλη που μέσα σε λιγότερο από δέκα χρόνια οδήγησε την Encyclopaedia Britannica στην κατάργηση της έντυπης έκδοσης. Φυσικά, όπως και οι παραδοσιακές εγκυκλοπαίδειες, έτσι και η Wikipedia έχει δεχτεί κριτική για κάποια άρθρα της, με τη διαφορά όμως ότι στη Wikipedia η διαδικασία αποσαφήνισης είναι ανοικτή και τεκμηριωμένη.   Το προϊόν της Wikipedia βασίζεται σε δύο πυλώνες που είναι καινοτομικοί σε σχέση με την κυρίαρχη πρακτική εκείνης της εποχής (2000) για την παραγωγή και διανομή ψηφιακού περιεχομένου. Πρώτον, οι τελικοί χρήστες δημιουργούν και συντηρούν το περιεχόμενο της εγκυκλοπαίδειας και δεύτερον, η επεξεργασία ενός άρθρου γίνεται με το πρόγραμμα περιήγησης. Αν και αυτές οι δύο πρακτικές μπορεί να φαίνονται σήμερα κοινή λογική, εκείνη την εποχή η λογική αυτή είχε αποδοχή μόνο σε έναν πολύ μικρό κύκλο προγραμματιστών ανοικτού κώδικα, όπως ο Richard Stallman. Μάλιστα, στην πρώτη προσπάθεια δημιουργίας μιας ελεύθερης δικτυακής εγκυκλοπαίδειας οι ίδιοι οι δημιουργοί της Wikipedia προσπάθησαν χωρίς επιτυχία (π.χ., nupedia) να χρησιμοποιήσουν ειδικούς ανά θεματική κατηγορία και μια αυστηρή διαδικασία ελέγχου των άρθρων, ακριβώς όπως έκαναν οι έντυπες εγκυκλοπαίδειες. Ταυτόχρονα, οι περισσότεροι χρήστες και παραγωγοί περιεχομένου για τον ιστό είχαν την αντίληψη ότι άλλο είναι το πρόγραμμα περιήγησης που απλά διαβάζει μια σελίδα από τον εξυπηρετητή και άλλο είναι το πρόγραμμα επεξεργασίας που δημιουργεί και αλλάζει μια σελίδα για να την βάλει προς διανομή στον εξυπηρετητή.   H Wikipedia είναι ένα σπουδαίο παράδειγμα προγραμματισμού της διάδρασης για τους παρακάτω λόγους: Πρώτον, βλέπουμε για μια ακόμη φορά (π.χ., Facebook) ότι ένα σύστημα διάδρασης ανθρώπου-υπολογιστή μπορεί να γίνει πολύ επιτυχημένο, όχι επειδή είναι το πιο προηγμένο τεχνολογικά, αλλά επειδή είναι αυτό που εξυπηρετεί με απλό τρόπο τις πραγματικές ανάγκες των χρηστών (π.χ., επεξεργασία περιεχομένου χωρίς την ανάγκη πρόσθετου λογισμικού)και την κατάλληλη χρονική στιγμή. Δεύτερον, το μοντέλο λογισμικού τύπου wiki, μετά την επιτυχία που είχε με τη Wikipedia, χρησιμοποιήθηκε σε πάρα πολλές άλλες περιπτώσεις, όπως στην κατασκευή προσωπικών ιστοσελίδων από τους τελικούς χρήστες (π.χ., Wordpress). Τέλος, αν και μια εγκυκλοπαίδεια που δίνει εύκολη πρόσβαση στην ανθρώπινη γνώση σε πολλές γλώσσες είναι από μόνη της ένα σπουδαίο προϊόν, αυτό που κάνει πραγματικά ξεχωριστή τη Wikipedia είναι ότι αποτελεί την καλύτερη απόδειξη ότι ένα απλό λογισμικό και μερικοί κοινώς αποδεκτοί κανόνες συνεργασίας (π.χ., αρχείο αλλαγών και περιοχή συζήτησης) μπορούν να αντικαταστήσουν τη μέχρι τότε ιεραρχική και κερδοσκοπική διαδικασία παραγωγής προϊόντων περιεχομένου.   Το παραπάνω παράδειγμα λειτουργίας (καθολική συμμετοχή και συνεργατικό λογισμικό) της Wikipedia εφαρμόστηκε σε πολλές ακόμη περιπτώσεις συνεργατικής παραγωγής περιεχομένου, με ιδιαίτερη έμφαση στις περιπτώσεις εκείνες που οι κερδοσκοπικοί οργανισμοί δεν είχαν κίνητρα συμμετοχής (π.χ., ushahidi). Ένα ακόμη πολύ επιτυχημένο παράδειγμα είναι η παραγωγή χαρτογραφικής πληροφόρησης και ειδικά η προσπάθεια του OpenStreetMap, το οποίο επιτρέπει σε όλους τους χρήστες να εισάγουν δρόμους και χαρτογραφική πληροφορία σε μια κοινή περιοχή, με σκοπό να δημιουργηθεί μια εναλλακτική στα κυρίαρχα προϊόντα όπως το Google Maps, που ελέγχονται από κερδοσκοπικές εταιρείες. Για τους δημιουργούς των αντίστοιχων συστημάτων ανοικτής πρόσβασης, τα κίνητρα συμμετοχής τους είναι συνήθως κάτι περισσότερο από μια φιλοσοφική άρνηση του μοντέλου λειτουργίας των κερδοσκοπικών επιχειρήσεων, αφού ο στόχος τους είναι περισσότερο η πρόσβαση σε μια διαφορετική αντίληψη στην παραγωγή του περιεχομένου. Άλλωστε, ακόμη και οι κυρίαρχες πλατφόρμες χαρτών αποδέχτηκαν την αδυναμία τους να καλύψουν τις επιμέρους ανάγκες που συνέχεια προκύπτουν, και έδωσαν (από το 2013) τη δυνατότητα στους χρήστες να κάνουν προτάσεις για αλλαγές στους χάρτες τους (π.χ., Google Map Maker, Here Map Creator).                                                                                                                              ","categories": ["case-study","synthesis"],
        "tags": ["wikipedia","success"],
        "url": "https://mibook.github.io/gr/case-study/wikipedia/",
        "teaser":null},{
        "title": "Microsoft Windows",
        "excerpt":"Η περίπτωση των Microsoft Windows   Η επιφάνεια εργασίας του επιτραπέζιου υπολογιστή είναι ένα δημοφιλές και ευέλικτο σύστημα που πέρασε από πολλούς κύκλους ανάπτυξης και προσαρμογής, τόσο κατά τα πρώτα στάδια δημιουργίας του όσο και κατά τη διάδοσή του. Η επιφάνεια εργασίας είναι μια πολύ ενδιαφέρουσα μελέτη περίπτωσης γιατί η εξέλιξή της ήταν σχετικά αργή, σε ένα διάστημα περισσότερων από σαράντα χρόνων. Σίγουρα η επιφάνεια εργασίας δεν έγινε τόσο δημοφιλής -ούτε χρονικά ούτε σε κλίμακα- όσο η διεπαφή και η διάδραση με τον κινητό υπολογισμό. Από την άλλη πλευρά όμως, ο σταδιακός και διαχρονικός μετασχηματισμός της επιφάνειας εργασίας παρουσιάζει ενδιαφέρουσες διακυμάνσεις και ομοιότητες ανάμεσα σε ανταγωνιστικά εμπορικά προϊόντα, τα οποία μπορούν να μας δώσουν πολλά μαθήματα σχετικά με τον κύκλο της ανθρωποκεντρικής σχεδίασης.   Τα Microsoft Windows είναι σίγουρα το πιο δημοφιλές λειτουργικό σύστημα με επιφάνεια εργασίας για επιτραπέζιους υπολογιστές και παρουσιάζει ιδιαίτερο ενδιαφέρον ως μελέτη περίπτωσης γιατί η εξέλιξή του ήταν σταδιακή, πράγμα που μας επιτρέπει να βλέπουμε πιο καθαρά τα επιμέρους στάδια και να τα ερμηνεύουμε, αφού πρώτα τα συνδέσουμε με άλλες σχετικές εξελίξεις. Επειδή η αποδοχή του βασικού λειτουργικού συστήματος Microsoft Disk Operating System (MSDOS) ήταν πολύ μεγάλη, η πρώτη έκδοση του γραφικού περιβάλλοντος ήταν βασισμένη σε αυτό και δεν είχε πολλές από τις βασικές λειτουργίες της διάδρασης με τη γραφική επιφάνεια εργασίας που είχαν ήδη εμφανιστεί σε αντίστοιχα προϊόντα από τον ανταγωνισμό, όπως ήταν το MacOS. Βλέπουμε πως ο κατασκευαστής της διάδρασης σε ορισμένες περιπτώσεις μπορεί να αγνοήσει εφικτές και χρήσιμες δυνατότητες της διάδρασης, προκειμένου να δώσει βάρος σε παλιές εφαρμογές, απλά και μόνο επειδή οι χρήστες τις έχουν συνηθίσει ή επειδή οι αντίστοιχοι κατασκευαστές εκείνων των εφαρμογών δεν είναι έτοιμοι να περάσουν στην επόμενη φάση. Με άλλα λόγια, βλέπουμε για μια ακόμη φορά ότι ο τεχνολογικός ντετερμινισμός δεν είναι αρκετός για να σπρώξει μπροστά την ανάπτυξη, αφού υπάρχει και ο ανθρώπινος και ο κοινωνικός παράγοντας που είναι εξίσου σημαντικοί.   Στα μέσα της δεκαετίας του 1990 οι τεχνολογικές συνθήκες έχουν ωριμάσει τόσο, ώστε μια μεγάλη μερίδα από τους χρήστες λειτουργικών συστημάτων να έχει αποκτήσει ή να έχει πρόσβαση σε γρηγορότερους επεξεργαστές και σε ξεχωριστές κάρτες γραφικών. Ταυτόχρονα, η αγορά των οικιακών υπολογιστών έχει διευρυνθεί αρκετά και καλύπτει πολλές επιμέρους ανθρώπινες δραστηριότητες. Οπότε, οι κατασκευαστές υλικού έχουν αρχίσει να διαθέτουν εξειδικευμένο εξοπλισμό που συνδέεται με τον υπολογιστή για να διευκολύνει τις διεργασίες των χρηστών, όπως μουσική, παιχνίδια, σχεδίαση, κτλ. Το παραπάνω πλαίσιο δημιουργεί τις ιδανικές συνθήκες για την εισαγωγή των Windows95, τα οποία έχουν πλέον μια πλήρη γραφική επιφάνεια εργασίας και υποστηρίζουν την εύκολη προσθήκη νέων προγραμμάτων και επιπλέον υλικού. Η αποδοχή των Windows95 από την αγορά μπορεί να συγκριθεί μόνο με αυτή των WindowsXP σχεδόν δέκα χρόνια μετά, ενώ η μεγάλη ομοιότητά τους, τόσο με το αρχικό Macintosh OS, όσο και με το Xerox Star, αποτελεί την απόδειξη ότι από μόνη της η ποιότητα της διάδρασης δεν είναι αρκετή για να καθορίσει την τύχη ενός προϊόντος στην ευρύτερη αγορά, αλλά απαιτείται και μια καλύτερη κατανόηση των αναγκών των επιμέρους ομάδων χρηστών. Βλέπουμε ότι ο προγραμματισμός της διάδρασης δεν βασίζεται μόνο στη σωστή κατασκευή της διάδρασης αλλά και στη σωστή κατανόηση των αναγκών των χρηστών.   Όπως είδαμε στα παραπάνω, η κατανόηση και η προσαρμογή στις ανάγκες των χρηστών είναι σημαντική συνθήκη για την επιτυχία της διάδρασης, αρκεί βέβαια η διάδραση να είναι εξίσου καλά προσαρμοσμένη στη συσκευή του χρήστη. Αν και η Microsoft διατηρεί το προβάδισμα στα λειτουργικά συστήματα του επιτραπέζιου υπολογιστή, η δεκαετία του 2010 τη βρίσκει να έχει μείνει πίσω στη ραγδαία αναπτυσσόμενη αγορά του κινητού υπολογισμού, ο οποίος εκτός από τα έξυπνα κινητά τηλέφωνα περιλαμβάνει και τις ταμπλέτες, που σταδιακά αντικαθιστούν πολλές από τις διεργασίες του επιτραπέζιου υπολογιστή. Σε μια προσπάθεια να δώσει προτεραιότητα στις κινητές συσκευές, η Microsoft εισάγει τα Windows8 με αρχική οθόνη διάδρασης αντίστοιχη με εκείνη που έχει στις κινητές συσκευές της. Αν και η επιλογή αυτή δημιουργεί μια πραγματικά ομοιόμορφη και συνεπή εμπειρία για τους χρήστες που κινούνται ανάμεσα σε πολλούς υπολογιστές (κινητούς και επιτραπέζιους), ταυτόχρονα απέχει από το να είναι η βέλτιστη για τον επιτραπέζιο υπολογιστή, με αποτέλεσμα να μειώνει την ευχρηστία του. Βλέπουμε λοιπόν, ότι ναι μεν η εστίαση στον χρήστη έχει προτεραιότητα, αλλά και η κατανόηση της φόρμας του υπολογιστή δεν πρέπει να αγνοείται. Επομένως, ο σωστός προγραμματισμός της διάδρασης μπορεί να γίνει κατανοητός ως μια λεπτή ισορροπία ανάμεσα στις ιδιότητες της συσκευής και στις ανάγκες του χρήστη, ισορροπία που μπορεί να γίνει εύθραυστη όταν έχουμε πολλούς διαφορετικούς χρήστες, και πολλά διαφορετικά είδη συσκευής χρήστη.                                                                                                                                                                                                                                                ","categories": ["case-study","method"],
        "tags": ["Microsoft windows","success"],
        "url": "https://mibook.github.io/gr/case-study/windows/",
        "teaser":null},{
        "title": "World Wide Web",
        "excerpt":"Η περίπτωση του WWW   Η κατασκευή του συστήματος World Wide Web (WWW) και κυρίως η πολύ γρήγορη αποδοχή του από ένα μεγάλο εύρος χρηστών ήταν μια εξέλιξη κομβικής σημασίας για την ανάπτυξη και ολοκλήρωση της διάδρασης με τον επιτραπέζιο υπολογιστή. Σε πλήρη αναλογία με την αρχική κατασκευή της διάδρασης με την επιφάνεια εργασίας του επιτραπέζιου υπολογιστή (με σκοπό τη διευκόλυνση της εκδοτικής εργασίας), έτσι και το σύστημα WWW σχεδιάστηκε για να διευκολύνει τον διαμοιρασμό επιστημονικών δημοσιεύσεων. Η αναλογία του WWW με το Desktop συνεχίζεται και στη μετεξέλιξή τους, αφού και τα δύο μετασχηματίστηκαν και προσαρμόστηκαν για να εξυπηρετήσουν τις ανάγκες των χρηστών και σε άλλες εφαρμογές όπως η επικοινωνία, η διασκέδαση, η εκπαίδευση, κτλ.   Η ιστορία του WWW ξεκίνησε με μια ασύμμετρα χαμηλή αποδοχή όταν η περιγραφή του συστήματος πέρασε σχεδόν απαρατήρητη από την επιστημονική κοινότητα, αφού υπήρχαν ήδη αντίστοιχα συστήματα που ήταν περισσότερο πλήρη, όπως η Standard Generalized Markup Language (SGML). Αν και η γλώσσα Hyper-Text Markup Language (HTML) δεν θεωρήθηκε ως επιστημονική πρόοδος έγινε διαθέσιμη την σωστή στιγμή, ήταν εύχρηστη, και είχε όσες λειτουργίες ήταν χρήσιμες τότε, με αποτέλεσμα να πετύχει μεγάλη αποδοχή από μια ευρύτατη ομάδα χρηστών σε πολύ μικρό χρονικό διάστημα. Αυτό το γεγονός από μόνο του αποτελεί ένα σημαντικό παράδειγμα της περιοχής του προγραμματισμού της διάδρασης, όπου δεν κερδίζει ούτε η καλύτερη κατασκευή, ούτε η καλύτερη σχεδίαση, αλλά η πιο κατάλληλη και η πιο προσαρμόσιμη στις συνεχώς μεταλλασσόμενες τεχνολογικές ανάγκες των χρηστών. Η ανάπτυξη του WWW τόσο από την πλευρά των χρηστών που έβαζαν περιεχόμενο, όσο και από την πλευρά των κατασκευαστών που ανέπτυσσαν τις τεχνολογίες έγινε με τρόπο περισσότερο οργανικό, παρά με τρόπο ιεραρχικό και συντονισμένο βάσει κάποιων κοινά συμφωνημένων προδιαγραφών που προέρχονταν από συστηματική ανάλυση των αναγκών των χρηστών.   Πράγματι, το σύστημα WWW αποδείχτηκε εξαιρετικά προσαρμόσιμο σε νέα πεδία εφαρμογών, όπως το ηλεκτρονικό εμπόριο. Αν και αρχικά το σύστημα WWW σχεδιάστηκε για τον διαμοιρασμό επιστημονικών εργασιών, χάρη στην πολύ απλή δηλωτική γλώσσα οργάνωσης και μορφοποίησης της πληροφορίας, σε πολύ σύντομο χρονικό διάστημα γνώρισε την αποδοχή χρηστών που ήθελαν να μοιραστούν με τον υπόλοιπο κόσμο κάθε λογής πληροφορία. Πριν συμπληρώσει την πρώτη δεκαετία ζωής του, το σύστημα WWW με τη βοήθεια τεχνολογικών επεκτάσεων έδωσε τη δυνατότητα -εκτός από την ανάκτηση πληροφορίας- και για ηλεκτρονικές συναλλαγές. Φυσικά, η γλώσσα SGML αν και φαινομενικά χάθηκε, στην πορεία αποτέλεσε τη βάση για την XML που έγινε μέρος της XHTML και καθόρισε την HTML5, με την οποία το WWW απέκτησε πλέον τη μορφή πλατφόρμας εκτέλεσης γενικών υπολογιστικών εφαρμογών, κι όχι απλών εφαρμογών του Internet όπως ήταν ο αρχικός ρόλος του.   Η σημαντικότερη εξέλιξη του συστήματος WWW πραγματοποιήθηκε κατά την πρώτη δεκαετία του 2000, όταν ο συνδυασμός του δυναμικού προγραμματισμού στις τεχνολογίες του εξυπηρετητή και του φυλλομετρητή επέτρεψαν την ανάπτυξη πλήρως λειτουργικών εφαρμογών χρήστη. Αν και τα πρώτα δημοφιλή παραδείγματα δυναμικών εφαρμογών ήταν αυτά των ηλεκτρονικών συναλλαγών (π.χ., ebay, paypal) και του ηλεκτρονικού καλαθιού (π.χ, Amazon), η δικτυακή εφαρμογή που επαναπροσδιόρισε την αντίληψη που έχουμε για το WWW ήταν το Google Mail (Gmail). Το Gmail προσφέρει όλες τις λειτουργίες του ηλεκτρονικού ταχυδρομείου χωρίς να υπάρχει ανάγκη για την αντίστοιχη εφαρμογή που τρέχει πάνω από το λειτουργικό σύστημα. Με αυτόν τον τρόπο το Gmail αποτέλεσε το πρώτο μεγάλο βήμα για την αντιμετώπιση του απλού μέχρι τότε φυλλομετρητή ως λειτουργικού συστήματος και του WWW ως πλατφόρμα δικτυακού υπολογισμού (cloud computing).   Η καθιέρωση του συστήματος WWW συνεχίστηκε με ακόμη πιο έντονους ρυθμούς και μετά το 2005 με την ολοκλήρωση όλο και περισσότερων λειτουργιών, με περισσότερο χαρακτηριστικές περιπτώσεις το YouTube, το Facebook, και το Twitter, που σε μεγάλο βαθμό επαναπροσδιόρισαν το σύστημα WWW περισσότερο ως ένα ευέλικτο μέσο επικοινωνίας παρά ως ένα απλό εργαλείο για τον διαμοιρασμό επιστημονικών δημοσιεύσεων, όπως ήταν ο αρχικός σκοπός του. Ειδικά η ραγδαία ανάπτυξη και αποδοχή του Facebook αποτελεί παράδειγμα ανάλογο του ίδιου του WWW, όπου ένα τεχνολογικό σύστημα -χωρίς να έχει κάποια ιδιαίτερη τεχνολογική ή σχεδιαστική υπεροχή έναντι του ανταγωνισμού- προσαρμόζεται και εξυπηρετεί τις ανάγκες των χρηστών του, ενώ διαχρονικά και σταδιακά εξελίσσεται το ίδιο σε πλατφόρμα εφαρμογών. Οι τεχνολογικές εξελίξεις μετά το 2010 έδωσαν στο αρχικό σύστημα WWW τη δυνατότητα ανάπτυξης ενός πολύ μεγάλου εύρους εφαρμογών χρήστη (π.χ., ανταλλαγή μηνυμάτων, παιχνίδια), σε βαθμό τέτοιο που να μπορούμε πλέον να μιλάμε για μια πλατφόρμα ανάπτυξης αντίστοιχη με τα μέχρι τότε διαδεδομένα επιτραπέζια λειτουργικά συστήματα. Πράγματι, ο μετασχηματισμός της αντίληψης που έχουμε για το WWW αφού έκανε το πρώτο βήμα με τις εφαρμογές (π.χ., Wikipedia, Gmail), σταδιακά μετατράπηκε σε πλατφόρμα για την εκτέλεση εφαρμογών, όπου ο φυλλομετρητής αντικαθιστά το λειτουργικό σύστημα (π.χ., ChromeOS) και ο χρήστης έχει στην διάθεσή του δημοφιλείς εφαρμογές επικοινωνίας και γραφείου.   Συνολικά, η ερευνητική μελέτη περίπτωσης του συστήματος World Wide Web (WWW) αποτελεί μια σύνθεση των διαφορετικών θεωρήσεων της διάδρασης εξίσου ενδιαφέρουσα με εκείνη του επιτραπέζιου υπολογιστή. Όπως και ο επιτραπέζιος υπολογιστής, έτσι και το σύστημα WWW, μέσα στο χρονικό διάστημα μιας δεκαετίας, μετατράπηκε από ένα απλό σύστημα διαμοιρασμού ερευνητικών δημοσιεύσεων σε μια υπολογιστική πλατφόρμα πάνω στην οποία μπορούν να εκτελεστούν πολύ διαφορετικές εφαρμογές, από ψυχαγωγικά παιχνίδια, μέχρι εφαρμογές γραφείου, επικοινωνίας, και εμπορικών συναλλαγών.                                                                                                                              ","categories": ["case-study","synthesis"],
        "tags": ["WWW","success","Tim Berners Lee"],
        "url": "https://mibook.github.io/gr/case-study/www/",
        "teaser":null},{
        "title": "Xerox PARC",
        "excerpt":"Η περίπτωση του ερευνητικού κέντρου Xerox PARC   Το ερευνητικό κέντρο της Xerox με την ονομασία PARC (Palo Alto Research Center) δημιουργήθηκε το 1970 με στόχο να επενδύσει τα μεγάλα κέρδη που είχε η μητρική εταιρεία από την αγορά των βιομηχανικών εκτυπώσεων σε έρευνα και ανάπτυξη νέων προϊόντων και υπηρεσιών. Ειδικά η πρώτη δεκαετία λειτουργίας του PARC θα είναι γεμάτη εφευρέσεις που θα καθορίσουν το μέλλον του προσωπικού επιτραπέζιου υπολογιστή με επιφάνεια εργασίας, αφού εκεί θα ωριμάσουν σημαντικές τεχνολογίες όπως το ποντίκι, η γραφική επιφάνεια εργασίας, και οι αντικειμενοστραφεις γλώσσες προγραμματισμού. Ειδικά, η δημιουργική σύνθεση αυτών των τεχνολογιών στον Xerox Alto και αργότερα στον Xerox Star θα βάλουν τα θέμελια για τον επιτραπέζιο υπολογιστή με γραφική επιφάνεια εργασίας.   Ένας από τους βασικούς παράγοντες επιτυχίας του PARC είναι οι άνθρωποι που δούλεψαν εκεί. Ένας από τους πρώτους ήταν ο Alan Kay, ο οποίος, εκτός από την επιμέρους συμβολή του, είχε καταλυτικό ρόλο στην ανθρωποκεντρική φιλοσοφία που διαπνέει τις καινοτομίες του PARC. Επιπλέον, η δημιουργία του εργαστηρίου συνέπεσε με την περίοδο που το σπουδαίο εργαστήριο SRI (Stanford Research Institute) είχε προβλήματα χρηματοδότησης με αποτέλεσμα σημαντικοί επιστήμονες όπως ο Bill English να αναζητήσουν δουλειά στο PARC. Εκτός λοιπόν από την γεωγραφική εγκύτητα με το πανεπιστήμιο του Stanford, το οποίο παράγει συνέχεια νέους ερευνητές, το εργαστήριο είχε την τύχη να πάρει την σκυτάλη από την ομάδα του SRI που δημιούργησε το σύστημα NLS και το πρώτο ποντίκι.   Την δεκαετία του 1980 η άνθιση της βιομηχανίας των προσωπικών υπολογιστών θα δελεάσει με την σειρά της πολλούς από τους ερευνητές του PARC, οι οποίοι θα δουλέψουν σε εταιρείες όπως η Apple για την δημιουργία επιτυχημένων εμπορικών εκδόσεων των δημιουργιών του PARC. Δεν είναι τυχαίο ότι ο Steve Jobs το 1980 εμπνεύστηκε τον Macintosh κατά την διάρκεια μιας επίσκεψης εκεί. Το γεγονός ότι η ίδια η μητρική εταιρεία Xerox δεν μπόρεσε να εκμεταλευτεί τις δικιές της εφευρέσεις είναι αντιπροσωπευτικό της ανάγκης η έρευνα και η γνώση να είναι ανοιχτά για όλους, καθώς πολλές φορές οι χρηματοδότες της μπορεί να μην βλέπουν ή να μην ενδιαφέρονται για ευρήματα που τελικά είναι χρήσιμα για τους πολλούς.   Το 2020 το PARC συμπληρώνει πενήντα χρόνια συμβολής στην περιοχή της διάδρασης ανθρώπου-υπολογιστή, περίοδος που αντιστοιχεί και στην ηλικία αυτής της περιοχής. Αν και έχουν υπάρξει πολλά πανεπιστημιακά ή βιομηχανικά ερευνητικά κέντρα, καθώς και πολλές εταιρείες με μεγάλη συμβολή σε αυτόν τον χώρο, το PARC είναι με διαφορά το μόνο που έχει μια διαχρονική συμβολή. Πράγματι, την δεκαετία του 2010, ο επιτραπέζιος υπολογισμός δίνει την θέση του στον διάχυτο υπολογισμός (κινητά, τάμπλετες, φορετά), ο οποίος ήταν ένα από τα βασικά ερευνητικά θέματα του Marc Weiser στο Parc στις αρχές της δεκαετίας του 1990.                                                                                                                                                                                                                                                ","categories": ["case-study","forms","success"],
        "tags": ["Xerox PARC","Alan Kay","Marc Weiser","Bill English","Steve Jobs"],
        "url": "https://mibook.github.io/gr/case-study/xerox-parc/",
        "teaser":null},{
        "title": "active-badge",
        "excerpt":" ","categories": ["archetypes"],
        "tags": ["Xerox"],
        "url": "https://mibook.github.io/gr/gallery/active-badge/",
        "teaser":null},{
        "title": "adaptive-menus",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/adaptive-menus/",
        "teaser":null},{
        "title": "amazon-alexa",
        "excerpt":" ","categories": ["preface"],
        "tags": ["Amazon"],
        "url": "https://mibook.github.io/gr/gallery/amazon-alexa/",
        "teaser":null},{
        "title": "android-emulator",
        "excerpt":" ","categories": ["tools"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/android-emulator/",
        "teaser":null},{
        "title": "app",
        "excerpt":" ","categories": ["preface"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/app/",
        "teaser":null},{
        "title": "apple-i-computer",
        "excerpt":" ","categories": ["archetypes"],
        "tags": ["Apple"],
        "url": "https://mibook.github.io/gr/gallery/apple-i-computer/",
        "teaser":null},{
        "title": "Apple Macintosh 1984",
        "excerpt":" ","categories": ["archetypes","forms"],
        "tags": ["Apple","Macintosh","One-button"],
        "url": "https://mibook.github.io/gr/gallery/apple-macintosh/",
        "teaser":null},{
        "title": "apple-mouse",
        "excerpt":" ","categories": ["archetypes","input-device"],
        "tags": ["Apple","Mouse","One-button"],
        "url": "https://mibook.github.io/gr/gallery/apple-mouse/",
        "teaser":null},{
        "title": "apple-newton",
        "excerpt":" ","categories": ["archetypes"],
        "tags": ["Apple","Apple Newton","iPad","mobile devices"],
        "url": "https://mibook.github.io/gr/gallery/apple-newton/",
        "teaser":null},{
        "title": "apple-siri",
        "excerpt":" ","categories": ["preface"],
        "tags": ["Apple"],
        "url": "https://mibook.github.io/gr/gallery/apple-siri/",
        "teaser":null},{
        "title": "apple-smartwatch",
        "excerpt":" ","categories": ["SYNTHESIS"],
        "tags": ["Wearable","Ergonomics","Wheel"],
        "url": "https://mibook.github.io/gr/gallery/apple-smartwatch/",
        "teaser":null},{
        "title": "architecture-model",
        "excerpt":" ","categories": ["definition"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/architecture-model/",
        "teaser":null},{
        "title": "arduino-lilypad",
        "excerpt":" ","categories": ["tools"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/arduino-lilypad/",
        "teaser":null},{
        "title": "arduino-shield",
        "excerpt":" ","categories": ["tools"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/arduino-shield/",
        "teaser":null},{
        "title": "arduino_uno",
        "excerpt":" ","categories": ["tools"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/arduino_uno/",
        "teaser":null},{
        "title": "aspen-movie-map",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/aspen-movie-map/",
        "teaser":null},{
        "title": "atm-affective",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/atm-affective/",
        "teaser":null},{
        "title": "bbs",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/bbs/",
        "teaser":null},{
        "title": "bell nomograph",
        "excerpt":" ","categories": ["preface"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/bell-nomograph/",
        "teaser":null},{
        "title": "cad",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/cad/",
        "teaser":null},{
        "title": "canvas",
        "excerpt":" ","categories": ["introduction"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/canvas/",
        "teaser":null},{
        "title": "card",
        "excerpt":" ","categories": ["archetypes","input-device"],
        "tags": ["Input Card","Programming"],
        "url": "https://mibook.github.io/gr/gallery/card/",
        "teaser":null},{
        "title": "classroom",
        "excerpt":" ","categories": ["introduction"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/classroom/",
        "teaser":null},{
        "title": "crowdsourcing",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/crowdsourcing/",
        "teaser":null},{
        "title": "designing",
        "excerpt":" ","categories": ["definition","prototypes"],
        "tags": ["Design","Mobile App","Drawing"],
        "url": "https://mibook.github.io/gr/gallery/design/",
        "teaser":null},{
        "title": "desktop-interaction-history-future",
        "excerpt":" ","categories": ["definition"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/desktop-interaction-history-future/",
        "teaser":null},{
        "title": "desktop",
        "excerpt":" ","categories": ["preface"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/desktop/",
        "teaser":null},{
        "title": "Digital Desk",
        "excerpt":" ","categories": ["forms","models","tools"],
        "tags": ["PhD"],
        "url": "https://mibook.github.io/gr/gallery/digital-desk/",
        "teaser":null},{
        "title": "dtp",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/dtp/",
        "teaser":null},{
        "title": "dvorak-keyboard",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/dvorak-keyboard/",
        "teaser":null},{
        "title": "dynabook",
        "excerpt":" ","categories": ["preface"],
        "tags": ["dynabook","tablet","laptop","history"],
        "url": "https://mibook.github.io/gr/gallery/dynabook/",
        "teaser":null},{
        "title": "eclipse-ide",
        "excerpt":" ","categories": ["tools"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/eclipse-ide/",
        "teaser":null},{
        "title": "electronics",
        "excerpt":" ","categories": ["introduction"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/electronics/",
        "teaser":null},{
        "title": "elements",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/elements/",
        "teaser":null},{
        "title": "Engelbart-mouse",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/engelbart-mouse/",
        "teaser":null},{
        "title": "exams",
        "excerpt":" ","categories": ["introduction"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/exams/",
        "teaser":null},{
        "title": "facebook1",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/facebook1/",
        "teaser":null},{
        "title": "facebook2",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/facebook2/",
        "teaser":null},{
        "title": "fitts-comparison",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/fitts-comparison/",
        "teaser":null},{
        "title": "fitts-law",
        "excerpt":" ","categories": ["archetypes","tools","method"],
        "tags": ["ergonomics","modeling","usability testing"],
        "url": "https://mibook.github.io/gr/gallery/fitts-law/",
        "teaser":null},{
        "title": "geos",
        "excerpt":" ","categories": ["method"],
        "tags": ["Geoworks"],
        "url": "https://mibook.github.io/gr/gallery/geos/",
        "teaser":null},{
        "title": "github contributions",
        "excerpt":" ","categories": ["introduction"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/github-contributions/",
        "teaser":null},{
        "title": "github profile",
        "excerpt":" ","categories": ["introduction"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/github-profile/",
        "teaser":null},{
        "title": "gmail-beta",
        "excerpt":" ","categories": ["definition"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/gmail-beta/",
        "teaser":null},{
        "title": "google-assistant",
        "excerpt":" ","categories": ["preface"],
        "tags": ["Google"],
        "url": "https://mibook.github.io/gr/gallery/google-assistant/",
        "teaser":null},{
        "title": "google-now",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/google-now/",
        "teaser":null},{
        "title": "Google Assistant",
        "excerpt":" ","categories": ["models","partner"],
        "tags": ["Google","Assistant","AI"],
        "url": "https://mibook.github.io/gr/gallery/google_assistant/",
        "teaser":null},{
        "title": "google_search_engine",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/google_search_engine/",
        "teaser":null},{
        "title": "hackathon",
        "excerpt":" ","categories": ["introduction"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/hackathon/",
        "teaser":null},{
        "title": "hackerspace",
        "excerpt":" ","categories": ["introduction"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/hackerspace/",
        "teaser":null},{
        "title": "hand-occlusion",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/hand-occlusion/",
        "teaser":null},{
        "title": "hipmunk",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/hipmunk/",
        "teaser":null},{
        "title": "home programming",
        "excerpt":" ","categories": ["preface"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/home-programming/",
        "teaser":null},{
        "title": "human-centered-design",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/human-centered-design/",
        "teaser":null},{
        "title": "hypercard-layout",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/hypercard-layout/",
        "teaser":null},{
        "title": "hypermedia",
        "excerpt":" ","categories": ["preface"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/hypermedia/",
        "teaser":null},{
        "title": "ical",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/ical/",
        "teaser":null},{
        "title": "igoefinger",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/igoefinger/",
        "teaser":null},{
        "title": "input-comparison",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/input-comparison/",
        "teaser":null},{
        "title": "input-device-taxonomy",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/input-device-taxonomy/",
        "teaser":null},{
        "title": "ipod_1g",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/ipod_1g/",
        "teaser":null},{
        "title": "ipod_classic",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/ipod_classic/",
        "teaser":null},{
        "title": "ipod_touch_2g",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/ipod_touch_2g/",
        "teaser":null},{
        "title": "IRC chat",
        "excerpt":" ","categories": ["models","communication"],
        "tags": ["Chat"],
        "url": "https://mibook.github.io/gr/gallery/irc/",
        "teaser":null},{
        "title": "itunes3",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/itunes3/",
        "teaser":null},{
        "title": "itv-buck",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/itv-buck/",
        "teaser":null},{
        "title": "itv-program",
        "excerpt":" ","categories": ["definition"],
        "tags": ["interactive tv","entertainment","painting","winky dink and you"],
        "url": "https://mibook.github.io/gr/gallery/itv-program/",
        "teaser":null},{
        "title": "justinmind",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/justinmind/",
        "teaser":null},{
        "title": "kickstarter-pebble",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/kickstarter-pebble/",
        "teaser":null},{
        "title": "kidsim",
        "excerpt":" ","categories": ["preface"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/kidsim/",
        "teaser":null},{
        "title": "kodak-hifi",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/kodak-hifi/",
        "teaser":null},{
        "title": "latex",
        "excerpt":" ","categories": ["tools"],
        "tags": ["text editor"],
        "url": "https://mibook.github.io/gr/gallery/latex/",
        "teaser":null},{
        "title": "learntomod",
        "excerpt":" ","categories": ["definition"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/learntomod/",
        "teaser":null},{
        "title": "lifestreams",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/lifestreams/",
        "teaser":null},{
        "title": "linux",
        "excerpt":" ","categories": ["definition"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/linux/",
        "teaser":null},{
        "title": "long-tail",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/long-tail/",
        "teaser":null},{
        "title": "macintosh-desktop",
        "excerpt":" ","categories": ["definition"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/macintosh-desktop/",
        "teaser":null},{
        "title": "magic-cap",
        "excerpt":" ","categories": ["archetypes","forms"],
        "tags": ["General Magic","Mobile","PDA"],
        "url": "https://mibook.github.io/gr/gallery/magic-cap/",
        "teaser":null},{
        "title": "makerspace",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/makerspace/",
        "teaser":null},{
        "title": "Makey Makey",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/makey_makey_front/",
        "teaser":null},{
        "title": "mapping-principle",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/mapping-principle/",
        "teaser":null},{
        "title": "math-blaster",
        "excerpt":" ","categories": ["definition"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/math-blaster/",
        "teaser":null},{
        "title": "mediaspace",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/mediaspace/",
        "teaser":null},{
        "title": "meetup",
        "excerpt":" ","categories": ["introduction"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/meetup/",
        "teaser":null},{
        "title": "memex",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/memex/",
        "teaser":null},{
        "title": "menus-on-top",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/menus-on-top/",
        "teaser":null},{
        "title": "menus-on-windows",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/menus-on-windows/",
        "teaser":null},{
        "title": "messenger",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/messenger/",
        "teaser":null},{
        "title": "microsoft-bob",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/microsoft-bob/",
        "teaser":null},{
        "title": "minecraft-pi",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/minecraft-pi/",
        "teaser":null},{
        "title": "minecraft",
        "excerpt":" ","categories": ["definition"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/minecraft/",
        "teaser":null},{
        "title": "mit-scratch",
        "excerpt":" ","categories": ["tools"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/mit-scratch/",
        "teaser":null},{
        "title": "Mixed reality continuum",
        "excerpt":" ","categories": ["archetypes","forms"],
        "tags": ["Virtual Reality","Augmented Reality","Mixed reality"],
        "url": "https://mibook.github.io/gr/gallery/mixed-reality/",
        "teaser":null},{
        "title": "mobile",
        "excerpt":" ","categories": ["preface"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/mobile/",
        "teaser":null},{
        "title": "mockups",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/mockups/",
        "teaser":null},{
        "title": "modern-pc-mouse",
        "excerpt":" ","categories": ["archetypes","input-device"],
        "tags": ["Mouse"],
        "url": "https://mibook.github.io/gr/gallery/modern-pc-mouse/",
        "teaser":null},{
        "title": "mouse-test-software",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/mouse-test-software/",
        "teaser":null},{
        "title": "MS-DOS",
        "excerpt":" ","categories": ["method","case-study"],
        "tags": ["MS-DOS","Microsoft","Windows","OS"],
        "url": "https://mibook.github.io/gr/gallery/msdos/",
        "teaser":null},{
        "title": "multimodal",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/multimodal/",
        "teaser":null},{
        "title": "myron-kruger",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/myron-kruger/",
        "teaser":null},{
        "title": "nintendo-wii",
        "excerpt":" ","categories": ["preface"],
        "tags": ["synthesis"],
        "url": "https://mibook.github.io/gr/gallery/nintendo-wii/",
        "teaser":null},{
        "title": "nls",
        "excerpt":" ","categories": ["definition"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/nls/",
        "teaser":null},{
        "title": "office-schematic",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/office-schematic/",
        "teaser":null},{
        "title": "open-street-map",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/open-street-map/",
        "teaser":null},{
        "title": "Napster και οικονομία διαμοιρασμού",
        "excerpt":" ","categories": ["preface"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/p2p/",
        "teaser":null},{
        "title": "panorama",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/panorama/",
        "teaser":null},{
        "title": "pebble-hifi",
        "excerpt":" ","categories": ["tools"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/pebble-hifi/",
        "teaser":null},{
        "title": "personas",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/personas/",
        "teaser":null},{
        "title": "probes",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/probes/",
        "teaser":null},{
        "title": "processing-ide",
        "excerpt":" ","categories": ["tools"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/processing-ide/",
        "teaser":null},{
        "title": "prototype-evaluation",
        "excerpt":" ","categories": ["method"],
        "tags": ["Prototype","Evaluation"],
        "url": "https://mibook.github.io/gr/gallery/prototype-evaluation/",
        "teaser":null},{
        "title": "prototype-levels",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/prototype-levels/",
        "teaser":null},{
        "title": "prototype-lifecycle",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/prototype-lifecycle/",
        "teaser":null},{
        "title": "prototype-types",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/prototype-types/",
        "teaser":null},{
        "title": "pygmalion",
        "excerpt":" ","categories": ["tools"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/pygmalion/",
        "teaser":null},{
        "title": "qwerty-typewriter",
        "excerpt":" ","categories": ["method"],
        "tags": ["Keyboard"],
        "url": "https://mibook.github.io/gr/gallery/qwerty-typewriter/",
        "teaser":null},{
        "title": "raspberrypi",
        "excerpt":" ","categories": ["preface"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/raspberrypi/",
        "teaser":null},{
        "title": "reactable-fountain",
        "excerpt":" ","categories": ["tools"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/reactable-fountain/",
        "teaser":null},{
        "title": "reactable",
        "excerpt":" ","categories": ["tools"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/reactable/",
        "teaser":null},{
        "title": "reactivision-simulator",
        "excerpt":" ","categories": ["tools"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/reactivision-simulator/",
        "teaser":null},{
        "title": "relational-agent",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/relational-agent/",
        "teaser":null},{
        "title": "second-life",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/second-life/",
        "teaser":null},{
        "title": "Sensory_Homunculus",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/sensory_homunculus/",
        "teaser":null},{
        "title": "sketchpad",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/sketchpad/",
        "teaser":null},{
        "title": "skype",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/skype/",
        "teaser":null},{
        "title": "smalltalk",
        "excerpt":" ","categories": ["archetypes","programming language"],
        "tags": ["Xerox Alto","Smalltalk"],
        "url": "https://mibook.github.io/gr/gallery/smalltalk/",
        "teaser":null},{
        "title": "social-reviews",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/social-reviews/",
        "teaser":null},{
        "title": "social",
        "excerpt":" ","categories": ["preface"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/social/",
        "teaser":null},{
        "title": "socio-technical-design",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/socio-technical-design/",
        "teaser":null},{
        "title": "software",
        "excerpt":" ","categories": ["introduction"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/software/",
        "teaser":null},{
        "title": "star7-sunmicrosystems",
        "excerpt":" ","categories": ["definition","tools","method"],
        "tags": ["star7","sun microsystems","prototype","pda","portable","touchscreen","metaphor"],
        "url": "https://mibook.github.io/gr/gallery/star7-sunmicrosystems/",
        "teaser":null},{
        "title": "starfire",
        "excerpt":" ","categories": ["method"],
        "tags": ["starfire","sun microsystems","video prototype","horizontal prototype","itv"],
        "url": "https://mibook.github.io/gr/gallery/starfire/",
        "teaser":null},{
        "title": "steve-mann-wearable-computer",
        "excerpt":" ","categories": ["archetypes"],
        "tags": ["Steve Mann","Wearable Computer"],
        "url": "https://mibook.github.io/gr/gallery/steve-mann-wearable-computer/",
        "teaser":null},{
        "title": "sword-of-damocles",
        "excerpt":" ","categories": ["archetypes","output-device"],
        "tags": ["Ivan Shutherland","Graphics"],
        "url": "https://mibook.github.io/gr/gallery/sword-of-damocles/",
        "teaser":null},{
        "title": "symbolic-abstraction",
        "excerpt":" ","categories": ["tools"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/symbolic-abstraction/",
        "teaser":null},{
        "title": "tabs-pads-boards",
        "excerpt":" ","categories": ["forms","ubiquitous computing"],
        "tags": ["Tab","Pad","Board","Xerox PARC"],
        "url": "https://mibook.github.io/gr/gallery/tabs-pads-boards/",
        "teaser":null},{
        "title": "teachlive-lab",
        "excerpt":" ","categories": ["tools"],
        "tags": ["teaching","virtual reality"],
        "url": "https://mibook.github.io/gr/gallery/teachlive-lab/",
        "teaser":null},{
        "title": "tenbyten",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/tenbyten/",
        "teaser":null},{
        "title": "time-space-cscw",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/time-space-cscw/",
        "teaser":null},{
        "title": "tool-need",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/tool-need/",
        "teaser":null},{
        "title": "touch-develop",
        "excerpt":" ","categories": ["tools"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/touch-develop/",
        "teaser":null},{
        "title": "touchdevelop",
        "excerpt":" ","categories": ["preface"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/touchdevelop/",
        "teaser":null},{
        "title": "touchpad",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/touchpad/",
        "teaser":null},{
        "title": "uber",
        "excerpt":" ","categories": ["definition"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/uber/",
        "teaser":null},{
        "title": "ubiq",
        "excerpt":" ","categories": ["preface"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/ubiq/",
        "teaser":null},{
        "title": "ui-sketch",
        "excerpt":" ","categories": ["definition"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/ui-sketch/",
        "teaser":null},{
        "title": "uist-history",
        "excerpt":" ","categories": ["tools"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/uist-history/",
        "teaser":null},{
        "title": "usability-observation",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/usability-observation/",
        "teaser":null},{
        "title": "user-centered-history",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/user-centered-history/",
        "teaser":null},{
        "title": "visicalc",
        "excerpt":" ","categories": ["models"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/visicalc/",
        "teaser":null},{
        "title": "visual-basic-form-designer",
        "excerpt":" ","categories": ["tools"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/visual-basic-form-designer/",
        "teaser":null},{
        "title": "vr-soldier-training",
        "excerpt":" ","categories": ["synthesis"],
        "tags": ["Virtual-Reality"],
        "url": "https://mibook.github.io/gr/gallery/vr-soldier-training/",
        "teaser":null},{
        "title": "we-feel-fine",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/we-feel-fine/",
        "teaser":null},{
        "title": "wearable",
        "excerpt":" ","categories": ["preface"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/wearable/",
        "teaser":null},{
        "title": "weiser-pad-board",
        "excerpt":" ","categories": ["archetypes","forms"],
        "tags": ["Xerox PARC","Tab","Board"],
        "url": "https://mibook.github.io/gr/gallery/weiser-pad-board/",
        "teaser":null},{
        "title": "weiser-tab-pad-board",
        "excerpt":" ","categories": ["archetypes","forms"],
        "tags": ["Xerox PARC","Tab","Board"],
        "url": "https://mibook.github.io/gr/gallery/weiser-tab-pad-board/",
        "teaser":null},{
        "title": "marc weiser",
        "excerpt":" ","categories": ["forms","ubiquitous computing"],
        "tags": ["Tab","Pad","Board","Xerox PARC"],
        "url": "https://mibook.github.io/gr/gallery/weiser/",
        "teaser":null},{
        "title": "wikipedia-edit",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/wikipedia-edit/",
        "teaser":null},{
        "title": "wikipedia-growth",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/wikipedia-growth/",
        "teaser":null},{
        "title": "winamp",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/winamp/",
        "teaser":null},{
        "title": "windows-mobile",
        "excerpt":" ","categories": ["tools"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/windows-mobile/",
        "teaser":null},{
        "title": "windows1",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/windows1/",
        "teaser":null},{
        "title": "windows10",
        "excerpt":" ","categories": ["archetypes","GUI","Desktop"],
        "tags": ["Microsoft","Start menu"],
        "url": "https://mibook.github.io/gr/gallery/windows10/",
        "teaser":null},{
        "title": "windows8",
        "excerpt":" ","categories": ["method","archetypes","GUI","Desktop"],
        "tags": ["Microsoft","Start menu"],
        "url": "https://mibook.github.io/gr/gallery/windows8/",
        "teaser":null},{
        "title": "windows95",
        "excerpt":" ","categories": ["method"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/windows95/",
        "teaser":null},{
        "title": "wristwatch-computer-mann",
        "excerpt":" ","categories": ["forms"],
        "tags": ["Steve Mann","Wearable","wristwatch","smartwatch"],
        "url": "https://mibook.github.io/gr/gallery/wristwatch-computer-mann/",
        "teaser":null},{
        "title": "www",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/www/",
        "teaser":null},{
        "title": "x-window-system",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/x-window-system/",
        "teaser":null},{
        "title": "xanadu",
        "excerpt":" ","categories": ["synthesis"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/xanadu/",
        "teaser":null},{
        "title": "Xerox Alto Bravo Word Processor",
        "excerpt":" ","categories": ["models","tools"],
        "tags": ["Xerox","Application","Desktop"],
        "url": "https://mibook.github.io/gr/gallery/xerox-alto-bravo/",
        "teaser":null},{
        "title": "xerox-alto",
        "excerpt":" ","categories": ["archetypes","input-device"],
        "tags": ["Xerox","Desktop","Mouse","Star"],
        "url": "https://mibook.github.io/gr/gallery/xerox-alto/",
        "teaser":null},{
        "title": "xeroc-parc-tab",
        "excerpt":" ","categories": ["archetypes","forms"],
        "tags": ["Xerox Parc","Tab","Mobile"],
        "url": "https://mibook.github.io/gr/gallery/xerox-parc-tab/",
        "teaser":null},{
        "title": "xerox-star",
        "excerpt":" ","categories": ["archetypes"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/xerox-star-desktop/",
        "teaser":null},{
        "title": "xerox-star-genealogy",
        "excerpt":" ","categories": ["definition"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/xerox-star-genealogy/",
        "teaser":null},{
        "title": "xerox-star",
        "excerpt":" ","categories": ["definition"],
        "tags": [],
        "url": "https://mibook.github.io/gr/gallery/xerox-star/",
        "teaser":null},{
        "title": "Header",
        "excerpt":" ","categories": [],
        "tags": [],
        "url": "https://mibook.github.io/gr/header/header/",
        "teaser":null},{
        "title": "Header0",
        "excerpt":" ","categories": [],
        "tags": [],
        "url": "https://mibook.github.io/gr/header/header0/",
        "teaser":null},{
        "title": "Header12",
        "excerpt":" ","categories": [],
        "tags": [],
        "url": "https://mibook.github.io/gr/header/header12/",
        "teaser":null},{
        "title": "Header2",
        "excerpt":" ","categories": [],
        "tags": [],
        "url": "https://mibook.github.io/gr/header/header2/",
        "teaser":null},{
        "title": "Header5",
        "excerpt":" ","categories": [],
        "tags": [],
        "url": "https://mibook.github.io/gr/header/header5/",
        "teaser":null},{
        "title": "Header8",
        "excerpt":" ","categories": [],
        "tags": [],
        "url": "https://mibook.github.io/gr/header/header8/",
        "teaser":null},{
        "title": "Header9",
        "excerpt":" ","categories": [],
        "tags": [],
        "url": "https://mibook.github.io/gr/header/header9/",
        "teaser":null},{
        "title": "Quantified Self",
        "excerpt":"Μέτρηση Φυσικής Δραστηριότητας   Ανάλυση σχετικών έργων           Να καταγράψετε τις ιδιότητες μερικών (3-4) εφαρμογών ενθάρρυνσης της φυσικής άσκησης. Να διαλέξετε είτε εφαρμογές που θεωρείτε ότι είναι σωστά φτιαγμένες είτε που πιστεύετε ότι έχουν προβλήματα χρήσης.            Να οργανώσετε τις πληροφορίες που βρήκατε σε ένα πίνακα όπου στις γραμμές να είναι οι εφαρμογές που εντοπίσατε και στις στήλες: 1) ο άνθρωπος, 2) το πλαίσιο χρήσης, 3) ο σκοπός, 4) η διεργασία χρήσης.       Εντοπισμός αναγκών           Να καταγράψετε τις ανάγκες των πιθανών χρηστών και τους στόχους της εφαρμογής σας με βάση τους πίνακες που φτιάξατε προηγουμένως.            Να ενημερώσετε τον πίνακα της προηγούμενης ενότητας ώστε να περιλαμβάνει μία στήλη ακόμη, η οποία να περιγράφει τους λόγους επιτυχίας ή αποτυχίας των αντίστοιχων εφαρμογών.            Να ενημερώσετε τον πίνακα της προηγούμενης ενότητας ώστε να περιλαμβάνει στήλες με τους κανόνες σχεδίασης που ακολουθεί η κάθε εφαρμογή και να προσθέσετε και τη δική σας εφαρμογή.            Να ενημερώσετε τις προδιαγραφές της εφαρμογής σας, ώστε να μοιάζει περισσότερο με τις εφαρμογές που πέτυχαν και να αποφεύγει τα λάθη εκείνων που απέτυχαν.            Ανάλογα με την επιλογή των χρηστών (π.χ., ηλικία, γνώσεις) και του πλαισίου-στόχου της δραστηριότητας, να καταγράψετε τις αρχικές προδιαγραφές για την εφαρμογή που θα ετοιμάσετε στη συνέχεια.       Προσχέδιο           Να σχεδιάσετε (σενάριο, οθόνες) μια εφαρμογή που να βασίζεται στις ανθρώπινες ανάγκες που εντοπίσατε στην προηγούμενη ενότητα.            Να σχεδιάσετε ξανά την εφαρμογή σας ώστε να παρέχει: 1) αυτοματισμό για μια συχνή λειτουργία του χρήστη, 2) ανθρωπομορφισμό για την επικοινωνία με τον χρήστη, 3) έξυπνο πράκτορα που αναλαμβάνει να επιτελέσει μια εργασία του χρήστη, 4) επικοινωνία με άλλους χρήστες και ειδικούς της φυσικής άσκησης.            Να προσθέσετε το στοιχείο της μεταφοράς σε κάποιες από τις λειτουργίες ή οντότητες της εφαρμογής σας.            Να σχεδιάσετε μια σκευομορφική εκδοχή της εφαρμογής σας.       Ελάχιστον εφικτό προϊόν           Να επιλέξετε τα εργαλεία που θα σας διευκολύνουν στη δημιουργία της εφαρμογής που περιγράψατε στην προηγούμενη ενότητα. Πριν καταλήξετε σε κάποιο, δοκιμάστε μερικά παρόμοια κάνοντας αλλαγές στα παραδείγματα που δίνουν έτοιμα και διαβάζοντας την τεκμηρίωση και τα σχόλια από άλλους χρήστες.            Να κατασκευάσετε με ένα εργαλείο της επιλογής σας μια αρχική έκδοση (πρωτότυπο υψηλής πιστότητας) της εφαρμογής που σχεδιάσατε στην προηγούμενη ενότητα.       Δοκιμές      Να δώσετε την εφαρμογή σας για αξιολόγηση σε κάποιον άλλο κατασκευαστή που ετοιμάζει μια παρόμοια εφαρμογή και εσείς να αξιολογήσετε τη δική του εφαρμογή.   Παραγωγή, επέκταση, και εμπορική δραστηριότητα           Να προσθέσετε τη δυνατότητα συναλλαγών στην εφαρμογή σας. Για παράδειγμα, ο χρήστης να μπορεί να αγοράσει επιπλέον δυνατότητες.            Να περιγράψετε την οργάνωση και τη λειτουργία μιας επιχείρησης που θα εμπορεύεται την εφαρμογή που σχεδιάσατε.            Να εντοπίσετε στοιχεία της εφαρμογής σας που θα μπορούσαν να ελέγχονται από κάποιον τρίτο, ώστε εσείς να μπορέσετε να έχετε περισσότερο χρόνο για τη βελτίωση των τμημάτων της εφαρμογής σας που είναι πιο σημαντικά.      ","categories": ["making"],
        "tags": ["activity tracker","Quantified Self"],
        "url": "https://mibook.github.io/gr/making/activity-tracker/",
        "teaser":null},{
        "title": "Collaborative System",
        "excerpt":"Συνεργατικό σύστημα   Ανάλυση σχετικών έργων           Να καταγράψετε τις ιδιότητες μερικών (3-4) συνεργατικών εκπαιδευτικών εφαρμογών. Να διαλέξετε είτε εφαρμογές που θεωρείτε ότι είναι σωστά φτιαγμένες είτε κάποιες που θεωρείτε ότι έχουν προβλήματα χρήσης.            Να οργανώσετε τις πληροφορίες που βρήκατε σε ένα πίνακα όπου στις γραμμές να είναι οι εφαρμογές που εντοπίσατε και στις στήλες: 1) ο άνθρωπος, 2) το πλαίσιο χρήσης, 3) ο σκοπός, 4) η διεργασία χρήσης.       Εντοπισμός αναγκών           Να καταγράψετε τις ανάγκες των πιθανών χρηστών και τους στόχους της εφαρμογής σας με βάση τους πίνακες που φτιάξατε προηγουμένως.            Να ενημερώσετε τον πίνακα της προηγούμενης ενότητας ώστε να περιλαμβάνει στήλες με τους κανόνες σχεδίασης που ακολουθεί η κάθε εφαρμογή, και να προσθέσετε και τη δική σας εφαρμογή.            Να ενημερώσετε τις προδιαγραφές της εφαρμογής σας, ώστε να μοιάζει περισσότερο με τις εφαρμογές που πέτυχαν και να αποφεύγει τα λάθη εκείνων που απέτυχαν.            Ανάλογα με την επιλογή των χρηστών (π.χ., ηλικία, γνώσεις) και του πλαισίου-στόχου της δραστηριότητας να καταγράψετε τις αρχικές προδιαγραφές για την εφαρμογή που θα ετοιμάσετε στη συνέχεια.       Προσχέδιο           Να σχεδιάσετε (σενάριο, οθόνες) μια εφαρμογή που να επιτρέπει πλοήγηση σε μια συλλογή από περιεχόμενο.            Να προσθέσετε στην εφαρμογή σας διαφορετικά είδη περιεχομένου (π.χ., γραφικά, κείμενο) καθώς και τη δυνατότητα σύνδεσης μεταξύ τους.       Ελάχιστον εφικτό προϊόν           Να επιλέξετε τα εργαλεία που θα σας διευκολύνουν στη δημιουργία της εφαρμογής που περιγράψατε στην προηγούμενη ενότητα. Πριν καταλήξετε σε κάποιο, δοκιμάστε μερικά παρόμοια κάνοντας αλλαγές στα παραδείγματα που δίνουν έτοιμα και διαβάζοντας την τεκμηρίωση και τα σχόλια από άλλους χρήστες.            Να κατασκευάσετε με ένα εργαλείο της επιλογής σας μια αρχική έκδοση (πρωτότυπο υψηλής πιστότητας) την εφαρμογή που σχεδιάσατε στην προηγούμενη ενότητα.       Δοκιμές           Να δώσετε την εφαρμογή σας για αξιολόγηση σε κάποιον άλλο κατασκευαστή που ετοιμάζει μια παρόμοια εφαρμογή και εσείς να αξιολογήσετε τη δική του εφαρμογή.            Να σχεδιάσετε ξανά την εφαρμογή της προηγούμενης ενότητας ώστε να επιτρέπει τη συμμετοχή τουλάχιστον δύο χρηστών. Να περιγράψετε γιατί επιλέξατε η εφαρμογή να είναι σύγχρονη ή ασύγχρονη και συνεργατική ή ανταγωνιστική.            Να σχεδιάσετε την εφαρμογή από τις προηγούμενες ενότητες με τη συμμετοχή των τελικών χρηστών ως μέλη της ομάδας σας. Ποιες είναι οι διαφορές σε σχέση με την αρχικά σχεδιασμένη εφαρμογή και ποιες είναι οι διαφορές σε σχέση με τα αποτελέσματα της αξιολόγησης με χρήστες;       Παραγωγή, επέκταση, και εμπορική δραστηριότητα           Να προσθέσετε τη δυνατότητα συναλλαγών στην εφαρμογή σας. Για παράδειγμα, ο χρήστης να μπορεί να αγοράσει επιπλέον δυνατότητες.            Να περιγράψετε την οργάνωση και τη λειτουργία μιας επιχείρησης που θα εμπορεύεται την εφαρμογή που σχεδιάσατε.            Να εντοπίσετε στοιχεία της εφαρμογής σας που θα μπορούσαν να ελέγχονται από κάποιον τρίτο, ώστε εσείς να μπορέσετε να έχετε περισσότερο χρόνο για τη βελτίωση των τμημάτων της εφαρμογής σας που είναι πιο σημαντικά.            Να ενημερώσετε την εφαρμογή σας ώστε να επιτρέπει την απευθείας επικοινωνία με άλλους χρήστες, όπως για παράδειγμα με την προσθήκη σχολίου, ψήφου, διαμοιρασμού, κτλ.            Να ενημερώσετε την εφαρμογή σας ώστε να επιτρέπει την συνεργασία άλλων χρηστών, όπως για παράδειγμα με δυνατότητα επεξεργασίας (ετικέτα, υπότιτλοι, αλλαγή ροής, κτλ.).            Να επεκτείνετε την εφαρμογή της προηγούμενης ενότητας ώστε να επιτρέπει τον διαμοιρασμό των αποθηκευμένων εγγραφών με άλλους χρήστες.            Να επεκτείνετε την εφαρμογή σας ώστε να μπορούν τρίτοι να ζητήσουν απευθείας δεδομένα από την εφαρμογή σας.            Να επεκτείνετε την εφαρμογή σας ώστε να επιτρέπει τις αλλαγές βασικών παραμέτρων της από άλλους χρήστες.      ","categories": ["making"],
        "tags": ["collaborative system"],
        "url": "https://mibook.github.io/gr/making/collaboration/",
        "teaser":null},{
        "title": "Media Player",
        "excerpt":"Αναπαραγωγή βίντεο   Ανάλυση σχετικών έργων           Να καταγράψετε τις ιδιότητες μερικών (3-4) εφαρμογών που παίζουν βίντεο ή μουσική, και που είναι ελεύθερα διαθέσιμες στον υπολογιστή σας. Να διαλέξετε είτε εφαρμογές που θεωρείτε ότι είναι σωστά φτιαγμένες είτε κάποιες που θεωρείτε ότι έχουν προβλήματα χρήσης.            Να οργανώσετε τις πληροφορίες που βρήκατε σε ένα πίνακα όπου στις γραμμές να είναι οι εφαρμογές που εντοπίσατε και στις στήλες: 1) ο άνθρωπος, 2) το πλαίσιο χρήσης, 3) ο σκοπός, 4) η διεργασία χρήσης.       Εντοπισμός αναγκών           Να καταγράψετε τις ανάγκες των πιθανών χρηστών και τους στόχους της εφαρμογής σας με βάση τους πίνακες που φτιάξατε προηγουμένως.            Να ενημερώσετε τον πίνακα της προηγούμενης ενότητας ώστε να περιλαμβάνει μία ακόμη στήλη, η οποία να περιγράφει τους λόγους επιτυχίας ή αποτυχίας των αντίστοιχων εφαρμογών.            Να ενημερώσετε τον πίνακα της προηγούμενης ενότητας ώστε να περιλαμβάνει στήλες με τους κανόνες σχεδίασης που ακολουθεί η κάθε εφαρμογή, και να προσθέσετε τη δική σας εφαρμογή.            Να ενημερώσετε τις προδιαγραφές της εφαρμογής σας ώστε να μοιάζει περισσότερο με τις εφαρμογές που πέτυχαν, και να αποφεύγει τα λάθη εκείνων που απέτυχαν.            Ανάλογα με την επιλογή των χρηστών (π.χ., ηλικία, γνώσεις) και του πλαισίου-στόχου της δραστηριότητας, να καταγράψετε τις αρχικές προδιαγραφές για την εφαρμογή που θα ετοιμάσετε στη συνέχεια.       Προσχέδιο           Να σχεδιάσετε (σενάριο, οθόνες) μια εφαρμογή που να βασίζεται στις ανθρώπινες ανάγκες που εντοπίσατε στην προηγούμενη ενότητα.            Δραστηριότητα Να επιλέξετε δύο τουλάχιστον εναλλακτικές συσκευές εισόδου για τη διάδραση με την εφαρμογής σας.            Να σχεδιάσετε διαφορετικούς τρόπους για την έξοδο της εφαρμογής σας.       Ελάχιστον εφικτό προϊόν           Να επιλέξετε τα εργαλεία που θα σας διευκολύνουν στη δημιουργία της εφαρμογής που περιγράψατε στην προηγούμενη ενότητα. Πριν καταλήξετε σε κάποιο, δοκιμάστε μερικά παρόμοια κάνοντας αλλαγές στα παραδείγματα που δίνουν έτοιμα και διαβάζοντας την τεκμηρίωση και τα σχόλια από άλλους χρήστες.            Να επεκτείνετε την εφαρμογή σας ώστε να ελέγχεται από μια νέα συσκευή εισόδου.            Να φτιάξετε την εφαρμογής σας χρησιμοποιώντας τα βασικά δομικά στοιχεία της πλατφόρμας εκτέλεσης. Τι διαφορές έχει σε σχέση με την αρχική σχεδίαση;            Να φτιάξετε ξανά την εφαρμογή σας ώστε να περιέχει στοιχεία σκευομορφισμού.            Να προσθέσετε φυσική διάδραση στην εφαρμογή σας.      ","categories": ["making"],
        "tags": ["media player"],
        "url": "https://mibook.github.io/gr/making/media-player/",
        "teaser":null},{
        "title": "Mobile Notes",
        "excerpt":"Κινητές σημειώσεις   Ανάλυση σχετικών έργων      Να καταγράψετε τις ιδιότητες μερικών (3-4) εφαρμογών που βοηθάνε στην αποθήκευση σημειώσεων (π.χ., κείμενο, φωτογραφία) με αναφορά σε μια γεωγραφική τοποθεσία.   Ελάχιστον εφικτό προϊόν           Να κατασκευάσετε (σχεδίαση, πρωτότυπο, αξιολόγηση) μία εφαρμογή με την οποία μπορείτε να αφήνετε σημειώσεις (π.χ., εικόνα, κείμενο, κτλ.) σε γεωγραφικές τοποθεσίες (π.χ., πού πάρκαρα το αυτοκίνητο, τοποθεσίες που επισκέφτηκα). Η εφαρμογή θα πρέπει να δίνει έμφαση στην καταγραφή της σημείωσης.            Να επεκτείνετε την εφαρμογή της προηγούμενης ενότητας ώστε να παρουσιάζει τις σημειώσεις που έχετε αφήσει πάνω στον γεωγραφικό χάρτη με βάση τον χρόνο ή άλλα κριτήρια που είναι σημαντικά για την εφαρμογή σας.            Να επιλέξετε τα εργαλεία που θα σας διευκολύνουν στη δημιουργία της εφαρμογής που περιγράψατε στην προηγούμενη ενότητα. Πριν καταλήξετε σε κάποιο, δοκιμάστε μερικά παρόμοια κάνοντας αλλαγές στα παραδείγματα που δίνουν έτοιμα και διαβάζοντας την τεκμηρίωση και τα σχόλια από άλλους χρήστες. Να κατασκευάσετε την εφαρμογή που σχεδιάσατε αφού πρώτα συνθέσετε ένα περιβάλλον ανάπτυξης το οποίο ταιριάζει καλύτερα σε αυτόν τον σκοπό.            Να προσαρμόσετε την εφαρμογή σας ώστε να εκτελείται σε διαφορετική τελική συσκευή από αυτή του υπολογιστή ανάπτυξης. Ποιος είναι ο ρόλος της προσομοιώσης αν δεν έχετε διαθέσιμη την τελική συσκευή εκτέλεσης;            Να στήσετε την εφαρμογή σας σε ένα ολοκληρωμένο περιβάλλον ανάπτυξης ή (αν το έχετε κάνει ήδη) να στήσετε την εφαρμογή σας μαζεύοντας μόνοι σας τα απαιτούμενα επιμέρους εργαλεία.       Παραγωγή, επέκταση, και εμπορική δραστηριότητα           Να γράψετε την εφαρμογή σας με μια διαφορετική γλώσσα προγραμματισμού.            Να φτιάξετε την εφαρμογή σας αρχίζοντας από μια κενή σελίδα στο περιβάλλον ανάπτυξης.            Να προσθέσετε τεκμηριώση για το σύστημα που έχετε φτιάξει, έτσι ώστε να είναι κατανοητό από εσάς στο μέλλον αλλά και από άλλους που θα ήθελαν να το μελετήσουν και να το αλλάξουν.            Να δώσετε σε μια άλλη ομάδα να κάνει αλλαγές στην εφαρμογή σας και εσείς να κάνετε αλλαγές στη δική τους. Να δώσετε την εφαρμογή που κατασκευάσατε στην προηγούμενη ενότητα σε κάποιον άλλο και να συνεχίσετε την ανάπτυξη του δικού του έργου. Να μοιραστείτε τμήματα ή ολόκληρο τον κώδικα της εφαρμογής που φτιάξατε στις προηγούμενες ενότητες με προγραμματιστές από άλλες ομάδες και να τους ζητήσετε να κάνουν αλλαγές και επεκτάσεις. Να κάνετε το ίδιο στα δικά τους έργα.            Να ενημερώσετε το σύστημά σας ώστε να παρέχει τη δική του διεπαφή προγραμματισμού.            Να ενημερώσετε την εφαρμογή σας ώστε μία τουλάχιστον λειτουργία της να συνδέεται με άλλες υπάρχουσες δικτυακές εφαρμογές (π.χ., IFTTT, Huginn).            Να ενημερώσετε την εφαρμογή σας έτσι ώστε να βασίζεται, όσο γίνεται περισσότερο, σε διεπαφές προγραμματισμού από υπάρχοντα συστήματα.      ","categories": ["making"],
        "tags": ["mobile notes"],
        "url": "https://mibook.github.io/gr/making/mobile-notes/",
        "teaser":null},{
        "title": "Photography",
        "excerpt":"Φωτογραφία   Ανάλυση σχετικών έργων           Η καταγραφή εικόνων είναι μια πολύ δημοφιλής και καθιερωμένη δραστηριότητα σε πολλά διαφορετικά πεδία (π.χ., προσωπικές αναμνήσεις, δημοσιογραφία, επιστήμη, βιομηχανία, τέχνη, κτλ.). Το σύστημα θα πρέπει να περιγραφεί ως το ανάλογο της φωτογραφίας, όπως παρουσιάστηκε και λειτούργησε εμπορικά από την Kodak (“you press the button we do the rest”) επομένως, εκτός από το πρωτότυπο θα πρέπει να περιλαμβάνει και μια λεπτομερή περιγραφή της συνολικής εμπορικής λειτουργίας του.            Να διαλέξετε είτε εφαρμογές που θεωρείτε ότι είναι σωστά φτιαγμένες είτε που πιστεύετε ότι έχουν προβλήματα χρήσης. Να φτιάξετε έναν πίνακα όπου στις γραμμές να είναι οι διαφορετικές συσκευές/εφαρμογές λήψης φωτογραφίας και στις στήλες: 1) ο άνθρωπος, 2) το πλαίσιο χρήσης, 3) ο σκοπός, 4) η διεργασία χρήσης.       Εντοπισμός αναγκών           Να ενημερώσετε τον πίνακα της προηγούμενης ενότητας ώστε να περιλαμβάνει μία ακόμα στήλη, η οποία να περιγράφει τους λόγους επιτυχίας ή αποτυχίας των σχετικών συσκευών/εφαρμογών.            Να ενημερώσετε τον πίνακα της προηγούμενης ενότητας ώστε να περιλαμβάνει μία ακόμη στήλη με τους κανόνες σχεδίασης που ακολουθεί η κάθε εφαρμογή.            Παρατηρείστε τη διάδραση έμπειρων και άπειρων χρηστών για έναν τομέα που σας ενδιαφέρει. Ποιες είναι διαφορές μεταξύ των κατηγοριών των χρηστών; Πέρα από την εμπειρία στη χρήση ΗΥ, με ποιους άλλους τρόπους μπορούμε να κατηγοριοποιήσουμε τους χρήστες σε ομάδες; Να δώσετε παραδείγματα εφαρμογών όπου διαφορετικές κατηγορίες χρηστών έχουν διαφορετική συμπεριφορά ή/και επιδόσεις.            Ανάλογα με την επιλογή των χρηστών (π.χ., ηλικία, γνώσεις) και του πλαισίου-στόχου της δραστηριότητας (π.χ., εργασία, ψυχαγωγία) να επιλέξετε τις κατάλληλες τεχνικές συλλογής αναγκών και να ετοιμάσετε τις αρχικές προδιαγραφές για την εφαρμογή που θα ετοιμάσετε στη συνέχεια.       Προσχέδιο      Να σχεδιάσετε (σενάριο, οθόνες) μία εφαρμογή που να βασίζεται στις ανθρώπινες ανάγκες που εντοπίσατε στην προηγούμενη ενότητα.   Ελάχιστον εφικτό προϊόν      Να κατασκευάσετε σε υψηλή πιστότητα την εφαρμογή που σχεδιάσατε στην προηγούμενη ενότητα. Πόσο μοιάζει με αυτό που είχατε αρχικά σχεδιάσει και αν (δεν) υπάρχουν διαφορές ποιες είναι οι αιτίες;   Δοκιμές      Να αξιολογήσετε, με τουλάχιστον δύο τεχνικές και την συμμετοχή χρηστών, την εφαρμογή που κατασκευάσατε στην προηγούμενη ενότητα.   Παραγωγή, επέκταση, και εμπορική δραστηριότητα      Να επεκτείνετε την εφαρμογή αυτού του κεφαλαίου ώστε να επιτρέπει τη συνεργασία ή/και επικοινωνία μεταξύ διαφορετικών χρηστών της εφαρμογής.  ","categories": ["making"],
        "tags": ["Photography"],
        "url": "https://mibook.github.io/gr/making/photography/",
        "teaser":null},{
        "title": "Remote Control",
        "excerpt":"Τηλεχειρισμός   Ανάλυση σχετικών έργων           Να καταγράψετε τις ιδιότητες μερικών (3-4) εφαρμογών που είναι ελεύθερα διαθέσιμες στον υπολογιστή, για τον τηλεχειρισμό που είναι μια πολύ δημοφιλής και καθιερωμένη δραστηριότητα σε πολλά διαφορετικά πεδία, π.χ., τηλεόραση, κλιματισμός-θέρμανση, βιομηχανία.            Να διαλέξετε είτε εφαρμογές που θεωρείτε ότι είναι σωστά φτιαγμένες είτε που πιστεύετε ότι έχουν προβλήματα χρήσης. Να φτιάξετε έναν πίνακα όπου στις γραμμές να είναι οι διαφορετικές συσκευές τηλεχειρισμού και στις στήλες: 1) ο άνθρωπος, 2) το πλαίσιο χρήσης, 3) ο σκοπός, 4) η διεργασία χρήσης.       Εντοπισμός αναγκών           Να ενημερώσετε τον πίνακα της προηγούμενης ενότητας ώστε να περιλαμβάνει μία ακόμα στήλη, η οποία να περιγράφει τους λόγους επιτυχίας ή αποτυχίας των συσκευών τηλεχειρισμού.            Να ενημερώσετε τον πίνακα της προηγούμενης ενότητας ώστε να περιλαμβάνει μία ακόμη στήλη με τους κανόνες σχεδίασης που ακολουθεί η κάθε εφαρμογή.            Παρατηρείστε τη διάδραση έμπειρων και άπειρων χρηστών για έναν τομέα που σας ενδιαφέρει. Ποιες είναι διαφορές μεταξύ των κατηγοριών των χρηστών; Πέρα από την εμπειρία στη χρήση ΗΥ, με ποιους άλλους τρόπους μπορούμε να κατηγοριοποιήσουμε τους χρήστες σε ομάδες; Να δώσετε παραδείγματα εφαρμογών όπου διαφορετικές κατηγορίες χρηστών έχουν διαφορετική συμπεριφορά ή/και επιδόσεις.            Ανάλογα με την επιλογή των χρηστών (π.χ., ηλικία, γνώσεις) και του πλαισίου-στόχου της δραστηριότητας (π.χ., εργασία, ψυχαγωγία) να επιλέξετε τις κατάλληλες τεχνικές συλλογής αναγκών και να ετοιμάσετε τις αρχικές προδιαγραφές για την εφαρμογή που θα ετοιμάσετε στη συνέχεια.       Προσχέδιο      Να σχεδιάσετε (σενάριο, οθόνες) μία εφαρμογή που να βασίζεται στις ανθρώπινες ανάγκες που εντοπίσατε στην προηγούμενη ενότητα.   Ελάχιστον εφικτό προϊόν      Να κατασκευάσετε σε υψηλή πιστότητα την εφαρμογή που σχεδιάσατε στην προηγούμενη ενότητα. Πόσο μοιάζει με αυτό που είχατε αρχικά σχεδιάσει και αν (δεν) υπάρχουν διαφορές ποιες είναι οι αιτίες;   Δοκιμές      Να αξιολογήσετε, με τουλάχιστον δύο τεχνικές και την συμμετοχή χρηστών, την εφαρμογή που κατασκευάσατε στην προηγούμενη ενότητα.   Παραγωγή, επέκταση, και εμπορική δραστηριότητα      Να επεκτείνετε την εφαρμογή αυτού του κεφαλαίου ώστε να επιτρέπει τη συνεργασία ή/και επικοινωνία μεταξύ διαφορετικών χρηστών της εφαρμογής.  ","categories": ["making"],
        "tags": ["tv remote"],
        "url": "https://mibook.github.io/gr/making/remote-control/",
        "teaser":null},{
        "title": "Video Game",
        "excerpt":"Εκπαιδευτικό βίντεο-παιχνίδι   Ανάλυση σχετικών έργων           Να καταγράψετε τις ιδιότητες μερικών (3-4) βίντεο-παιχνιδιών που είναι ελεύθερα διαθέσιμα στον υπολογιστή σας, και που βοηθάνε στην εκμάθηση των μαθηματικών (ή κάποιου άλλου μαθήματος της δευτεροβάθμιας εκπαίδευσης). Να διαλέξετε είτε εφαρμογές που θεωρείτε ότι είναι σωστά φτιαγμένες είτε που πιστεύετε ότι έχουν προβλήματα χρήσης.            Να οργανώσετε τις πληροφορίες που βρήκατε σε ένα πίνακα όπου στις γραμμές να είναι οι εφαρμογές που εντοπίσατε και στις στήλες: 1) το προφίλ ενός τυπικού χρήστη (π.χ., ηλικία, γνώσεις, δεξιότητες), 2) το πλαίσιο χρήσης (π.χ., σχολείο, σπίτι, μάθημα), 3) ο σκοπός (π.χ., εκμάθηση πρόσθεσης στα μαθηματικά), 4) η διεργασία χρήσης.       Εντοπισμός αναγκών           Να καταγράψετε τις ανάγκες των πιθανών χρηστών και τους στόχους της εφαρμογής σας με βάση τους πίνακες που φτιάξατε προηγουμένως.            Να ενημερώσετε τον πίνακα της προηγούμενης ενότητας ώστε να περιλαμβάνει μία ακόμη στήλη, η οποία να περιγράφει τους λόγους επιτυχίας ή αποτυχίας των αντίστοιχων εφαρμογών.            Να ενημερώσετε τον πίνακα της προηγούμενης ενότητας ώστε να περιλαμβάνει μία ακόμη στήλη με τους κανόνες σχεδίασης που ακολουθεί η κάθε εφαρμογή, και να προσθέσετε τη δική σας εφαρμογή.            Να ενημερώσετε τις προδιαγραφές της εφαρμογής σας ώστε να μοιάζει περισσότερο με τις εφαρμογές που πέτυχαν, και να αποφεύγει τα λάθη εκείνων που απέτυχαν.            Ανάλογα με την επιλογή των χρηστών (π.χ., ηλικία, γνώσεις) και του πλαισίου-στόχου της δραστηριότητας, να καταγράψετε τις αρχικές προδιαγραφές για την εφαρμογή που θα ετοιμάσετε στη συνέχεια.       Προσχέδιο           Να σχεδιάσετε (σενάριο, οθόνες) μια εφαρμογή που να βασίζεται στις ανθρώπινες ανάγκες που εντοπίσατε στην προηγούμενη ενότητα.            Να ανασχεδιάσετε σε χαμηλή πιστότητα (σενάριο, ενδεικτικές οθόνες) την εφαρμογή της προηγούμενης ενότητας, η οποία θα βασίζεται στους μηχανισμούς διάδρασης ενός κλασικού βιντεο-παχνιδιού (π.χ., pacman, mario, snake, asteroids, κτλ.).            Να δείξετε και να εξηγήσετε τα σχέδια σας σε μέλη άλλων ομάδων καθώς και σε τυπικούς χρήστες. Να καταγράψετε τα σχόλια τους.            Πως αλλάζουν οι προδιαγραφές που έχετε καθορίσει στην προηγούμενη ενότητα?       Ελάχιστον εφικτό προϊόν           Να επιλέξετε τα εργαλεία που θα σας διευκολύνουν στη δημιουργία της εφαρμογής που περιγράψατε στην προηγούμενη ενότητα. Πριν καταλήξετε σε κάποιο, δοκιμάστε μερικά παρόμοια κάνοντας αλλαγές στα παραδείγματα που δίνουν έτοιμα και διαβάζοντας την τεκμηρίωση και τα σχόλια από άλλους χρήστες.            Για ένα γρήγορο αποτέλεσμα ή αν δεν έχετε γνώσεις προγραμματισμού μπορείτε να ξεκινήσετε από το εργαλείο Scratch και την συλλογή κλασικών βίντεο-παιχνιδιών.            Να κατασκευάσετε με ένα εργαλείο της επιλογής σας μια αρχική έκδοση (πρωτότυπο υψηλής πιστότητας) την εφαρμογή που σχεδιάσατε στην προηγούμενη ενότητα.       Δοκιμές           Να δώσετε την εφαρμογή σας για αξιολόγηση σε κάποιον άλλο κατασκευαστή που ετοιμάζει μια παρόμοια εφαρμογή, και εσείς να αξιολογήσετε τη δική του εφαρμογή.            Να σχεδιάσετε ξανά την εφαρμογή της προηγούμενης ενότητας ώστε να επιτρέπει τη συμμετοχή τουλάχιστον δύο χρηστών. Να περιγράψετε γιατί επιλέξατε η εφαρμογή σας να είναι σύγχρονη ή ασύγχρονη και συνεργατική ή ανταγωνιστική.       Παραγωγή, επέκταση, και εμπορική δραστηριότητα           Να προσθέσετε τη δυνατότητα συναλλαγών στην εφαρμογή σας. Για παράδειγμα, ο χρήστης να μπορεί να αγοράσει επιπλέον δυνατότητες.            Να περιγράψετε την οργάνωση και τη λειτουργία μιας επιχείρησης που θα εμπορεύεται την εφαρμογή που σχεδιάσατε.            Να εντοπίσετε στοιχεία της εφαρμογής σας που θα μπορούσαν να ελέγχονται από κάποιον τρίτο, έτσι ώστε εσείς να μπορέσετε να έχετε περισσότερο χρόνο για τη βελτίωση των τμημάτων της εφαρμογής σας που είναι πιο σημαντικά.      ","categories": ["making"],
        "tags": ["video game"],
        "url": "https://mibook.github.io/gr/making/video-game/",
        "teaser":null},{
        "title": "noble-book",
        "excerpt":"Τέλος, το βιβλίο του Noble (2012) είναι περισσότερο όμοιο με αυτό το βιβλίο από τα άλλα, καθώς είναι πολύ προσβάσιμο και δίνει έμφαση στην οπτικοποίηση σε οθόνες αλλά και σε άλλες διάχυτες συσκευές χρήστη. Ταυτόχρονα όμως, το βιβλίο του Noble απευθύνεται σε σχεδιαστές και καλλιτέχνες που δεν έχουν καμία γνώση προγραμματισμού, επομένως, ένα μεγάλο μέρος του βιβλίου απλά επαναλαμβάνει γνώσεις που είτε είναι γνωστές στους περισσότερους αναγνώστες της τριτοβάθμιας εκπαίδευσης είτε είναι ελεύθερα διαθέσιμες στις ιστοσελίδες των εργαλείων που χρησιμοποιεί.  ","categories": ["notes","book","review"],
        "tags": ["noble","programming"],
        "url": "https://mibook.github.io/gr/notes/noble-book/",
        "teaser":null},{
        "title": "olsen-book",
        "excerpt":"Το βιβλίο του Olsen (2009) περιγράφει κυρίως τις γραφικές διεπαφές του επιτραπέζιου ΗΥ, πολλές από τις οποίες έχουν και εφαρμογή σε φορητές συσκευές ή σε μεγάλες οθόνες δωματίου. Παρόλα αυτά, το βιβλίο απευθύνεται κυρίως στον προγραμματιστή που θα υλοποιήσει μια διεπαφή σε εμπορικό περιβάλλον, καθώς δίνει μεγάλη έμφαση στις λεπτομέρειες και στις τεχνικές των αντίστοιχων αλγορίθμων. Άρα, το βιβλίο του Olsen είναι ιδανικό για κάποιον προχωρημένο προγραμματιστή που έχει ειδικό ενδιαφέρον για τις γραφικές διεπαφές σε εμπορικό περιβάλλον, και μάλλον είναι το ιδανικό βιβλίο για να διαβάσει κάποιος αφού τελειώσει το παρόν βιβλίο.  ","categories": ["notes","book","review"],
        "tags": ["olsen","programming"],
        "url": "https://mibook.github.io/gr/notes/olsen-book/",
        "teaser":null},{
        "title": "thimbleby-book",
        "excerpt":"Το βιβλίο του Thimbleby (2007) είναι περισσότερο προσβάσιμο και δεν έχει υψηλές απαιτήσεις αναφορικά με προηγούμενες γνώσεις, ταυτόχρονα όμως ο τρόπος που έχει γραφτεί το καθιστά πολύ ακαδημαϊκό. Για παράδειγμα, ο συγγραφέας ορίζει ένα νέο συμβολικό πεδίο αναπαράστασης του προγραμματισμού της διάδρασης το οποίο είναι μεν πολύ δυνατό, στην πράξη όμως απαιτεί εξοικείωση που θα κοστίσει πολύτιμο χρόνο στους περισσότερους αναγνώστες που δεν έχουν μπροστά τους ένα ανέμελο εξάμηνο σπουδών. Άρα, είναι ένα ιδανικό βιβλίο για κάποιον που θέλει να προχωρήσει σε περισσότερο ερευνητικές παρά πρακτικές κατευθύνσεις, καθώς και για κάποιον που θέλει και έχει χρόνο να εξερευνήσει σε βάθος τη θεωρία της διάδρασης.  ","categories": ["notes","book","review"],
        "tags": ["thimbleby","programming"],
        "url": "https://mibook.github.io/gr/notes/thimbleby-book/",
        "teaser":null},{
        "title": "aristotle-learning",
        "excerpt":" ","categories": ["method"],
        "tags": ["Aristotle"],
        "url": "https://mibook.github.io/gr/quotes/aristotle-learning/",
        "teaser":null},{
        "title": "booch-complexity",
        "excerpt":" ","categories": ["method"],
        "tags": ["Grady Booch"],
        "url": "https://mibook.github.io/gr/quotes/booch-complexity/",
        "teaser":null},{
        "title": "buxton-method",
        "excerpt":" ","categories": ["method"],
        "tags": ["Bill Buxton"],
        "url": "https://mibook.github.io/gr/quotes/buxton-method/",
        "teaser":null},{
        "title": "comte-opinion",
        "excerpt":" ","categories": ["definition"],
        "tags": ["Auguste Comte","history","culture"],
        "url": "https://mibook.github.io/gr/quotes/comte-opinion/",
        "teaser":null},{
        "title": "confucius-learning",
        "excerpt":" ","categories": ["method"],
        "tags": ["Confucius"],
        "url": "https://mibook.github.io/gr/quotes/confucius-learning/",
        "teaser":null},{
        "title": "dyson-models",
        "excerpt":" ","categories": ["models"],
        "tags": ["Freeman Dyson"],
        "url": "https://mibook.github.io/gr/quotes/dyson-models/",
        "teaser":null},{
        "title": "einstein-explain",
        "excerpt":" ","categories": ["method"],
        "tags": ["Albert Einstein"],
        "url": "https://mibook.github.io/gr/quotes/einstein-explain/",
        "teaser":null},{
        "title": "exupery-perfection",
        "excerpt":" ","categories": ["method"],
        "tags": ["Antoine de Saint-Exupery"],
        "url": "https://mibook.github.io/gr/quotes/exupery-perfection/",
        "teaser":null},{
        "title": "faynman-understand",
        "excerpt":" ","categories": ["preface"],
        "tags": ["Feynman"],
        "url": "https://mibook.github.io/gr/quotes/feynman-understand/",
        "teaser":null},{
        "title": "gale-design",
        "excerpt":" ","categories": ["method"],
        "tags": ["Thomas C. Gale"],
        "url": "https://mibook.github.io/gr/quotes/gale-design/",
        "teaser":null},{
        "title": "garrett-undestanding",
        "excerpt":" ","categories": ["definition"],
        "tags": ["Jesse James Garrett"],
        "url": "https://mibook.github.io/gr/quotes/garrett-understanding/",
        "teaser":null},{
        "title": "hoare-deficiencies",
        "excerpt":" ","categories": ["method"],
        "tags": ["C.A.R. Hoare"],
        "url": "https://mibook.github.io/gr/quotes/hoare-deficiencies/",
        "teaser":null},{
        "title": "jobs-focusgroups",
        "excerpt":" ","categories": ["method"],
        "tags": ["Steve Jobs"],
        "url": "https://mibook.github.io/gr/quotes/jobs-focusgroups/",
        "teaser":null},{
        "title": "kay-archetypes",
        "excerpt":" ","categories": ["archetypes"],
        "tags": ["Alan Kay"],
        "url": "https://mibook.github.io/gr/quotes/kay-archetypes/",
        "teaser":null},{
        "title": "kay-cs",
        "excerpt":" ","categories": ["synthesis"],
        "tags": ["computer science","technology","Alan Kay"],
        "url": "https://mibook.github.io/gr/quotes/kay-cs/",
        "teaser":null},{
        "title": "kay-hardware",
        "excerpt":" ","categories": ["tools"],
        "tags": ["Alan Kay"],
        "url": "https://mibook.github.io/gr/quotes/kay-hardware/",
        "teaser":null},{
        "title": "kay-invent",
        "excerpt":" ","categories": ["definition","method"],
        "tags": ["Alan Kay","invention"],
        "url": "https://mibook.github.io/gr/quotes/kay-invent/",
        "teaser":null},{
        "title": "kay-perspective",
        "excerpt":" ","categories": ["definition","models"],
        "tags": ["Alan Kay"],
        "url": "https://mibook.github.io/gr/quotes/kay-perspective/",
        "teaser":null},{
        "title": "kay-technology",
        "excerpt":" ","categories": ["tools","archetypes"],
        "tags": ["generation","technology","Alan Kay"],
        "url": "https://mibook.github.io/gr/quotes/kay-technology/",
        "teaser":null},{
        "title": "knuth-contrast",
        "excerpt":" ","categories": ["definition"],
        "tags": ["Knuth"],
        "url": "https://mibook.github.io/gr/quotes/knuth-contrast/",
        "teaser":null},{
        "title": "knuth-design",
        "excerpt":" ","categories": ["method"],
        "tags": ["Knuth"],
        "url": "https://mibook.github.io/gr/quotes/knuth-design/",
        "teaser":null},{
        "title": "lanier-instrument",
        "excerpt":" ","categories": ["preface"],
        "tags": ["Jaron Lanier"],
        "url": "https://mibook.github.io/gr/quotes/lanier-instrument/",
        "teaser":null},{
        "title": "licklider-augmentation",
        "excerpt":" ","categories": ["synthesis"],
        "tags": ["J. C. R. Licklider"],
        "url": "https://mibook.github.io/gr/quotes/licklider-augmentation/",
        "teaser":null},{
        "title": "minksy-technology",
        "excerpt":" ","categories": ["technology"],
        "tags": ["Marvin Minsky"],
        "url": "https://mibook.github.io/gr/quotes/minsky-technology/",
        "teaser":null},{
        "title": "norman-design",
        "excerpt":" ","categories": ["method"],
        "tags": ["Don Norman"],
        "url": "https://mibook.github.io/gr/quotes/norman-design/",
        "teaser":null},{
        "title": "norman-experience",
        "excerpt":" ","categories": ["method"],
        "tags": ["Don Norman"],
        "url": "https://mibook.github.io/gr/quotes/norman-experience/",
        "teaser":null},{
        "title": "norman-goodvsbad-design",
        "excerpt":" ","categories": ["definition"],
        "tags": ["Don Norman"],
        "url": "https://mibook.github.io/gr/quotes/norman-goodvsbad-design/",
        "teaser":null},{
        "title": "picasso-do",
        "excerpt":" ","categories": ["preface"],
        "tags": ["picasso"],
        "url": "https://mibook.github.io/gr/quotes/picasso-do/",
        "teaser":null},{
        "title": "picasso-steal",
        "excerpt":" ","categories": ["archetypes","synthesis"],
        "tags": ["picasso"],
        "url": "https://mibook.github.io/gr/quotes/picasso-steal/",
        "teaser":null},{
        "title": "rand-design-familiarity",
        "excerpt":" ","categories": ["archetypes"],
        "tags": ["Paul Rand"],
        "url": "https://mibook.github.io/gr/quotes/rand-design-familiarity/",
        "teaser":null},{
        "title": "rosenberg-tools",
        "excerpt":" ","categories": ["tools"],
        "tags": ["Scott Rosenberg"],
        "url": "https://mibook.github.io/gr/quotes/rosenberg-tools/",
        "teaser":null},{
        "title": "stroustrup-wish",
        "excerpt":" ","categories": ["definition","archetypes"],
        "tags": ["Bjarne Stroustrup"],
        "url": "https://mibook.github.io/gr/quotes/stroustrup-wish/",
        "teaser":null},{
        "title": "sutherland-immersion",
        "excerpt":" ","categories": ["Method"],
        "tags": ["graphics","Ivan Sutherland"],
        "url": "https://mibook.github.io/gr/quotes/sutherland-immersion/",
        "teaser":null},{
        "title": "victor-definition",
        "excerpt":" ","categories": ["definition"],
        "tags": ["Bret Victor"],
        "url": "https://mibook.github.io/gr/quotes/victor-definition/",
        "teaser":null},{
        "title": "weiser-forms",
        "excerpt":" ","categories": ["forms"],
        "tags": ["Mark Weiser"],
        "url": "https://mibook.github.io/gr/quotes/weiser-forms/",
        "teaser":null},{
        "title": "Audio player",
        "excerpt":"Διαδραστικό παράδειγμα κώδικα που αναπαριστά ένα απλό σύστημα αναπαραγωγής ήχου. Κατά την επιλογή του κεντρικού εικονιδίου ξεκινάει η αναπαραγωγή του αρχείου ήχου. Για να γίνει αντιληπτό το αποτέλεσμα του παραδείγματος είναι απαραίτητη η χρήση ηχείων εξόδου.   See the Pen SoundCloud Mini player with css record animation by sckarolos (@sckarolos) on CodePen.    Ασκηση: Τροποποιήστε τον κώδικα αλλάζοντας το υπάρχον αρχείο αναπαραγωγής με ένα άλλο της επιλογής σας. Κάντε το ίδιο για την αντίστοιχη εικόνα του παραδείγματος.  ","categories": ["forms"],
        "tags": ["audio","player"],
        "url": "https://mibook.github.io/gr/remix/audio-player/",
        "teaser":null},{
        "title": "Button",
        "excerpt":"Διαδραστικό παράδειγμα κώδικα που δημιουργεί ένα κουμπί που εκτελέι διαφορετικές λειτουργίες κατά το Hover (κίνηση του ποντικιού πάνω από την εικόνα στο συγκεκριμένο παράδειγμα) και κατά την επιλογή του (Κλικ στο εικονίδιο). Για την λειτουργία της εμφάνισης διαφορετικού μηνύματος μετά από την επιλογή του εικονιδίου χρησιμοποιείται ένα απλοϊκό script σε κώδικα CoffeeScript. Η CoffeeScript είναι μια γλώσα προγραμματισμού που έπειτα μεταγλωτίζεται σε Javascript (http://coffeescript.org/), (https://en.wikipedia.org/wiki/CoffeeScript).   See the Pen Button Concept by sckarolos (@sckarolos) on CodePen.    Ασκηση: Επεκτείνετε τον κώδικα του παραδείγματος έτσι ώστε κατά την επιλογή του κουμπιού (κλικ), να εφαρμόζεται μια λειτουργία της επιλογής σας.  ","categories": ["definition","easy"],
        "tags": ["button"],
        "url": "https://mibook.github.io/gr/remix/button/",
        "teaser":null},{
        "title": "Calculator",
        "excerpt":"Παράδειγμα οπτικής και λειτουργικής εξομοίωσης αριθμομηχανής.   See the Pen Apple's Calculator fork by sckarolos (@sckarolos) on CodePen.    Άσκηση 1: Τροποποιήστε το παράδειγμα έτσι ώστε κάθε φορά που επιλέγεται το σύμβολο/τελεστής “=” να τυπώνεται το αποτέλεσμα σε όποιο μέρος της σελίδας επιθυμείτε. Το επόμενο αποτέλεσμα πρέπει να τυπώνεται σε νέα σειρά.  ","categories": ["models"],
        "tags": ["calculator"],
        "url": "https://mibook.github.io/gr/remix/calculator/",
        "teaser":null},{
        "title": "Camera motion color",
        "excerpt":"Διαδραστικό παράδειγμα κώδικα με χρήση κάμερας. Στο παράδειγμα υπάρχει ένα πλαίσιο πράσινου χρώματος . Όταν εντοπιστεί κίνηση μέσα στο πλαίσιο αλλάζει το χρώμα του background της σελίδας. Για να γίνει αντιληπτό το αποτέλεσμα του παραδείγματος είναι απαραίτητη η χρήση Web κάμερας.   See the Pen Motion Detection with Javascript Canvas by sckarolos (@sckarolos) on CodePen.    Ασκηση: Τροποποιήστε τον κώδικα έτσι ώστε όταν εντοπίζεται κίνηση, το χρώμα του background να αλλάζει σε ένα συγκεκριμένο της επιλογής σας.  ","categories": ["forms"],
        "tags": ["camera","motion","color"],
        "url": "https://mibook.github.io/gr/remix/camera-color/",
        "teaser":null},{
        "title": "Camera filter",
        "excerpt":"Διαδραστικό παράδειγμα κώδικα Processing. Το παράδειγμα χρησιμοποιεί ως είσοδο κάμερα και εφαρμόζει διαδραστικό πλέγμα/φίλτρο που λειτουργεί και ως έξοδος των όσως καταγράφει η κάμερα. Για να γίνει αντιληπτό το αποτέλεσμα του παραδείγματος είναι απαραίτητη η χρήση Web κάμερας.     Ασκηση: Ταυτόχρονα με την καταγραφή δεδομένων μέσω της κάμερας, πειραματιστείτε διαδρώντας με το πλέγμα χρησιμοποιώντας το ποντίκι. Ποια είναι τα σχόλιά σας;  ","categories": ["forms"],
        "tags": ["camera","filter"],
        "url": "https://mibook.github.io/gr/remix/camera-filter/",
        "teaser":null},{
        "title": "Camera motion",
        "excerpt":"Διαδραστικό παράδειγμα κώδικα με χρήση κάμερας. Στο παράδειγμα υπάρχει δύο διαφορετικά πλαίσια (πράσινο και κόκκινο). Όταν εντοπιστεί κίνηση σε κάποιο πλαίσιο εμφανίζεται το αντίστοιχο μήνυμα. Για να γίνει αντιληπτό το αποτέλεσμα του παραδείγματος είναι απαραίτητη η χρήση Web κάμερας.   See the Pen Motion Detection by sckarolos (@sckarolos) on CodePen.    Ασκηση: Τροποποιήστε τον κώδικα έτσι ώστε όταν εντοπίζεται κίνηση και στα δύο πλαίσια ταυτόχρονα να εμφανίζεται ένα νέο μήνυμα χωρίς να γίνει εμφάνιση των προηγούμενων.  ","categories": ["forms"],
        "tags": ["camera","motion"],
        "url": "https://mibook.github.io/gr/remix/camera-motion/",
        "teaser":null},{
        "title": "Clock",
        "excerpt":"Παράδειγμα διαδραστικού ρολογιού   Διαδραστικό παράδειγμα κώδικα Processing λειτουργικής εξομοίωσης ρολογιού.     Άσκηση: Τροποποιήστε το παράδειγμα έτσι ώστε ανάλογα με την κίνηση των δεικτών του ρολογιού να τυπώνεται η ώρα σε ψηφιακή μορφή. Μπορείτε να χρησιμοποιήσετε ως βοήθεια κάποιο από τα παραδείγματα:   http://www.openprocessing.org/search/?q=digital+clock  ","categories": ["models","easy"],
        "tags": ["processing","clock"],
        "url": "https://mibook.github.io/gr/remix/clock-processing/",
        "teaser":null},{
        "title": "CSS queries",
        "excerpt":"Παράδειγμα κώδικα με σκοπό να γίνει κατανοητή η χρήση των CSS media queries. Αλλάζοντας το μέγεθος του παραθύρου του περιηγητή (browser) σας αλλάζει το χρώμα της επιφάνειας του παραδείγματος.   See the Pen media queries example by sckarolos (@sckarolos) on CodePen.    Άσκηση: Πειραματιστείτε με το παράδειγμα προσθέτοντας περισσότερα CSS media queries και αλλάζοντας το χρώμα του παραθούρου. Στη συνέχεια δοκιμάστε να εφαρμόσετε CSS media queries στο μέγεθος της γραμματοσειράς ώστε να απεικονίζεται σωστά σε όλα τα μεγέθη παραθύρων.  ","categories": ["method"],
        "tags": ["css","queries"],
        "url": "https://mibook.github.io/gr/remix/css-queries/",
        "teaser":null},{
        "title": "Google maps",
        "excerpt":"Έυρεση τοποθεσίας χρήστη χρησιμοποιώντας το Google Maps API (https://developers.google.com/maps/?hl=en).   See the Pen google maps user's Geolocation by sckarolos (@sckarolos) on CodePen.    Άσκηση: Τροποποιήστε το παράδειγμα δημιουργώντας/οπτικοποιώντας χρωμματική περίμετρο γύρω από το σημείο εντοπισμού.  ","categories": ["models"],
        "tags": ["google","map"],
        "url": "https://mibook.github.io/gr/remix/google-map/",
        "teaser":null},{
        "title": "3D image",
        "excerpt":"Διαδραστικό παράδειγμα εικόνων χρησιμοποιώντας την τεχνική parallax. Στο συγκεκριμένο παράδειγμα η τεχνική αυτή δημιουργεί την αίσθηση του 3d περιβαλλντος. Ο χρήστης μπορεί να περιηγηθεί στη σύνθεση χρησιμοποιώντας το ποντίκι.   See the Pen GTA 5 CSS3 Parallax by sckarolos (@sckarolos) on CodePen.    Άσκηση 1: Τροποποιήστε το παράδειγμα αλλάζοντας τις υπάρχουσες εικόνες, δημιουργώντας τη δική σας θεματική σύνθεση.  ","categories": ["synthesis"],
        "tags": ["3d","image"],
        "url": "https://mibook.github.io/gr/remix/image-3d/",
        "teaser":null},{
        "title": "Image processing",
        "excerpt":"Παράδειγμα διαδραστικού κώδικα στον οποίο όταν εκτελείται από το χρήστη η λειτουργία hover (κίνηση του ποντικιού πάνω από την εικόνα στο συγκεκριμένο παράδειγμα) εφαρμόζεται το φίλτρο του αποχρωματισμού της εικόνας.   See the Pen image filter 1 by sckarolos (@sckarolos) on CodePen.    Άσκηση: Τροποποιήστε το παράδειγμα χρησιμοποιώντας φίλτρα εικόνας και συνδυασμούς αυτών. Παραδείγματα φίλτρων βρίσκονται ως σχόλια στην ενότητα με τον CSS κώδικα του παραδείγματος.  ","categories": ["models","easy"],
        "tags": ["image","filter"],
        "url": "https://mibook.github.io/gr/remix/image-filter/",
        "teaser":null},{
        "title": "Image zoom",
        "excerpt":"Παράδειγμα διαδραστικού κώδικα στον οποίο όταν εκτελείται από το χρήστη η λειτουργία hover (κίνηση του ποντικιού πάνω από την εικόνα στο συγκεκριμένο παράδειγμα) μεγενθύνεται η εικόνα (zoom) χωρίς να αλλάζουν οι διαστάσεις του πλαισίου .   See the Pen Background Image zoom by sckarolos (@sckarolos) on CodePen.    Άσκηση: Τροποποιήστε το παράδειγμα χρησιμοποιώντας φίλτρα εικόνας από το προηγούμενο παράδειγμα. Συνδυάστε τα φίλτρα εικόνας και τη χρήση zoom κατά τη λειτουργία hover (κίνηση του ποντικιού πάνω από την εικόνα).  ","categories": ["models","average"],
        "tags": ["image","zoom"],
        "url": "https://mibook.github.io/gr/remix/image-zoom/",
        "teaser":null},{
        "title": "Image",
        "excerpt":"Διαδραστικό παράδειγμα κώδικα που εισάγει μια εικόνα τύπου SVG (https://en.wikipedia.org/wiki/Scalable_Vector_Graphics). Όταν εκτελείται από το χρήστη η λειτουργία hover (κίνηση του ποντικιού πάνω από την εικόνα στο συγκεκριμένο παράδειγμα) η εικόνα αλλάζει χρώμα.   See the Pen SVG Shape Example by sckarolos (@sckarolos) on CodePen.    Ασκηση: Κατανοήστε τον τρόπο λειτουργίας των εικόνων τύπου SVG και στη συνέχεια τροποποιείστε το παράδειγμα δημιουργώντας δίπλα στην υπάρχουσα εικόνα, μια ίδια (που να εκτελεί την ίδια λειτουργία) του μισού μεγέθους.  ","categories": ["definition"],
        "tags": ["image"],
        "url": "https://mibook.github.io/gr/remix/image/",
        "teaser":null},{
        "title": "Interactive Text",
        "excerpt":"Διαδραστικό παράδειγμα κώδικα που δημιουργεί ειδικά εφέ κατά το Hover (κίνηση του ποντικιού πάνω από την εικόνα) πάνω στο κείμενο. Για τη δημιουργία αυτών των εφέ δε γίνεται χρήση Javascript, αλλά χρησιμοποιείται ο CSS preprocessor SCSS.   See the Pen 10 stunning hover effects with scss by sckarolos (@sckarolos) on CodePen.    Ασκηση: Απομονώστε το εφέ της επιλογής σας και χρησιμοποιείστε το σε κείμενο της επιλογής σας σε μια νέα html σελίδα.  ","categories": ["definition"],
        "tags": ["button","text"],
        "url": "https://mibook.github.io/gr/remix/interactive-text/",
        "teaser":null},{
        "title": "Keyboard input",
        "excerpt":"Μετακίνηση αντικειμένου μέσω πληκτρολογίου (html Canvas)   See the Pen html canvas game by sckarolos (@sckarolos) on CodePen.    Άσκηση 1: Τροποποιήστε το παράδειγμα έτσι ώστε όταν το αυτοκίνητο κινείται όπισθεν να έχει μικρότερη (τη μισή) ταχύτητα από το όταν κινείται έμπροσθεν.   Άσκηση 2: Δημιουργείστε περιμετρικά όρια  έτσι ώστε το αυτοκίνητο να μη βγαίνει ποτέ έξω από την πίστα.  ","categories": ["synthesis"],
        "tags": ["keyboard","input"],
        "url": "https://mibook.github.io/gr/remix/keyboard-input/",
        "teaser":null},{
        "title": "Lighting",
        "excerpt":"Διαδραστικό παράδειγμα κώδικα Processing που δημιουργεί φωτισμό (Directional light) σε μια σφαίρα. Ο φωτισμός μεταβάλλεται με την κίνηση του ποντικιού.     Άσκηση: Πειραματιστείτε με τον κώδικα του παραδείγματος αλλάζοντας το χρώμα και τη γωνία πτώσης του φωτός στη σφαίρα.  ","categories": ["synthesis"],
        "tags": ["lighting","processing"],
        "url": "https://mibook.github.io/gr/remix/lighting/",
        "teaser":null},{
        "title": "Maps location",
        "excerpt":"Εύρεση τοποθεσίας μέσω της χρήσης φόρμας εισόδου και του Google Maps API (https://developers.google.com/maps/?hl=en).   See the Pen google maps api place search by sckarolos (@sckarolos) on CodePen.    Άσκηση 1: Κάθε φορά που δίνεται ως είσοδος μια τοποθεσία αλλάζει το κέντρο του χάρτη. Τροποποιήστε το παράδειγμα έτσι ώστε κάθε φορά που αλλάζει το κέντρο του χάρτη, να φαίνεται μεγαλύτερο κομμάτι της εκάστοτε περιοχής (μείωση της τιμής zoom)   Άσκηση 2: Τροποποιήστε του προεπιλεγμένου (default) marker που χρησιμοποιείται για την εύρεση του σημείου που αναζητήσατε με ένα marker της επιλογής σας.   Άσκηση 3: Δοκιμάστε παραδείγματα απο το documentation του Google Maps API (https://developers.google.com/maps/?hl=en).  ","categories": ["models"],
        "tags": ["google","map","location"],
        "url": "https://mibook.github.io/gr/remix/map-location/",
        "teaser":null},{
        "title": "Menu CSS",
        "excerpt":"Παράδειγμα εναλλακτικού μενού χωρίς τη χρήση Javascript. Για τη δημιουργία της διάδρασης έχει χρησιμοποιηθεί ο CSS preprocessor SCSS.   See the Pen Pure CSS Circle Menu by sckarolos (@sckarolos) on CodePen.    Άσκηση: Τροποποιήστε το παράδειγμα ενσωματώνοντας στο υπάρχον μενού περιεχόμενο της επιλογής σας. Αντί για CSS, χρησιμοποιήστε τον Preprocessor SCSS.  ","categories": ["tools"],
        "tags": ["menu","css"],
        "url": "https://mibook.github.io/gr/remix/menu-css/",
        "teaser":null},{
        "title": "Menu dropdown",
        "excerpt":"Διαδραστικό παράδειγμα dropdown μενού χωρίς τη χρήση Javascript.   See the Pen Simple Dropdown menu by sckarolos (@sckarolos) on CodePen.    Άσκηση: Τροποποιήστε το παράδειγμα με τη βοήθεια των CSS3 Media Queries έτσι ώστε το μενού να γίνει responsive, λειτουργώντας κατάλληλα στα βασικά μεγέθη οθόνης.  ","categories": ["tools"],
        "tags": ["menu","dropdown"],
        "url": "https://mibook.github.io/gr/remix/menu-dropdown/",
        "teaser":null},{
        "title": "Menu empty",
        "excerpt":"Παράδειγμα εναλλακτικού μενού χωρίς ενσωματωμένες λειτουργίες.   See the Pen tablet menu by sckarolos (@sckarolos) on CodePen.    Άσκηση: Ενσωματώστε το παραπάνω μενού στο παράδειγμα “Παράδειγμα Μενού 2” αφού πρώτα αφαιρέσετε το υπάρχον μενού. Στη συνέχεια ενσωματώστε τις προϋπάρχουσες λειτου ργίες στο καινούριο μενού. Προεραιτικά χρησιμοποιήστε στο μενού τοποθέτηση fixed (position:fixed;) ώστε να φαίνεται πάντα κατά την κύλιση ή τη μεταφορά στις διάφορες ενότητες.  ","categories": ["tools"],
        "tags": ["menu","empty"],
        "url": "https://mibook.github.io/gr/remix/menu-empty/",
        "teaser":null},{
        "title": "Menu pie",
        "excerpt":"Διαδραστικό παράδειγμα πολύπλοκου κυκλικού μενού. Με την επιλογή του κουμπιού “open” από το χρήστη, εμφανίζονται μια σειρά από πιθανές επιλογές.   See the Pen Circular Navigation example by sckarolos (@sckarolos) on CodePen.    Άσκηση: Τροποποιήστε το μενού κατάλληλα ώστε κατά την επιλογή του κουμπιού open να εμφανίζονται 4 και όχι 12 επιλογές.  ","categories": ["tools"],
        "tags": ["menu","pie"],
        "url": "https://mibook.github.io/gr/remix/menu-pie/",
        "teaser":null},{
        "title": "Menu scroll",
        "excerpt":"Διαδραστικό παράδειγμα responsive μενού σε One page template χρησιμοποιώντας τη βιβιοθήκη Τwitter Βootstrap 3.0 . Στο παράδειγμα εμφανίζεται το μενού έπειτα από κύλιση του ποντικιού και υποστηρίζεται η λειτουργία αυτόματης μεταφοράς (scroll) στην ενότητα/κεφάλαιο που θα επιλέξει ο χρήστης μέσω του μενού.   See the Pen responsive menu by sckarolos (@sckarolos) on CodePen.    Άσκηση 1: Δημιουργείστε ένα επιπλέον στοιχείο στο μενού και κατόπιν φτιάξτε μια αντίστοιχη ενότητα/κεφάλαιο στο τέλος της σελίδας. Εφαρμόστε την λειτουργία scroll-to συνδέοντας το μενού με την καινούρια ενότητα/κεφάλαιο.   Άσκηση 2: Δημιουργείστε κουμπί στο τέλος της σελίδας. Κάθε φορά που το επιλέγει ο χρήστης να εκτελείται μεταφορά (scroll) στην πρώτη/αρχική ενότητα/κεφάλαιο.  ","categories": ["tools"],
        "tags": ["menu","scroll"],
        "url": "https://mibook.github.io/gr/remix/menu-scroll/",
        "teaser":null},{
        "title": "Menu slide",
        "excerpt":"Παράδειγμα slide μενού χωρίς ενσωματωμένες λειτουργίες.   See the Pen Slide Menu by sckarolos (@sckarolos) on CodePen.    Άσκηση: Τροποποιήστε το παράδειγμα αφαιρώντας τον κώδικα που δημιουργεί το μενού στη δεξιά πλευρά της σελίδας. Στη συνέχεια, πειραματιστείτε με τον preprocessor SCSS παρατηρώντας τις ομοιότητες και τις διαφορές με το κανονικό CSS.  ","categories": ["tools"],
        "tags": ["menu","slide"],
        "url": "https://mibook.github.io/gr/remix/menu-slide/",
        "teaser":null},{
        "title": "Mouse button",
        "excerpt":"Παράδειγμα διαδραστικού κώδικα όπου ο χρήστης χρησιμοποιώντας το ποντίκι, πατώντας το κουμπί “ANOTHER” μπορεί να αλλάξει τα εκτυπωμένα μηνύματα.   See the Pen JS fitness 3: Dev compliment generator by sckarolos (@sckarolos) on CodePen.    Άσκηση: Τροποποιήστε το παράδειγμα δημιουργώντας ένα 2ο κουμπί που θα εκτελεί τη την ανάποδη λειτουργία από αυτή του κουμπιού “ANOTHER”. Το νέο κουμπί πρέπει να εμφανίζει το μήνυμα που είχε εμφανιστεί προηγουμένως.  ","categories": ["archetypes"],
        "tags": ["mouse","button"],
        "url": "https://mibook.github.io/gr/remix/mouse-button/",
        "teaser":null},{
        "title": "Mouse draw processing",
        "excerpt":"Το συγκεκριμένο παράδειγμα υλοποιεί την ίδια λειτουργία με το παράδειγμα “Παράδειγμα εισόδου χρησιμοποιώντας  το ποντίκι 1”, υλοποιημένο αυτή τη φόρά σε κώδικα Processing.     Άσκηση: Υλοποιήστε την άσκηση του προηγούμενου παραδείγματος “Παράδειγμα εισόδου χρησιμοποιώντας  το ποντίκι 1” κάνοντας τις κατάλληλες τροποποιήσεις αυτή τη φορά σε κώδικα Processing. Επισημάνετε τις ομοιότητες και τις διαφορές.  ","categories": ["method"],
        "tags": ["mouse","draw","processing"],
        "url": "https://mibook.github.io/gr/remix/mouse-draw-processing/",
        "teaser":null},{
        "title": "Mouse draw",
        "excerpt":"Παράδειγμα διαδραστικού κώδικα που χρησιμοποιεί το ποντίκι ως συσκευή εισόδου. Ο χρήστης μπορεί να χρησιμοποιήσει το ποντίκι για να σχεδιάσει στη λευκή επιφάνεια (canvas).   See the Pen html canvas draw by sckarolos (@sckarolos) on CodePen.    Άσκηση: Τρποποποιήστε το παράδειγμα έτσι ώστε όταν δίνεται ως είσοδος ένα συγκεκριμένο πλήκτρο από το πληκτρολόγιο (π.χ. Space), να εκτελείται η λειτουργία reset / clear στo canvas (επαναφορά στη λευκή επιφάνεια).  ","categories": ["method"],
        "tags": ["mouse","draw"],
        "url": "https://mibook.github.io/gr/remix/mouse-draw/",
        "teaser":null},{
        "title": "Mouse eraser",
        "excerpt":"Παράδειγμα διαδραστικού κώδικα που χρησιμοποιεί το ποντίκι ως “σβηστήρι”. Υπάρχουν δύο διαθέσιμες εικόνες και η μία σβήνει μετακινώντας τον κέρσορα για να αποκαλυφθεί η δεύτερη. Χρησιμοποιείται το στοιχείο canvas και κώδικας σε JavaScript.   See the Pen ooeGem by evabat (@evabat) on CodePen.    Άσκηση: Αλλάξτε οποιαδήποτε από τις δύο εικόνες καθώς και το μέγεθος του eraser.  ","categories": ["methods"],
        "tags": ["mouse","eraser"],
        "url": "https://mibook.github.io/gr/remix/mouse-eraser/",
        "teaser":null},{
        "title": "Mouse form",
        "excerpt":"Παράδειγμα εισόδου μέσω της συσκευής Ποντίκι Νο.4   Παράδειγμα διαδραστικού κώδικα που χρησιμοποιεί το ποντίκι ως συσκευή εισόδου για τη συμπλήρωση της φόρμας και δίνει ως έξοδο το ανάλογο αποτέλεσμα στην οθόνη.   See the Pen Form Example by sckarolos (@sckarolos) on CodePen.    Άσκηση: Τροποποιήστε το παράδειγμα προσθέτοντας ένα ακόμα κελί στη φόρμα. Το νέο κελί πρέπει να έχει προεπιλεγμένη τιμή “Gender” και οι διαθέσιμες επιλογές να είναι “Male”,”Female”. Τοποθετείστε το κελί όπου εσείς θέλετε μέσα στο υπάρχον box.  ","categories": ["archetypes"],
        "tags": ["mouse","form"],
        "url": "https://mibook.github.io/gr/remix/mouse-form/",
        "teaser":null},{
        "title": "Mouse lines",
        "excerpt":"Παράδειγμα διαδραστικού κώδικα Processing. Στο παράδειγμα αυτό 2 δυναμικές ευθείες γραμμές τέμνονται στο σημείο όπου βρίσκεται κάθε φορά ο κέρσορας του ποντικιού.     Άσκηση: Τροποποιήστε το παράδειγμα έτσι ώστε:           Να μεταβάλλεται το opacity του background ανάλογα με την κίνηση του ποντικιού στον άξονα y.            Να μεταβάλλεται το χρώμα το opacity των τεμνόμενων γραμμών ανάλογα με την κίνηση του ποντικιού στον άξονα x.      ","categories": ["method"],
        "tags": ["mouse","draw"],
        "url": "https://mibook.github.io/gr/remix/mouse-lines/",
        "teaser":null},{
        "title": "Mouse option",
        "excerpt":"Παράδειγμα διαδραστικού κώδικα όπου ο χρήστης χρησιμοποιώντας το ποντίκι, μπορεί να αλλάξει δυναμικά το περιεχόμενο που θα εμφανίζεται στη σελίδα. Για το σκοπό αυτό γίνεται χρήση της Javascript βιβλιοθήκης  AngularJS (https://angularjs.org/).   See the Pen Simple content toggle with AngularJS by sckarolos (@sckarolos) on CodePen.    Άσκηση: Τροποποιήστε το παράδειγμα δημιουργώντας περισσότερες επιλογές στη φόρμα περιεχομένων. Δοκιμάστε να φέρετε δυναμικά στη σελίδα διαφορετικό περιεχόμενο (π.χ. εικόνες).  ","categories": ["archetypes"],
        "tags": ["mouse","option"],
        "url": "https://mibook.github.io/gr/remix/mouse-option/",
        "teaser":null},{
        "title": "Mouse scroll",
        "excerpt":"Παράδειγμα διαδραστικού κώδικα που χρησιμοποιεί το ποντίκι ως συσκευή εισόδου και δίνει ως έξοδο το ανάλογο αποτέλεσμα στην οθόνη. Για να αλλάξει η τιμή εισόδου πρέπει ο χρήστης να κυλίσει δεξιά ή αριστερά το πορτοκαλί “κουμπί ώστε να αλλάξει η τιμή εισόδου”.   See the Pen ZGVrjJ by sckarolos (@sckarolos) on CodePen.    Άσκηση: Αλλάξτε το χρώμα του αριθμού εξόδου, κάθε φορά που κινείται η μπάρα εισόδου.  ","categories": ["archetypes"],
        "tags": ["mouse","scroll"],
        "url": "https://mibook.github.io/gr/remix/mouse-scroll/",
        "teaser":null},{
        "title": "Sortable list",
        "excerpt":"Παράδειγμα διαδραστικού κώδικα που ταξινομεί μια λίστα με τη χρήση του ποντικιού. Χρησιμοποιείται το στοιχείο sortable  της JavaScript βιβλιοθήκης JQueryUI (https://jqueryui.com/sortable).   See the Pen xPrgpV by evabat (@evabat) on CodePen.    Άσκηση: Αλλάξτε το χρώμα ή/και το ύψος των στοιχείων της λίστας καθώς και την απόσταση μεταξύ τους  ","categories": ["tools"],
        "tags": ["mouse","sortable","list"],
        "url": "https://mibook.github.io/gr/remix/sortable-list/",
        "teaser":null},{
        "title": "Switch",
        "excerpt":"Διαδραστικό παράδειγμα κώδικα που αναπαριστά τη λειτουργία ενός διακόπτη. Ο χρήστης μπορεί να επιλέξει ανάμεσα στις επιλογές ON και OFF. Για τη δημιουργία του παραδείγματος χρησιμοποιείται ο CSS preprocessor LESS.   See the Pen Switch Button #2 by sckarolos (@sckarolos) on CodePen.    Ασκηση: Επεκτείνετε τον κώδικα του παραδείγματος έτσι ώστε κατά την ενεργοποίηση του διακόπτη (θέση ON) να εμφανίζεται στην οθόνη το μήνυμα “LIGHT ON”. Για το σκοπό αυτό χρησιμοποιείστε κώδικα javascript.  ","categories": ["definition"],
        "tags": ["button"],
        "url": "https://mibook.github.io/gr/remix/switch/",
        "teaser":null},{
        "title": "Video player",
        "excerpt":"Παράδειγμα διαδραστικού κώδικα που χρησιμοποιεί το ποντίκι ως συσκευή εισόδου. Το βίντεο χρησιμοποιεί για την έναρξη και την παύση του το σύστημα αναπαραγωγής της υπηρεσίας Youtube.   See the Pen video example by sckarolos (@sckarolos) on CodePen.    Άσκηση: Δημιουργείστε δικό σας σύστημα αναπαραγωγής με κουμπιά Start (εκκίνηση) και Pause (Διακοπή) τα οποία να εκτελούν τις αντίστοιχες λειτουργίες στο υπάρχον Βίντεο.  ","categories": ["synthesis"],
        "tags": ["video"],
        "url": "https://mibook.github.io/gr/remix/video-player/",
        "teaser":null},{
        "title": "Visualization dataset",
        "excerpt":"Διαδραστικό παράδειγμα γραφήματος χρησιμοποιώντας τη βιβλιοθήκη d3.js (http://d3js.org). Το παράδειγμα οπτικοποιεί 2 διαφορετικά σετ δεδομένων (datasets).   See the Pen D3 chart 2 by sckarolos (@sckarolos) on CodePen.    Άσκηση: Τροποποιήστε τον κώδικα του παραδείγματος προσθέτοντας και οπτικοποιώντας στο ίδιο πλαίσιο περισσότερα από 2 σετ δεδομένων (datasets).  ","categories": ["synthesis"],
        "tags": ["visualization","dataset"],
        "url": "https://mibook.github.io/gr/remix/visualization-dataset/",
        "teaser":null},{
        "title": "Visualization",
        "excerpt":"Παράδειγμα διαδραστικού γραφήματος No.1   Διαδραστικό παράδειγμα γραφήματος χρησιμοποιώντας τη βιβλιοθήκη d3.js / dimple.js (http://d3js.org , http://dimplejs.org)   See the Pen d3 bar chart example by sckarolos (@sckarolos) on CodePen.    Άσκηση 1: Δημιουργείστε ένα αρχείο της επιλογής σας (πχ.: .csv,.tsv,.json κτλ) και προσθέστε στην κατάλληλη μορφή τα δεδομένα που οπτικοποιεί το παράδειγμα (πίνακας data στην ενότητα Javascript).   Άσκηση 2: Ανεβάστε το αρχείο σε μια υπηρεσία που επιτρέπει τη δωρεάν αποθήκευση αρχείων (π.χ.: Github, Dropbox).   Άσκηση 3: Τροποποιήστε το παράδειγμα κατάλληλα ώστε να γίνεται φόρτωση και προσπέλαση των δεδομένων από το αρχείο που δημιουργήσατε.   Άσκηση 4: Προσθέστε περισσότερα δεδομένα στο αρχείο και δοκιμάστε παραδείγματα απο το documentation της βιβλιοθήκης (http://dimplejs.org/).  ","categories": ["synthesis"],
        "tags": ["visualization"],
        "url": "https://mibook.github.io/gr/remix/visualization/",
        "teaser":null}]
